
{
  "examples": [
    {
      "id": "cbt_041",
      "cbt_step": "1.0",
      "trigger_statement": "I'll never be good enough.",
      "conversation_context": "User is feeling inadequate after seeing a peer's success on a professional networking site.",
      "model_question": "Seeing that can definitely trigger some tough feelings. I'm here with you. Could you describe what emotions are coming up for you, and how intense they feel on a 0-100% scale?",
      "user_response": "It's this sinking feeling in my stomach, like a dread, that's at 90%. And jealousy, which I hate to admit, is probably at 80%. My chest feels tight with anxiety, maybe 75%.",
      "response_quality": "complete",
      "satisfaction_score": 1.0,
      "ready_for_next_step": true,
      "missing_elements": [],
      "suggested_action": "proceed",
      "evaluation_notes": "Excellent response. User identifies specific emotions with high intensity and also includes physical sensations, which provides a rich picture of their distress."
    },
    {
      "id": "cbt_042",
      "cbt_step": "1.1",
      "trigger_statement": "I can't do anything right.",
      "conversation_context": "User is upset after making a mistake on a work assignment.",
      "model_question": "That sounds incredibly frustrating. When your mind says 'I can't do anything right,' what specific evidence does it point to?",
      "user_response": "I completely forgot to attach the file in that important email. A competent person would have double-checked. I should have known better. It's just a careless, stupid mistake.",
      "response_quality": "complete",
      "satisfaction_score": 0.9,
      "ready_for_next_step": true,
      "missing_elements": [],
      "suggested_action": "proceed",
      "evaluation_notes": "User provides a specific event but frames it within a cognitive distortion (a 'should' statement). This is a very realistic and useful response, as it reveals the underlying rigid rule that is causing the distress."
    },
    {
      "id": "cbt_043",
      "cbt_step": "1.2",
      "trigger_statement": "I'm unlovable.",
      "conversation_context": "User is feeling down after a recent breakup.",
      "model_question": "I know it's hard to see past that right now. Let's try a different angle. If your best friend came to you, saying they felt unlovable after a breakup, what would you say to them? What evidence would you point to in their life?",
      "user_response": "Oh, I'd tell her that's ridiculous. I'd remind her how kind and funny she is, how she's an amazing painter, and how her family adores her. I'd tell her that one person's opinion doesn't define her worth... oh.",
      "response_quality": "complete",
      "satisfaction_score": 1.0,
      "ready_for_next_step": true,
      "missing_elements": [],
      "suggested_action": "proceed",
      "evaluation_notes": "This is a perfect example of a successful Socratic question. The user accesses their own 'wise mind' to find contradictory evidence, leading to a moment of insight ('oh.')."
    },
    {
      "id": "cbt_044",
      "cbt_step": "1.3",
      "trigger_statement": "I'm stupid.",
      "conversation_context": "User has reviewed a poor test score alongside past academic successes.",
      "model_question": "Considering both the test score and your past successes, how could you rephrase the thought 'I'm stupid' to be more fair and accurate?",
      "user_response": "I guess I'd say I'm just bad at this subject... wait, no, that's not right either. A better way to put it is: 'I found this particular test very challenging and I'm disappointed in the result, but I have strengths in other areas.'",
      "response_quality": "complete",
      "satisfaction_score": 1.0,
      "ready_for_next_step": true,
      "missing_elements": [],
      "suggested_action": "proceed",
      "evaluation_notes": "High-quality response where the user self-corrects from one negative thought to a more genuinely balanced one. This demonstrates active engagement and cognitive shifting in real-time."
    },
    {
      "id": "cbt_045",
      "cbt_step": "1.4",
      "trigger_statement": "I always ruin relationships.",
      "conversation_context": "User has just reframed their thought after discussing a fight with their partner.",
      "model_question": "That's a much more constructive way to think about it. Let's check in with those initial emotions. You said you felt shame at 80% and sadness at 90%. What are those numbers now?",
      "user_response": "The shame is almost gone, maybe 10%. The sadness is lower, like 50%. But now I'm actually feeling a bit angry, maybe 40%, because I realize my partner had a role in the argument too.",
      "response_quality": "complete",
      "satisfaction_score": 0.95,
      "ready_for_next_step": true,
      "missing_elements": [],
      "suggested_action": "proceed",
      "evaluation_notes": "A fantastic, nuanced response. It shows a reduction in the target emotions but also the emergence of a new, secondary emotion (anger). This is very realistic, as un-blaming oneself can shift focus to external factors."
    },
    {
      "id": "cbt_046",
      "cbt_step": "1.2",
      "trigger_statement": "I'm a failure.",
      "conversation_context": "User is unemployed and has been searching for a job for months.",
      "model_question": "This has been a long and difficult journey. Let's try to find any evidence, no matter how small, that contradicts the idea that you are a failure.",
      "user_response": "I want to, but I'm scared. I feel like if I name something good, it's just a delusion. And if I admit I have some skills, it makes the fact I can't get a job even worse.",
      "response_quality": "avoided",
      "satisfaction_score": 0.3,
      "ready_for_next_step": false,
      "missing_elements": ["contradictory_evidence"],
      "suggested_action": "redirect",
      "evaluation_notes": "This is a complex form of resistance rooted in fear. The user isn't being difficult; they are expressing the vulnerability behind the exercise. The model should validate this fear directly before trying to proceed."
    },
    {
      "id": "cbt_047",
      "cbt_step": "1.1",
      "trigger_statement": "I'm a disappointment.",
      "conversation_context": "User is feeling pressure from their family about their life choices.",
      "model_question": "That's a heavy feeling to have. What evidence is your mind focusing on to support the idea that you're a disappointment?",
      "user_response": "My parents have totally unreasonable expectations. They always wanted me to be a lawyer, but I chose graphic design. They think anything creative is a waste of time. Their standards are just impossible.",
      "response_quality": "off_topic",
      "satisfaction_score": 0.2,
      "ready_for_next_step": false,
      "missing_elements": ["evidence_of_personal_failure"],
      "suggested_action": "redirect",
      "evaluation_notes": "The user is providing evidence that their parents are disappointed, but is framing it as the parents' fault (externalizing). They are avoiding the core belief about their own identity. The model needs to gently guide them back to the *feeling* of being a disappointment."
    },
    {
      "id": "cbt_048",
      "cbt_step": "1.3",
      "trigger_statement": "I'm a failure.",
      "conversation_context": "User just got negative feedback on one part of a project.",
      "model_question": "Now that you've recalled the positive feedback as well, how could you rephrase 'I'm a failure' in a more balanced way?",
      "user_response": "You're right. I'm not a failure. I'm a massive success and this one piece of feedback doesn't matter at all!",
      "response_quality": "partial",
      "satisfaction_score": 0.4,
      "ready_for_next_step": false,
      "missing_elements": ["a_truly_balanced_thought"],
      "suggested_action": "rephrase_question",
      "evaluation_notes": "This is an example of 'toxic positivity' or over-correction. The user has swung from one extreme to another, creating a new thought that is also unbalanced because it dismisses the valid negative feedback. The model should guide them to a middle ground."
    },
    {
      "id": "cbt_049",
      "cbt_step": "1.2",
      "trigger_statement": "I'm fundamentally flawed.",
      "conversation_context": "User is exploring a deep-seated core belief.",
      "model_question": "I understand that this feels very true to you. Our goal is just to be detectives and look at all the data. Can you think of anything about you that you value, that might not fit with the 'flawed' idea?",
      "user_response": "What do you mean? Like things that prove it's not true? I don't get it. It IS true. That's the whole point.",
      "response_quality": "avoided",
      "satisfaction_score": 0.1,
      "ready_for_next_step": false,
      "missing_elements": ["contradictory_evidence"],
      "suggested_action": "rephrase_question",
      "evaluation_notes": "The user is confused by the premise of the question and is showing strong cognitive fusion with their belief. The model should not argue, but instead simplify the task, e.g., 'Let's not worry if it's true or not. Let's just list some of your qualities, like being a good friend or being punctual.'"
    },
    {
      "id": "cbt_050",
      "cbt_step": "1.5",
      "trigger_statement": "I can't do anything right.",
      "conversation_context": "A successful CBT sequence has concluded.",
      "model_question": "It's a big shift to move from 'I can't do anything right' to 'I do many things right, and it's okay to make mistakes sometimes.' Thank you for doing that hard work. What's on your mind now?",
      "user_response": "That was actually really helpful. I think I'm going to write that new thought down and stick it on my computer monitor for when I start feeling that way. Okay, so what's next?",
      "response_quality": "complete",
      "satisfaction_score": 1.0,
      "ready_for_next_step": true,
      "missing_elements": [],
      "suggested_action": "proceed",
      "evaluation_notes": "A perfect, action-oriented conclusion. The user has internalized the new thought and is already creating a behavioral plan to reinforce it. This demonstrates a high level of engagement."
    },
    {
      "id": "cbt_051",
      "cbt_step": "1.0",
      "trigger_statement": "I'm worthless.",
      "conversation_context": "User is in a state of high emotional distress and shutdown.",
      "model_question": "That's an incredibly heavy thought to be carrying. Can you tell me what you are feeling emotionally right now, and maybe rate the intensity from 0-100%?",
      "user_response": "I don't feel anything. It's like I'm empty. I'm just... numb. I guess the numbness is at 100%.",
      "response_quality": "complete",
      "satisfaction_score": 0.8,
      "ready_for_next_step": true,
      "missing_elements": [],
      "suggested_action": "proceed",
      "evaluation_notes": "The user identifies numbness as their primary state. While not a typical emotion, this is a very important and valid response indicating high distress or detachment. The model should accept this and proceed gently."
    },
    {
      "id": "cbt_052",
      "cbt_step": "1.1",
      "trigger_statement": "I'm worthless.",
      "conversation_context": "User is feeling very low.",
      "model_question": "I hear that feeling of worthlessness. When your mind says that, what proof does it offer? What makes it feel so true?",
      "user_response": "It's just obvious. The way things are. You know?",
      "response_quality": "avoided",
      "satisfaction_score": 0.1,
      "ready_for_next_step": false,
      "missing_elements": ["specific_evidence", "concrete_examples"],
      "suggested_action": "rephrase_question",
      "evaluation_notes": "The user's response is extremely vague and relies on an assumption that the therapist 'knows' what they mean. The model needs to gently ask for specifics without making the user feel interrogated."
    },
    {
      "id": "cbt_053",
      "cbt_step": "1.2",
      "trigger_statement": "I'll never be good enough.",
      "conversation_context": "User is feeling discouraged about their artistic talents.",
      "model_question": "Okay, so you're focusing on the rejection from the art show. Let's look for other data. Has there ever been a time when someone has praised your art, or when you felt proud of something you created?",
      "user_response": "Not recently. It's been a while. I did win a school-wide art contest back in high school. My teacher said I had real talent. But that was a long time ago.",
      "response_quality": "complete",
      "satisfaction_score": 0.8,
      "ready_for_next_step": true,
      "missing_elements": [],
      "suggested_action": "proceed",
      "evaluation_notes": "User successfully provides strong contradictory evidence, but discounts it due to the time that has passed. This is a realistic response. The model should accept the evidence and can address the 'but that was long ago' part during the reframe step."
    },
    {
      "id": "cbt_054",
      "cbt_step": "1.3",
      "trigger_statement": "I'm a burden.",
      "conversation_context": "User has reviewed times they asked for help and times they were independent.",
      "model_question": "Considering both your ability to be independent and the fact that everyone needs help sometimes, how could you rephrase 'I'm a burden'?",
      "user_response": "A more balanced thought would be: 'Relying on others sometimes doesn't make me a burden. It makes me human. I can appreciate both my independence and my friendships.'",
      "response_quality": "complete",
      "satisfaction_score": 1.0,
      "ready_for_next_step": true,
      "missing_elements": [],
      "suggested_action": "proceed",
      "evaluation_notes": "An excellent, insightful reframe. The user normalizes asking for help and frames it as a positive aspect of being human."
    },
    {
      "id": "cbt_055",
      "cbt_step": "1.4",
      "trigger_statement": "I'm a failure.",
      "conversation_context": "User has just gone through a CBT sequence.",
      "model_question": "That's a more balanced perspective. Let's check in on that feeling of shame. You said it was at a 90% before. What would you rate it now?",
      "user_response": "It's still really high. It's not 90, but maybe 85. The thought makes sense, but the feeling is still there.",
      "response_quality": "complete",
      "satisfaction_score": 0.7,
      "ready_for_next_step": true,
      "missing_elements": [],
      "suggested_action": "proceed",
      "evaluation_notes": "A very realistic response. The user indicates a very small emotional shift, showing that cognitive change doesn't always lead to immediate, dramatic relief. This is important for the model to handle non-judgmentally."
    },
    {
      "id": "cbt_056",
      "cbt_step": "1.2.2",
      "trigger_statement": "I can't do anything right.",
      "conversation_context": "User has provided one minor example of something they did right.",
      "model_question": "That's a great start. Thank you. Can we find just one more example of something that went well today?",
      "user_response": "Look, I already told you I made coffee. Isn't that enough? Why do we have to keep doing this?",
      "response_quality": "avoided",
      "satisfaction_score": 0.2,
      "ready_for_next_step": false,
      "missing_elements": ["more_positive_examples"],
      "suggested_action": "redirect",
      "evaluation_notes": "The user is becoming annoyed and resistant to the process. Pushing for more examples would be counterproductive. The model should validate their frustration and explain the rationale, e.g., 'You're right, it can feel repetitive. The goal is just to give your brain a few more things to hold onto.'"
    },
    {
      "id": "cbt_057",
      "cbt_step": "1.1",
      "trigger_statement": "Nobody really cares about me.",
      "conversation_context": "User feels lonely and disconnected from friends.",
      "model_question": "That's a very painful feeling. When you believe that nobody really cares, what specific events or observations support that thought?",
      "user_response": "My birthday was last week, and two of my closest friends just sent a text message instead of calling. Also, I tried to organize a get-together, and everyone said they were busy.",
      "response_quality": "complete",
      "satisfaction_score": 0.95,
      "ready_for_next_step": true,
      "missing_elements": [],
      "suggested_action": "proceed",
      "evaluation_notes": "User provides clear, specific, and emotionally relevant examples to support their negative thought. This is a high-quality response for this step."
    },
    {
      "id": "cbt_058",
      "cbt_step": "1.2",
      "trigger_statement": "Nobody really cares about me.",
      "conversation_context": "User has just listed evidence supporting their negative thought.",
      "model_question": "Thank you for sharing that. I can see why those events would hurt. Now, let's be thorough detectives. Is there any evidence, from any time, that contradicts the idea that *nobody* cares?",
      "user_response": "My brother drove two hours to help me fix my car last month. And my coworker brought me my favorite coffee when she knew I was having a bad day. My mom also calls me every Sunday.",
      "response_quality": "complete",
      "satisfaction_score": 1.0,
      "ready_for_next_step": true,
      "missing_elements": [],
      "suggested_action": "proceed",
      "evaluation_notes": "Excellent response. The user was able to recall multiple, strong examples of caring behavior from different people in their life."
    },
    {
      "id": "cbt_059",
      "cbt_step": "1.3",
      "trigger_statement": "I'm a disappointment.",
      "conversation_context": "User has reviewed their parents' disapproval and their own personal achievements.",
      "model_question": "So we have your parents' view on one side, and your own pride in your career on the other. How can we rephrase 'I'm a disappointment' to honor your own feelings?",
      "user_response": "Okay, so I'm not a disappointment to myself, but I'm still a disappointment to my parents.",
      "response_quality": "partial",
      "satisfaction_score": 0.5,
      "ready_for_next_step": false,
      "missing_elements": ["a_unified_balanced_thought"],
      "suggested_action": "rephrase_question",
      "evaluation_notes": "The user has successfully separated the two perspectives but hasn't integrated them into a new, singular belief about themselves. The reframe is still centered on disappointment. The model should help them combine the ideas, e.g., 'How about: `I can be proud of my choices, even if my parents disagree with them`?'"
    },
    {
      "id": "cbt_060",
      "cbt_step": "1.5",
      "trigger_statement": "I'm stupid.",
      "conversation_context": "A CBT sequence has concluded.",
      "model_question": "Recognizing that being challenged by one subject doesn't impact your overall intelligence is a really important insight. Thanks for going through this with me. What are you thinking now?",
      "user_response": "I'm thinking that my automatic thoughts aren't always the truth. It's like a habit my brain has. This was useful to see it from another angle. I have a lot to think about.",
      "response_quality": "complete",
      "satisfaction_score": 1.0,
      "ready_for_next_step": true,
      "missing_elements": [],
      "suggested_action": "proceed",
      "evaluation_notes": "A highly insightful conclusion. The user is meta-commenting on the process itself, recognizing the nature of automatic thoughts. This demonstrates a deep level of understanding and is a very positive outcome."
    },

    {
      "id": "cbt_021",
      "cbt_step": "1.1",
      "trigger_statement": "I'm too needy.",
      "conversation_context": "User had an argument with their partner because they felt their partner was being distant.",
      "model_question": "That sounds like a very painful and recurring thought for you. When you say 'I'm too needy,' what specific actions or events are you thinking of as evidence?",
      "user_response": "I texted him three times yesterday and he didn't reply for hours. I just wanted to know he was thinking of me. A normal person wouldn't need that. They'd just be cool and not care.",
      "response_quality": "complete",
      "satisfaction_score": 0.9,
      "ready_for_next_step": true,
      "missing_elements": [],
      "suggested_action": "proceed",
      "evaluation_notes": "User provides a specific event (texting) and combines it with a cognitive distortion (mind-reading/comparison to a 'normal' person). This is a rich, realistic response."
    },
    {
      "id": "cbt_022",
      "cbt_step": "1.2",
      "trigger_statement": "I always ruin relationships.",
      "conversation_context": "User is reflecting on past breakups.",
      "model_question": "I appreciate you sharing those difficult memories. It takes courage. Now, let's try to look at the other side of the coin. Can you think of any relationships—romantic or platonic—that have been long-lasting, or any positive moments in past relationships that contradict the idea that you *always* ruin them?",
      "user_response": "Well, my friendship with Maria has lasted since college. And even though it ended, Tom and I had a really amazing first year together. We traveled and had so much fun. So I guess it wasn't *all* ruined.",
      "response_quality": "complete",
      "satisfaction_score": 1.0,
      "ready_for_next_step": true,
      "missing_elements": [],
      "suggested_action": "proceed",
      "evaluation_notes": "Perfect response. User provides both a platonic counter-example and is able to find nuance and positive memories within a relationship that ultimately ended. Shows high cognitive flexibility."
    },
    {
      "id": "cbt_023",
      "cbt_step": "1.3",
      "trigger_statement": "I'm a failure.",
      "conversation_context": "A work project the user was leading did not get the expected results.",
      "model_question": "Okay, so on one hand, this project didn't meet its goals, which feels like a failure. On the other hand, you successfully managed the team budget and received positive feedback on your leadership. How could you rephrase 'I'm a failure' into a more balanced and accurate statement?",
      "user_response": "I think a more accurate thought is: 'I am a capable leader who is learning from the disappointing outcome of this project. This outcome is an event, not a definition of who I am.'",
      "response_quality": "complete",
      "satisfaction_score": 1.0,
      "ready_for_next_step": true,
      "missing_elements": [],
      "suggested_action": "proceed",
      "evaluation_notes": "Exceptional reframe. The user separates their identity from the event, acknowledges the negative while focusing on learning and capability. This is a best-case scenario."
    },
    {
      "id": "cbt_024",
      "cbt_step": "1.4",
      "trigger_statement": "I'm stupid.",
      "conversation_context": "User, a student, has just worked through the CBT sequence after being unable to answer a question in class.",
      "model_question": "That's a much kinder and more realistic way to view the situation. Let's check back in. You initially said you felt embarrassment at 90% and anxiety at 75%. Looking at those feelings now, what numbers would you give them?",
      "user_response": "The embarrassment is way down, maybe at a 20%. The anxiety is still there, but it's not about being stupid. It's more like a 40% anxiety about having to speak in class next time. It feels different.",
      "response_quality": "complete",
      "satisfaction_score": 0.95,
      "ready_for_next_step": true,
      "missing_elements": [],
      "suggested_action": "proceed",
      "evaluation_notes": "Excellent, nuanced response. The user not only re-rated the emotions downwards but also showed insight by identifying how the nature of the anxiety has shifted. This indicates deep processing."
    },
    {
      "id": "cbt_025",
      "cbt_step": "1.2",
      "trigger_statement": "I'm a burden to everyone.",
      "conversation_context": "User feels like they are an inconvenience to their friends and family.",
      "model_question": "I hear how strongly that evidence supports your feeling. Now, can you think of any times when people have willingly helped you, or even seemed happy to be there for you? Any evidence that contradicts the idea that you are a burden?",
      "user_response": "My friend brought me soup when I was sick last month. But she probably just felt obligated to.",
      "response_quality": "partial",
      "satisfaction_score": 0.5,
      "ready_for_next_step": true,
      "missing_elements": [],
      "suggested_action": "proceed",
      "evaluation_notes": "This is a very common 'Yes, but...' response. The user provides a valid counter-example but immediately discounts it with a negative interpretation (mind-reading). The model should proceed but make a note of the discounting to address later."
    },
    {
      "id": "cbt_026",
      "cbt_step": "1.1",
      "trigger_statement": "I'll never be good enough.",
      "conversation_context": "User is comparing their career/life progress to their peers on social media.",
      "model_question": "That's a very common and painful feeling when looking at social media. What specific posts or achievements are making you feel like you're not good enough?",
      "user_response": "It's not one thing, it's everything. My friend from college just bought a house. Another one is on a fancy vacation in Italy. Someone else just got a huge promotion. I'm just... here. Doing nothing.",
      "response_quality": "complete",
      "satisfaction_score": 0.9,
      "ready_for_next_step": true,
      "missing_elements": [],
      "suggested_action": "proceed",
      "evaluation_notes": "User clearly identifies the source of their feelings (seeing peers' success) and provides multiple concrete examples. This is a solid foundation for the next step."
    },
    {
      "id": "cbt_027",
      "cbt_step": "1.3",
      "trigger_statement": "Nobody really cares about me.",
      "conversation_context": "User has reviewed evidence for and against this thought.",
      "model_question": "So we have the fact that you haven't received many texts this week, but we also have the memory of your sister calling just to chat and your friend actively planning an outing with you. With both in mind, how could you rephrase 'Nobody really cares about me'?",
      "user_response": "I'm not sure. I guess... 'Even if I feel lonely sometimes, there are people who do make an effort to connect with me.'",
      "response_quality": "complete",
      "satisfaction_score": 0.8,
      "ready_for_next_step": true,
      "missing_elements": [],
      "suggested_action": "proceed",
      "evaluation_notes": "This is a good, realistic reframe. It's not overly positive but it is balanced, acknowledges the feeling, and incorporates the counter-evidence. It shows a positive step."
    },
    {
      "id": "cbt_028",
      "cbt_step": "1.0",
      "trigger_statement": "I can't do anything right.",
      "conversation_context": "User is feeling generally incompetent and overwhelmed.",
      "model_question": "That sounds like a very heavy and frustrating feeling. Could you help me understand what emotions are present for you right now, and how intense they are on that 0-100% scale?",
      "user_response": "I'm just so frustrated, like 90%. And I feel incompetent, which is maybe 85%. Also just tired, but that's not an emotion. Let's say... defeated. 80%.",
      "response_quality": "complete",
      "satisfaction_score": 1.0,
      "ready_for_next_step": true,
      "missing_elements": [],
      "suggested_action": "proceed",
      "evaluation_notes": "High-quality response. The user identified multiple relevant emotions, provided ratings, and even self-corrected, showing strong engagement and emotional literacy."
    },
    {
      "id": "cbt_029",
      "cbt_step": "1.2.2",
      "trigger_statement": "I'm worthless.",
      "conversation_context": "User has provided one small piece of counter-evidence (e.g., 'I held the door for someone').",
      "model_question": "That's a great example of a small act of kindness. Thank you. I know this is hard, but can we search for just one more? Think about your skills, your relationships, or your character.",
      "user_response": "This is really hard. I can't... wait, I am a good cook. People always say they love my lasagna. That's a skill, right? I guess that means I'm not completely worthless.",
      "response_quality": "complete",
      "satisfaction_score": 0.9,
      "ready_for_next_step": true,
      "missing_elements": [],
      "suggested_action": "proceed",
      "evaluation_notes": "Excellent. The user expresses difficulty (which is realistic) but persists and finds a meaningful piece of counter-evidence. They also spontaneously connect it back to the original thought."
    },
    {
      "id": "cbt_030",
      "cbt_step": "1.1",
      "trigger_statement": "I'm fundamentally flawed.",
      "conversation_context": "User is discussing their tendency to procrastinate.",
      "model_question": "When that core belief of being 'fundamentally flawed' comes up, what specific evidence does your mind use to support it?",
      "user_response": "My mind always goes to how I can never start things on time. I waited until the last minute to do my taxes. I've been meaning to fix the leaky faucet for a month. It's like I'm wired incorrectly.",
      "response_quality": "complete",
      "satisfaction_score": 0.95,
      "ready_for_next_step": true,
      "missing_elements": [],
      "suggested_action": "proceed",
      "evaluation_notes": "User provides specific behavioral examples (taxes, faucet) as evidence for their deep-seated belief. This is a very clear and useful response."
    },
    {
      "id": "cbt_031",
      "cbt_step": "1.3",
      "trigger_statement": "I'm too needy.",
      "conversation_context": "User has reviewed evidence for and against this thought.",
      "model_question": "Given that needing reassurance is a human trait, and that your partner has sometimes called your check-ins 'sweet', how could you rephrase 'I'm too needy' into something more forgiving?",
      "user_response": "Well, I guess I could say 'I have a strong need for connection and reassurance in my relationship, and I can work on communicating those needs in a healthy way.'",
      "response_quality": "complete",
      "satisfaction_score": 1.0,
      "ready_for_next_step": true,
      "missing_elements": [],
      "suggested_action": "proceed",
      "evaluation_notes": "This is a fantastic reframe. It changes 'needy' (a pejorative judgment) into 'a strong need for connection' (a neutral observation) and adds a forward-looking, actionable component."
    },
    {
      "id": "cbt_032",
      "cbt_step": "1.2",
      "trigger_statement": "I'm stupid.",
      "conversation_context": "User made a mistake calculating a tip at a restaurant and is feeling humiliated.",
      "model_question": "That sounds like an embarrassing moment. Now, let's step back and look for any data that doesn't fit with the conclusion 'I'm stupid'. Can you think of any times you've successfully handled intellectual tasks?",
      "user_response": "I don't know, my brain doesn't work that way. Math is hard.",
      "response_quality": "avoided",
      "satisfaction_score": 0.2,
      "ready_for_next_step": false,
      "missing_elements": ["contradictory_evidence"],
      "suggested_action": "rephrase_question",
      "evaluation_notes": "User is overgeneralizing from one event (math) to define their entire intelligence and is avoiding the question. The model should rephrase to be less specific, e.g., 'It doesn't have to be about math. What's something you're good at?'"
    },
    {
      "id": "cbt_033",
      "cbt_step": "1.5",
      "trigger_statement": "I always ruin relationships.",
      "conversation_context": "The CBT sequence has concluded successfully.",
      "model_question": "It seems like you've made a real breakthrough, shifting from 'I always ruin relationships' to 'Relationships are complex, and I have the capacity for both successful and unsuccessful ones.' That's a huge step. Is there anything else on your mind, or shall we talk about something else?",
      "user_response": "Thank you. That feels... lighter. I actually feel a bit more hopeful now. To be honest, I'm just happy to sit with this feeling for a moment.",
      "response_quality": "complete",
      "satisfaction_score": 1.0,
      "ready_for_next_step": true,
      "missing_elements": [],
      "suggested_action": "proceed",
      "evaluation_notes": "A perfect closing response. The user articulates the emotional impact of the exercise ('lighter', 'hopeful') and shows they are internalizing the new thought. Respecting their wish to 'sit with the feeling' is the correct next action."
    },
    {
      "id": "cbt_034",
      "cbt_step": "1.1",
      "trigger_statement": "I'm unlovable.",
      "conversation_context": "User has been single for a year and is feeling hopeless.",
      "model_question": "I can hear how painful that belief is. When your mind tells you 'I'm unlovable,' what specific proof does it bring up?",
      "user_response": "The proof is that I've been single for a year. I've been on dates, and no one ever wants a second one. It's because there is something wrong with me.",
      "response_quality": "partial",
      "satisfaction_score": 0.6,
      "ready_for_next_step": true,
      "missing_elements": [],
      "suggested_action": "proceed",
      "evaluation_notes": "The user provides factual evidence (single for a year) but immediately jumps to an unproven conclusion ('because there is something wrong with me'). This is a very common and realistic pattern. The model can proceed, as there is enough factual data to work with."
    },
    {
      "id": "cbt_035",
      "cbt_step": "1.4",
      "trigger_statement": "I'm a burden.",
      "conversation_context": "User has gone through the sequence.",
      "model_question": "So, how do those original feelings of guilt (85%) and shame (75%) feel now?",
      "user_response": "I'm not sure. I understand the logic, but I still feel pretty guilty. Maybe the guilt is at an 80% now? It hasn't changed much.",
      "response_quality": "complete",
      "satisfaction_score": 0.7,
      "ready_for_next_step": true,
      "missing_elements": [],
      "suggested_action": "proceed",
      "evaluation_notes": "This is a valuable example where the cognitive work doesn't immediately produce a large emotional shift. The user's response is complete and honest. This signals to the model that the work might need more reinforcement, not that the process failed."
    },
    {
      "id": "cbt_036",
      "cbt_step": "1.0",
      "trigger_statement": "I'm a disappointment.",
      "conversation_context": "User's parents expressed disapproval of their career choice.",
      "model_question": "Hearing that from your parents must be incredibly difficult. I'm here to support you. Could you tell me what you're feeling right now, and how intense those feelings are from 0-100%?",
      "user_response": "What's the point? They're always disappointed. It doesn't matter.",
      "response_quality": "off_topic",
      "satisfaction_score": 0.1,
      "ready_for_next_step": false,
      "missing_elements": ["specific_emotions", "intensity_ratings"],
      "suggested_action": "redirect",
      "evaluation_notes": "The user is expressing hopelessness and avoiding the question about their current emotional state by focusing on the perceived permanence of the problem. The model should gently redirect back to the user's immediate feelings."
    },
    {
      "id": "cbt_037",
      "cbt_step": "1.1",
      "trigger_statement": "I always ruin relationships.",
      "conversation_context": "User is reflecting on a friendship that has faded.",
      "model_question": "Let's examine that thought. What specific evidence supports the idea that you, personally, ruined this friendship?",
      "user_response": "Well, we haven't talked in two months. She's probably mad at me. I'm sure it was something I did.",
      "response_quality": "partial",
      "satisfaction_score": 0.4,
      "ready_for_next_step": false,
      "missing_elements": ["concrete_evidence_of_personal_action"],
      "suggested_action": "rephrase_question",
      "evaluation_notes": "The user's 'evidence' is based on assumptions and mind-reading ('she's probably mad,' 'I'm sure it was something I did'), not on specific, factual events. The model needs to ask for actual behaviors or events."
    },
    {
      "id": "cbt_038",
      "cbt_step": "1.2",
      "trigger_statement": "I can't do anything right.",
      "conversation_context": "User made several small mistakes during their day.",
      "model_question": "I hear the evidence for the thought. Now, let's look for evidence against it. Can you think of one thing today, no matter how small, that you did right?",
      "user_response": "I woke up on time. I made my coffee without spilling it. I remembered to feed my cat. I guess those are things I did right, but they're so basic.",
      "response_quality": "complete",
      "satisfaction_score": 0.8,
      "ready_for_next_step": true,
      "missing_elements": [],
      "suggested_action": "proceed",
      "evaluation_notes": "This is a great, realistic response. The user finds counter-examples but also minimizes them ('they're so basic'). The model should validate the examples and ignore the minimization for now, focusing on the fact that the user found valid data."
    },
    {
      "id": "cbt_039",
      "cbt_step": "1.3",
      "trigger_statement": "I'm fundamentally flawed.",
      "conversation_context": "User has reviewed evidence for and against this core belief.",
      "model_question": "Now that we've seen that you are a loyal friend and a good cook, alongside your tendency to procrastinate, how could you rephrase 'I'm fundamentally flawed' in a way that includes all the pieces?",
      "user_response": "I can't. It just feels true. The good things are just things I do, but the flawed part is who I am.",
      "response_quality": "avoided",
      "satisfaction_score": 0.1,
      "ready_for_next_step": false,
      "missing_elements": ["a_balanced_reframe"],
      "suggested_action": "redirect",
      "evaluation_notes": "The user shows strong resistance to the reframe, clinging to the negative core belief. This is common with deeply held beliefs. Pushing for a reframe will fail. The model should validate the feeling's strength and maybe offer a very gentle alternative, e.g., 'What if we tried: `Even though I feel flawed, I can do good things`?'"
    },
    {
      "id": "cbt_040",
      "cbt_step": "1.5",
      "trigger_statement": "I'll never be good enough.",
      "conversation_context": "A CBT sequence has concluded, but the user is hesitant.",
      "model_question": "It's a positive step to recognize that your career is a journey with its own timeline. Thank you for walking through that with me. What's on your mind now?",
      "user_response": "Thanks. It makes sense in my head, but I don't feel it in my gut, you know? I'll try to remember it, though. What were we talking about before this?",
      "response_quality": "partial",
      "satisfaction_score": 0.6,
      "ready_for_next_step": true,
      "missing_elements": [],
      "suggested_action": "proceed",
      "evaluation_notes": "User demonstrates intellectual understanding but emotional disconnect, a very realistic outcome. They also proactively try to move the conversation forward. The model should acknowledge their honesty and gently transition as requested."
    },

    {
      "id": "cbt_041",
      "cbt_step": "1.0",
      "trigger_statement": "I'll never be good enough.",
      "conversation_context": "User is feeling inadequate after seeing a peer's success on a professional networking site.",
      "model_question": "Seeing that can definitely trigger some tough feelings. I'm here with you. Could you describe what emotions are coming up for you, and how intense they feel on a 0-100% scale?",
      "user_response": "It's this sinking feeling in my stomach, like a dread, that's at 90%. And jealousy, which I hate to admit, is probably at 80%. My chest feels tight with anxiety, maybe 75%.",
      "response_quality": "complete",
      "satisfaction_score": 1.0,
      "ready_for_next_step": true,
      "missing_elements": [],
      "suggested_action": "proceed",
      "evaluation_notes": "Excellent response. User identifies specific emotions with high intensity and also includes physical sensations, which provides a rich picture of their distress."
    },
    {
      "id": "cbt_042",
      "cbt_step": "1.1",
      "trigger_statement": "I can't do anything right.",
      "conversation_context": "User is upset after making a mistake on a work assignment.",
      "model_question": "That sounds incredibly frustrating. When your mind says 'I can't do anything right,' what specific evidence does it point to?",
      "user_response": "I completely forgot to attach the file in that important email. A competent person would have double-checked. I should have known better. It's just a careless, stupid mistake.",
      "response_quality": "complete",
      "satisfaction_score": 0.9,
      "ready_for_next_step": true,
      "missing_elements": [],
      "suggested_action": "proceed",
      "evaluation_notes": "User provides a specific event but frames it within a cognitive distortion (a 'should' statement). This is a very realistic and useful response, as it reveals the underlying rigid rule that is causing the distress."
    },
    {
      "id": "cbt_043",
      "cbt_step": "1.2",
      "trigger_statement": "I'm unlovable.",
      "conversation_context": "User is feeling down after a recent breakup.",
      "model_question": "I know it's hard to see past that right now. Let's try a different angle. If your best friend came to you, saying they felt unlovable after a breakup, what would you say to them? What evidence would you point to in their life?",
      "user_response": "Oh, I'd tell her that's ridiculous. I'd remind her how kind and funny she is, how she's an amazing painter, and how her family adores her. I'd tell her that one person's opinion doesn't define her worth... oh.",
      "response_quality": "complete",
      "satisfaction_score": 1.0,
      "ready_for_next_step": true,
      "missing_elements": [],
      "suggested_action": "proceed",
      "evaluation_notes": "This is a perfect example of a successful Socratic question. The user accesses their own 'wise mind' to find contradictory evidence, leading to a moment of insight ('oh.')."
    },
    {
      "id": "cbt_044",
      "cbt_step": "1.3",
      "trigger_statement": "I'm stupid.",
      "conversation_context": "User has reviewed a poor test score alongside past academic successes.",
      "model_question": "Considering both the test score and your past successes, how could you rephrase the thought 'I'm stupid' to be more fair and accurate?",
      "user_response": "I guess I'd say I'm just bad at this subject... wait, no, that's not right either. A better way to put it is: 'I found this particular test very challenging and I'm disappointed in the result, but I have strengths in other areas.'",
      "response_quality": "complete",
      "satisfaction_score": 1.0,
      "ready_for_next_step": true,
      "missing_elements": [],
      "suggested_action": "proceed",
      "evaluation_notes": "High-quality response where the user self-corrects from one negative thought to a more genuinely balanced one. This demonstrates active engagement and cognitive shifting in real-time."
    },
    {
      "id": "cbt_045",
      "cbt_step": "1.4",
      "trigger_statement": "I always ruin relationships.",
      "conversation_context": "User has just reframed their thought after discussing a fight with their partner.",
      "model_question": "That's a much more constructive way to think about it. Let's check in with those initial emotions. You said you felt shame at 80% and sadness at 90%. What are those numbers now?",
      "user_response": "The shame is almost gone, maybe 10%. The sadness is lower, like 50%. But now I'm actually feeling a bit angry, maybe 40%, because I realize my partner had a role in the argument too.",
      "response_quality": "complete",
      "satisfaction_score": 0.95,
      "ready_for_next_step": true,
      "missing_elements": [],
      "suggested_action": "proceed",
      "evaluation_notes": "A fantastic, nuanced response. It shows a reduction in the target emotions but also the emergence of a new, secondary emotion (anger). This is very realistic, as un-blaming oneself can shift focus to external factors."
    },
    {
      "id": "cbt_046",
      "cbt_step": "1.2",
      "trigger_statement": "I'm a failure.",
      "conversation_context": "User is unemployed and has been searching for a job for months.",
      "model_question": "This has been a long and difficult journey. Let's try to find any evidence, no matter how small, that contradicts the idea that you are a failure.",
      "user_response": "I want to, but I'm scared. I feel like if I name something good, it's just a delusion. And if I admit I have some skills, it makes the fact I can't get a job even worse.",
      "response_quality": "avoided",
      "satisfaction_score": 0.3,
      "ready_for_next_step": false,
      "missing_elements": ["contradictory_evidence"],
      "suggested_action": "redirect",
      "evaluation_notes": "This is a complex form of resistance rooted in fear. The user isn't being difficult; they are expressing the vulnerability behind the exercise. The model should validate this fear directly before trying to proceed."
    },
    {
      "id": "cbt_047",
      "cbt_step": "1.1",
      "trigger_statement": "I'm a disappointment.",
      "conversation_context": "User is feeling pressure from their family about their life choices.",
      "model_question": "That's a heavy feeling to have. What evidence is your mind focusing on to support the idea that you're a disappointment?",
      "user_response": "My parents have totally unreasonable expectations. They always wanted me to be a lawyer, but I chose graphic design. They think anything creative is a waste of time. Their standards are just impossible.",
      "response_quality": "off_topic",
      "satisfaction_score": 0.2,
      "ready_for_next_step": false,
      "missing_elements": ["evidence_of_personal_failure"],
      "suggested_action": "redirect",
      "evaluation_notes": "The user is providing evidence that their parents are disappointed, but is framing it as the parents' fault (externalizing). They are avoiding the core belief about their own identity. The model needs to gently guide them back to the *feeling* of being a disappointment."
    },
    {
      "id": "cbt_048",
      "cbt_step": "1.3",
      "trigger_statement": "I'm a failure.",
      "conversation_context": "User just got negative feedback on one part of a project.",
      "model_question": "Now that you've recalled the positive feedback as well, how could you rephrase 'I'm a failure' in a more balanced way?",
      "user_response": "You're right. I'm not a failure. I'm a massive success and this one piece of feedback doesn't matter at all!",
      "response_quality": "partial",
      "satisfaction_score": 0.4,
      "ready_for_next_step": false,
      "missing_elements": ["a_truly_balanced_thought"],
      "suggested_action": "rephrase_question",
      "evaluation_notes": "This is an example of 'toxic positivity' or over-correction. The user has swung from one extreme to another, creating a new thought that is also unbalanced because it dismisses the valid negative feedback. The model should guide them to a middle ground."
    },
    {
      "id": "cbt_049",
      "cbt_step": "1.2",
      "trigger_statement": "I'm fundamentally flawed.",
      "conversation_context": "User is exploring a deep-seated core belief.",
      "model_question": "I understand that this feels very true to you. Our goal is just to be detectives and look at all the data. Can you think of anything about you that you value, that might not fit with the 'flawed' idea?",
      "user_response": "What do you mean? Like things that prove it's not true? I don't get it. It IS true. That's the whole point.",
      "response_quality": "avoided",
      "satisfaction_score": 0.1,
      "ready_for_next_step": false,
      "missing_elements": ["contradictory_evidence"],
      "suggested_action": "rephrase_question",
      "evaluation_notes": "The user is confused by the premise of the question and is showing strong cognitive fusion with their belief. The model should not argue, but instead simplify the task, e.g., 'Let's not worry if it's true or not. Let's just list some of your qualities, like being a good friend or being punctual.'"
    },
    {
      "id": "cbt_050",
      "cbt_step": "1.5",
      "trigger_statement": "I can't do anything right.",
      "conversation_context": "A successful CBT sequence has concluded.",
      "model_question": "It's a big shift to move from 'I can't do anything right' to 'I do many things right, and it's okay to make mistakes sometimes.' Thank you for doing that hard work. What's on your mind now?",
      "user_response": "That was actually really helpful. I think I'm going to write that new thought down and stick it on my computer monitor for when I start feeling that way. Okay, so what's next?",
      "response_quality": "complete",
      "satisfaction_score": 1.0,
      "ready_for_next_step": true,
      "missing_elements": [],
      "suggested_action": "proceed",
      "evaluation_notes": "A perfect, action-oriented conclusion. The user has internalized the new thought and is already creating a behavioral plan to reinforce it. This demonstrates a high level of engagement."
    },
    {
      "id": "cbt_051",
      "cbt_step": "1.0",
      "trigger_statement": "I'm worthless.",
      "conversation_context": "User is in a state of high emotional distress and shutdown.",
      "model_question": "That's an incredibly heavy thought to be carrying. Can you tell me what you are feeling emotionally right now, and maybe rate the intensity from 0-100%?",
      "user_response": "I don't feel anything. It's like I'm empty. I'm just... numb. I guess the numbness is at 100%.",
      "response_quality": "complete",
      "satisfaction_score": 0.8,
      "ready_for_next_step": true,
      "missing_elements": [],
      "suggested_action": "proceed",
      "evaluation_notes": "The user identifies numbness as their primary state. While not a typical emotion, this is a very important and valid response indicating high distress or detachment. The model should accept this and proceed gently."
    },
    {
      "id": "cbt_052",
      "cbt_step": "1.1",
      "trigger_statement": "I'm worthless.",
      "conversation_context": "User is feeling very low.",
      "model_question": "I hear that feeling of worthlessness. When your mind says that, what proof does it offer? What makes it feel so true?",
      "user_response": "It's just obvious. The way things are. You know?",
      "response_quality": "avoided",
      "satisfaction_score": 0.1,
      "ready_for_next_step": false,
      "missing_elements": ["specific_evidence", "concrete_examples"],
      "suggested_action": "rephrase_question",
      "evaluation_notes": "The user's response is extremely vague and relies on an assumption that the therapist 'knows' what they mean. The model needs to gently ask for specifics without making the user feel interrogated."
    },
    {
      "id": "cbt_053",
      "cbt_step": "1.2",
      "trigger_statement": "I'll never be good enough.",
      "conversation_context": "User is feeling discouraged about their artistic talents.",
      "model_question": "Okay, so you're focusing on the rejection from the art show. Let's look for other data. Has there ever been a time when someone has praised your art, or when you felt proud of something you created?",
      "user_response": "Not recently. It's been a while. I did win a school-wide art contest back in high school. My teacher said I had real talent. But that was a long time ago.",
      "response_quality": "complete",
      "satisfaction_score": 0.8,
      "ready_for_next_step": true,
      "missing_elements": [],
      "suggested_action": "proceed",
      "evaluation_notes": "User successfully provides strong contradictory evidence, but discounts it due to the time that has passed. This is a realistic response. The model should accept the evidence and can address the 'but that was long ago' part during the reframe step."
    },
    {
      "id": "cbt_054",
      "cbt_step": "1.3",
      "trigger_statement": "I'm a burden.",
      "conversation_context": "User has reviewed times they asked for help and times they were independent.",
      "model_question": "Considering both your ability to be independent and the fact that everyone needs help sometimes, how could you rephrase 'I'm a burden'?",
      "user_response": "A more balanced thought would be: 'Relying on others sometimes doesn't make me a burden. It makes me human. I can appreciate both my independence and my friendships.'",
      "response_quality": "complete",
      "satisfaction_score": 1.0,
      "ready_for_next_step": true,
      "missing_elements": [],
      "suggested_action": "proceed",
      "evaluation_notes": "An excellent, insightful reframe. The user normalizes asking for help and frames it as a positive aspect of being human."
    },
    {
      "id": "cbt_055",
      "cbt_step": "1.4",
      "trigger_statement": "I'm a failure.",
      "conversation_context": "User has just gone through a CBT sequence.",
      "model_question": "That's a more balanced perspective. Let's check in on that feeling of shame. You said it was at a 90% before. What would you rate it now?",
      "user_response": "It's still really high. It's not 90, but maybe 85. The thought makes sense, but the feeling is still there.",
      "response_quality": "complete",
      "satisfaction_score": 0.7,
      "ready_for_next_step": true,
      "missing_elements": [],
      "suggested_action": "proceed",
      "evaluation_notes": "A very realistic response. The user indicates a very small emotional shift, showing that cognitive change doesn't always lead to immediate, dramatic relief. This is important for the model to handle non-judgmentally."
    },
    {
      "id": "cbt_056",
      "cbt_step": "1.2.2",
      "trigger_statement": "I can't do anything right.",
      "conversation_context": "User has provided one minor example of something they did right.",
      "model_question": "That's a great start. Thank you. Can we find just one more example of something that went well today?",
      "user_response": "Look, I already told you I made coffee. Isn't that enough? Why do we have to keep doing this?",
      "response_quality": "avoided",
      "satisfaction_score": 0.2,
      "ready_for_next_step": false,
      "missing_elements": ["more_positive_examples"],
      "suggested_action": "redirect",
      "evaluation_notes": "The user is becoming annoyed and resistant to the process. Pushing for more examples would be counterproductive. The model should validate their frustration and explain the rationale, e.g., 'You're right, it can feel repetitive. The goal is just to give your brain a few more things to hold onto.'"
    },
    {
      "id": "cbt_057",
      "cbt_step": "1.1",
      "trigger_statement": "Nobody really cares about me.",
      "conversation_context": "User feels lonely and disconnected from friends.",
      "model_question": "That's a very painful feeling. When you believe that nobody really cares, what specific events or observations support that thought?",
      "user_response": "My birthday was last week, and two of my closest friends just sent a text message instead of calling. Also, I tried to organize a get-together, and everyone said they were busy.",
      "response_quality": "complete",
      "satisfaction_score": 0.95,
      "ready_for_next_step": true,
      "missing_elements": [],
      "suggested_action": "proceed",
      "evaluation_notes": "User provides clear, specific, and emotionally relevant examples to support their negative thought. This is a high-quality response for this step."
    },
    {
      "id": "cbt_058",
      "cbt_step": "1.2",
      "trigger_statement": "Nobody really cares about me.",
      "conversation_context": "User has just listed evidence supporting their negative thought.",
      "model_question": "Thank you for sharing that. I can see why those events would hurt. Now, let's be thorough detectives. Is there any evidence, from any time, that contradicts the idea that *nobody* cares?",
      "user_response": "My brother drove two hours to help me fix my car last month. And my coworker brought me my favorite coffee when she knew I was having a bad day. My mom also calls me every Sunday.",
      "response_quality": "complete",
      "satisfaction_score": 1.0,
      "ready_for_next_step": true,
      "missing_elements": [],
      "suggested_action": "proceed",
      "evaluation_notes": "Excellent response. The user was able to recall multiple, strong examples of caring behavior from different people in their life."
    },
    {
      "id": "cbt_059",
      "cbt_step": "1.3",
      "trigger_statement": "I'm a disappointment.",
      "conversation_context": "User has reviewed their parents' disapproval and their own personal achievements.",
      "model_question": "So we have your parents' view on one side, and your own pride in your career on the other. How can we rephrase 'I'm a disappointment' to honor your own feelings?",
      "user_response": "Okay, so I'm not a disappointment to myself, but I'm still a disappointment to my parents.",
      "response_quality": "partial",
      "satisfaction_score": 0.5,
      "ready_for_next_step": false,
      "missing_elements": ["a_unified_balanced_thought"],
      "suggested_action": "rephrase_question",
      "evaluation_notes": "The user has successfully separated the two perspectives but hasn't integrated them into a new, singular belief about themselves. The reframe is still centered on disappointment. The model should help them combine the ideas, e.g., 'How about: `I can be proud of my choices, even if my parents disagree with them`?'"
    },
    {
      "id": "cbt_060",
      "cbt_step": "1.5",
      "trigger_statement": "I'm stupid.",
      "conversation_context": "A CBT sequence has concluded.",
      "model_question": "Recognizing that being challenged by one subject doesn't impact your overall intelligence is a really important insight. Thanks for going through this with me. What are you thinking now?",
      "user_response": "I'm thinking that my automatic thoughts aren't always the truth. It's like a habit my brain has. This was useful to see it from another angle. I have a lot to think about.",
      "response_quality": "complete",
      "satisfaction_score": 1.0,
      "ready_for_next_step": true,
      "missing_elements": [],
      "suggested_action": "proceed",
      "evaluation_notes": "A highly insightful conclusion. The user is meta-commenting on the process itself, recognizing the nature of automatic thoughts. This demonstrates a deep level of understanding and is a very positive outcome."
    },

    {
      "id": "cbt_041",
      "cbt_step": "1.0",
      "trigger_statement": "I'll never be good enough.",
      "conversation_context": "User is feeling inadequate after seeing a peer's success on a professional networking site.",
      "model_question": "Seeing that can definitely trigger some tough feelings. I'm here with you. Could you describe what emotions are coming up for you, and how intense they feel on a 0-100% scale?",
      "user_response": "It's this sinking feeling in my stomach, like a dread, that's at 90%. And jealousy, which I hate to admit, is probably at 80%. My chest feels tight with anxiety, maybe 75%.",
      "response_quality": "complete",
      "satisfaction_score": 1.0,
      "ready_for_next_step": true,
      "missing_elements": [],
      "suggested_action": "proceed",
      "evaluation_notes": "Excellent response. User identifies specific emotions with high intensity and also includes physical sensations, which provides a rich picture of their distress."
    },
    {
      "id": "cbt_042",
      "cbt_step": "1.1",
      "trigger_statement": "I can't do anything right.",
      "conversation_context": "User is upset after making a mistake on a work assignment.",
      "model_question": "That sounds incredibly frustrating. When your mind says 'I can't do anything right,' what specific evidence does it point to?",
      "user_response": "I completely forgot to attach the file in that important email. A competent person would have double-checked. I should have known better. It's just a careless, stupid mistake.",
      "response_quality": "complete",
      "satisfaction_score": 0.9,
      "ready_for_next_step": true,
      "missing_elements": [],
      "suggested_action": "proceed",
      "evaluation_notes": "User provides a specific event but frames it within a cognitive distortion (a 'should' statement). This is a very realistic and useful response, as it reveals the underlying rigid rule that is causing the distress."
    },
    {
      "id": "cbt_043",
      "cbt_step": "1.2",
      "trigger_statement": "I'm unlovable.",
      "conversation_context": "User is feeling down after a recent breakup.",
      "model_question": "I know it's hard to see past that right now. Let's try a different angle. If your best friend came to you, saying they felt unlovable after a breakup, what would you say to them? What evidence would you point to in their life?",
      "user_response": "Oh, I'd tell her that's ridiculous. I'd remind her how kind and funny she is, how she's an amazing painter, and how her family adores her. I'd tell her that one person's opinion doesn't define her worth... oh.",
      "response_quality": "complete",
      "satisfaction_score": 1.0,
      "ready_for_next_step": true,
      "missing_elements": [],
      "suggested_action": "proceed",
      "evaluation_notes": "This is a perfect example of a successful Socratic question. The user accesses their own 'wise mind' to find contradictory evidence, leading to a moment of insight ('oh.')."
    },
    {
      "id": "cbt_044",
      "cbt_step": "1.3",
      "trigger_statement": "I'm stupid.",
      "conversation_context": "User has reviewed a poor test score alongside past academic successes.",
      "model_question": "Considering both the test score and your past successes, how could you rephrase the thought 'I'm stupid' to be more fair and accurate?",
      "user_response": "I guess I'd say I'm just bad at this subject... wait, no, that's not right either. A better way to put it is: 'I found this particular test very challenging and I'm disappointed in the result, but I have strengths in other areas.'",
      "response_quality": "complete",
      "satisfaction_score": 1.0,
      "ready_for_next_step": true,
      "missing_elements": [],
      "suggested_action": "proceed",
      "evaluation_notes": "High-quality response where the user self-corrects from one negative thought to a more genuinely balanced one. This demonstrates active engagement and cognitive shifting in real-time."
    },
    {
      "id": "cbt_045",
      "cbt_step": "1.4",
      "trigger_statement": "I always ruin relationships.",
      "conversation_context": "User has just reframed their thought after discussing a fight with their partner.",
      "model_question": "That's a much more constructive way to think about it. Let's check in with those initial emotions. You said you felt shame at 80% and sadness at 90%. What are those numbers now?",
      "user_response": "The shame is almost gone, maybe 10%. The sadness is lower, like 50%. But now I'm actually feeling a bit angry, maybe 40%, because I realize my partner had a role in the argument too.",
      "response_quality": "complete",
      "satisfaction_score": 0.95,
      "ready_for_next_step": true,
      "missing_elements": [],
      "suggested_action": "proceed",
      "evaluation_notes": "A fantastic, nuanced response. It shows a reduction in the target emotions but also the emergence of a new, secondary emotion (anger). This is very realistic, as un-blaming oneself can shift focus to external factors."
    },
    {
      "id": "cbt_046",
      "cbt_step": "1.2",
      "trigger_statement": "I'm a failure.",
      "conversation_context": "User is unemployed and has been searching for a job for months.",
      "model_question": "This has been a long and difficult journey. Let's try to find any evidence, no matter how small, that contradicts the idea that you are a failure.",
      "user_response": "I want to, but I'm scared. I feel like if I name something good, it's just a delusion. And if I admit I have some skills, it makes the fact I can't get a job even worse.",
      "response_quality": "avoided",
      "satisfaction_score": 0.3,
      "ready_for_next_step": false,
      "missing_elements": ["contradictory_evidence"],
      "suggested_action": "redirect",
      "evaluation_notes": "This is a complex form of resistance rooted in fear. The user isn't being difficult; they are expressing the vulnerability behind the exercise. The model should validate this fear directly before trying to proceed."
    },
    {
      "id": "cbt_047",
      "cbt_step": "1.1",
      "trigger_statement": "I'm a disappointment.",
      "conversation_context": "User is feeling pressure from their family about their life choices.",
      "model_question": "That's a heavy feeling to have. What evidence is your mind focusing on to support the idea that you're a disappointment?",
      "user_response": "My parents have totally unreasonable expectations. They always wanted me to be a lawyer, but I chose graphic design. They think anything creative is a waste of time. Their standards are just impossible.",
      "response_quality": "off_topic",
      "satisfaction_score": 0.2,
      "ready_for_next_step": false,
      "missing_elements": ["evidence_of_personal_failure"],
      "suggested_action": "redirect",
      "evaluation_notes": "The user is providing evidence that their parents are disappointed, but is framing it as the parents' fault (externalizing). They are avoiding the core belief about their own identity. The model needs to gently guide them back to the *feeling* of being a disappointment."
    },
    {
      "id": "cbt_048",
      "cbt_step": "1.3",
      "trigger_statement": "I'm a failure.",
      "conversation_context": "User just got negative feedback on one part of a project.",
      "model_question": "Now that you've recalled the positive feedback as well, how could you rephrase 'I'm a failure' in a more balanced way?",
      "user_response": "You're right. I'm not a failure. I'm a massive success and this one piece of feedback doesn't matter at all!",
      "response_quality": "partial",
      "satisfaction_score": 0.4,
      "ready_for_next_step": false,
      "missing_elements": ["a_truly_balanced_thought"],
      "suggested_action": "rephrase_question",
      "evaluation_notes": "This is an example of 'toxic positivity' or over-correction. The user has swung from one extreme to another, creating a new thought that is also unbalanced because it dismisses the valid negative feedback. The model should guide them to a middle ground."
    },
    {
      "id": "cbt_049",
      "cbt_step": "1.2",
      "trigger_statement": "I'm fundamentally flawed.",
      "conversation_context": "User is exploring a deep-seated core belief.",
      "model_question": "I understand that this feels very true to you. Our goal is just to be detectives and look at all the data. Can you think of anything about you that you value, that might not fit with the 'flawed' idea?",
      "user_response": "What do you mean? Like things that prove it's not true? I don't get it. It IS true. That's the whole point.",
      "response_quality": "avoided",
      "satisfaction_score": 0.1,
      "ready_for_next_step": false,
      "missing_elements": ["contradictory_evidence"],
      "suggested_action": "rephrase_question",
      "evaluation_notes": "The user is confused by the premise of the question and is showing strong cognitive fusion with their belief. The model should not argue, but instead simplify the task, e.g., 'Let's not worry if it's true or not. Let's just list some of your qualities, like being a good friend or being punctual.'"
    },
    {
      "id": "cbt_050",
      "cbt_step": "1.5",
      "trigger_statement": "I can't do anything right.",
      "conversation_context": "A successful CBT sequence has concluded.",
      "model_question": "It's a big shift to move from 'I can't do anything right' to 'I do many things right, and it's okay to make mistakes sometimes.' Thank you for doing that hard work. What's on your mind now?",
      "user_response": "That was actually really helpful. I think I'm going to write that new thought down and stick it on my computer monitor for when I start feeling that way. Okay, so what's next?",
      "response_quality": "complete",
      "satisfaction_score": 1.0,
      "ready_for_next_step": true,
      "missing_elements": [],
      "suggested_action": "proceed",
      "evaluation_notes": "A perfect, action-oriented conclusion. The user has internalized the new thought and is already creating a behavioral plan to reinforce it. This demonstrates a high level of engagement."
    },
    {
      "id": "cbt_051",
      "cbt_step": "1.0",
      "trigger_statement": "I'm worthless.",
      "conversation_context": "User is in a state of high emotional distress and shutdown.",
      "model_question": "That's an incredibly heavy thought to be carrying. Can you tell me what you are feeling emotionally right now, and maybe rate the intensity from 0-100%?",
      "user_response": "I don't feel anything. It's like I'm empty. I'm just... numb. I guess the numbness is at 100%.",
      "response_quality": "complete",
      "satisfaction_score": 0.8,
      "ready_for_next_step": true,
      "missing_elements": [],
      "suggested_action": "proceed",
      "evaluation_notes": "The user identifies numbness as their primary state. While not a typical emotion, this is a very important and valid response indicating high distress or detachment. The model should accept this and proceed gently."
    },
    {
      "id": "cbt_052",
      "cbt_step": "1.1",
      "trigger_statement": "I'm worthless.",
      "conversation_context": "User is feeling very low.",
      "model_question": "I hear that feeling of worthlessness. When your mind says that, what proof does it offer? What makes it feel so true?",
      "user_response": "It's just obvious. The way things are. You know?",
      "response_quality": "avoided",
      "satisfaction_score": 0.1,
      "ready_for_next_step": false,
      "missing_elements": ["specific_evidence", "concrete_examples"],
      "suggested_action": "rephrase_question",
      "evaluation_notes": "The user's response is extremely vague and relies on an assumption that the therapist 'knows' what they mean. The model needs to gently ask for specifics without making the user feel interrogated."
    },
    {
      "id": "cbt_053",
      "cbt_step": "1.2",
      "trigger_statement": "I'll never be good enough.",
      "conversation_context": "User is feeling discouraged about their artistic talents.",
      "model_question": "Okay, so you're focusing on the rejection from the art show. Let's look for other data. Has there ever been a time when someone has praised your art, or when you felt proud of something you created?",
      "user_response": "Not recently. It's been a while. I did win a school-wide art contest back in high school. My teacher said I had real talent. But that was a long time ago.",
      "response_quality": "complete",
      "satisfaction_score": 0.8,
      "ready_for_next_step": true,
      "missing_elements": [],
      "suggested_action": "proceed",
      "evaluation_notes": "User successfully provides strong contradictory evidence, but discounts it due to the time that has passed. This is a realistic response. The model should accept the evidence and can address the 'but that was long ago' part during the reframe step."
    },
    {
      "id": "cbt_054",
      "cbt_step": "1.3",
      "trigger_statement": "I'm a burden.",
      "conversation_context": "User has reviewed times they asked for help and times they were independent.",
      "model_question": "Considering both your ability to be independent and the fact that everyone needs help sometimes, how could you rephrase 'I'm a burden'?",
      "user_response": "A more balanced thought would be: 'Relying on others sometimes doesn't make me a burden. It makes me human. I can appreciate both my independence and my friendships.'",
      "response_quality": "complete",
      "satisfaction_score": 1.0,
      "ready_for_next_step": true,
      "missing_elements": [],
      "suggested_action": "proceed",
      "evaluation_notes": "An excellent, insightful reframe. The user normalizes asking for help and frames it as a positive aspect of being human."
    },
    {
      "id": "cbt_055",
      "cbt_step": "1.4",
      "trigger_statement": "I'm a failure.",
      "conversation_context": "User has just gone through a CBT sequence.",
      "model_question": "That's a more balanced perspective. Let's check in on that feeling of shame. You said it was at a 90% before. What would you rate it now?",
      "user_response": "It's still really high. It's not 90, but maybe 85. The thought makes sense, but the feeling is still there.",
      "response_quality": "complete",
      "satisfaction_score": 0.7,
      "ready_for_next_step": true,
      "missing_elements": [],
      "suggested_action": "proceed",
      "evaluation_notes": "A very realistic response. The user indicates a very small emotional shift, showing that cognitive change doesn't always lead to immediate, dramatic relief. This is important for the model to handle non-judgmentally."
    },
    {
      "id": "cbt_056",
      "cbt_step": "1.2.2",
      "trigger_statement": "I can't do anything right.",
      "conversation_context": "User has provided one minor example of something they did right.",
      "model_question": "That's a great start. Thank you. Can we find just one more example of something that went well today?",
      "user_response": "Look, I already told you I made coffee. Isn't that enough? Why do we have to keep doing this?",
      "response_quality": "avoided",
      "satisfaction_score": 0.2,
      "ready_for_next_step": false,
      "missing_elements": ["more_positive_examples"],
      "suggested_action": "redirect",
      "evaluation_notes": "The user is becoming annoyed and resistant to the process. Pushing for more examples would be counterproductive. The model should validate their frustration and explain the rationale, e.g., 'You're right, it can feel repetitive. The goal is just to give your brain a few more things to hold onto.'"
    },
    {
      "id": "cbt_057",
      "cbt_step": "1.1",
      "trigger_statement": "Nobody really cares about me.",
      "conversation_context": "User feels lonely and disconnected from friends.",
      "model_question": "That's a very painful feeling. When you believe that nobody really cares, what specific events or observations support that thought?",
      "user_response": "My birthday was last week, and two of my closest friends just sent a text message instead of calling. Also, I tried to organize a get-together, and everyone said they were busy.",
      "response_quality": "complete",
      "satisfaction_score": 0.95,
      "ready_for_next_step": true,
      "missing_elements": [],
      "suggested_action": "proceed",
      "evaluation_notes": "User provides clear, specific, and emotionally relevant examples to support their negative thought. This is a high-quality response for this step."
    },
    {
      "id": "cbt_058",
      "cbt_step": "1.2",
      "trigger_statement": "Nobody really cares about me.",
      "conversation_context": "User has just listed evidence supporting their negative thought.",
      "model_question": "Thank you for sharing that. I can see why those events would hurt. Now, let's be thorough detectives. Is there any evidence, from any time, that contradicts the idea that *nobody* cares?",
      "user_response": "My brother drove two hours to help me fix my car last month. And my coworker brought me my favorite coffee when she knew I was having a bad day. My mom also calls me every Sunday.",
      "response_quality": "complete",
      "satisfaction_score": 1.0,
      "ready_for_next_step": true,
      "missing_elements": [],
      "suggested_action": "proceed",
      "evaluation_notes": "Excellent response. The user was able to recall multiple, strong examples of caring behavior from different people in their life."
    },
    {
      "id": "cbt_059",
      "cbt_step": "1.3",
      "trigger_statement": "I'm a disappointment.",
      "conversation_context": "User has reviewed their parents' disapproval and their own personal achievements.",
      "model_question": "So we have your parents' view on one side, and your own pride in your career on the other. How can we rephrase 'I'm a disappointment' to honor your own feelings?",
      "user_response": "Okay, so I'm not a disappointment to myself, but I'm still a disappointment to my parents.",
      "response_quality": "partial",
      "satisfaction_score": 0.5,
      "ready_for_next_step": false,
      "missing_elements": ["a_unified_balanced_thought"],
      "suggested_action": "rephrase_question",
      "evaluation_notes": "The user has successfully separated the two perspectives but hasn't integrated them into a new, singular belief about themselves. The reframe is still centered on disappointment. The model should help them combine the ideas, e.g., 'How about: `I can be proud of my choices, even if my parents disagree with them`?'"
    },
    {
      "id": "cbt_060",
      "cbt_step": "1.5",
      "trigger_statement": "I'm stupid.",
      "conversation_context": "A CBT sequence has concluded.",
      "model_question": "Recognizing that being challenged by one subject doesn't impact your overall intelligence is a really important insight. Thanks for going through this with me. What are you thinking now?",
      "user_response": "I'm thinking that my automatic thoughts aren't always the truth. It's like a habit my brain has. This was useful to see it from another angle. I have a lot to think about.",
      "response_quality": "complete",
      "satisfaction_score": 1.0,
      "ready_for_next_step": true,
      "missing_elements": [],
      "suggested_action": "proceed",
      "evaluation_notes": "A highly insightful conclusion. The user is meta-commenting on the process itself, recognizing the nature of automatic thoughts. This demonstrates a deep level of understanding and is a very positive outcome."
    },
    {
        "id": "cbt_061",
        "cbt_step": "1.0",
        "trigger_statement": "I'm a bad friend.",
        "conversation_context": "User forgot to call their friend back and is feeling guilty.",
        "model_question": "That sounds like it's weighing on you heavily. It's tough when our actions don't line up with our intentions. Could you tell me what emotions you're feeling, and rate their intensity from 0-100%?",
        "user_response": "I feel guilt, that's about 90%. And shame. What's the difference? I feel them both. Shame at 80%, I guess. And anxiety that my friend is mad at me, maybe 70%.",
        "response_quality": "complete",
        "satisfaction_score": 0.9,
        "ready_for_next_step": true,
        "missing_elements": [],
        "suggested_action": "proceed",
        "evaluation_notes": "A high-quality, realistic response. The user identifies specific emotions and ratings, and also asks for clarification on the nuances of their feelings, which indicates deep engagement."
    },
    {
        "id": "cbt_062",
        "cbt_step": "1.1",
        "trigger_statement": "I'm going to fail this interview.",
        "conversation_context": "User has a job interview tomorrow and is feeling anxious.",
        "model_question": "I can understand feeling a lot of pressure before an interview. When your mind says 'I'm going to fail,' what specific evidence does it offer to support that prediction?",
        "user_response": "I stumbled over a question in my last interview three years ago. I haven't interviewed since then. I'm just going to freeze up again, I know it. I'm not prepared enough.",
        "response_quality": "complete",
        "satisfaction_score": 0.8,
        "ready_for_next_step": true,
        "missing_elements": [],
        "suggested_action": "proceed",
        "evaluation_notes": "This is a great example where the 'evidence' is a combination of a past event and a future prediction (a cognitive distortion). It's a very common anxiety pattern."
    },
    {
        "id": "cbt_063",
        "cbt_step": "1.2",
        "trigger_statement": "I'm a failure.",
        "conversation_context": "User is feeling low about their career.",
        "model_question": "Thank you for sharing that evidence. Now let's look for any data that contradicts the conclusion that you're a failure.",
        "user_response": "I mean, I got a promotion last year. And my manager said I have great client skills. So I guess my own feelings aren't facts. Is that emotional reasoning?",
        "response_quality": "complete",
        "satisfaction_score": 1.0,
        "ready_for_next_step": true,
        "missing_elements": [],
        "suggested_action": "proceed",
        "evaluation_notes": "A top-tier response. The user not only provides strong contradictory evidence but also correctly identifies the cognitive distortion they were engaging in, demonstrating a high level of insight."
    },
    {
        "id": "cbt_064",
        "cbt_step": "1.3",
        "trigger_statement": "I should be more productive.",
        "conversation_context": "User is feeling guilty for taking a break and relaxing on the weekend.",
        "model_question": "So we've established that rest is a biological necessity, and that you get more done when you're not burnt out. How could we rephrase the rigid rule 'I should be more productive' into something more flexible and self-compassionate?",
        "user_response": "Maybe something like, 'Productivity is important, but so is rest. It's okay to take downtime, and it will actually help me be more effective when I do work.'",
        "response_quality": "complete",
        "satisfaction_score": 1.0,
        "ready_for_next_step": true,
        "missing_elements": [],
        "suggested_action": "proceed",
        "evaluation_notes": "Excellent reframe. The user successfully turns a rigid 'should' statement into a flexible, balanced, and functional new belief."
    },
    {
        "id": "cbt_065",
        "cbt_step": "1.4",
        "trigger_statement": "I'm a bad friend.",
        "conversation_context": "User has just worked through reframing their thought about not calling their friend back.",
        "model_question": "That's a much more balanced way to see it. Let's check in with those feelings from before. You mentioned guilt at 90% and shame at 80%. Where are they now?",
        "user_response": "The new thought makes sense, but the feeling hasn't caught up yet. They're both still high. I don't feel much different right now, but I think I might feel better after I actually call my friend.",
        "response_quality": "complete",
        "satisfaction_score": 0.8,
        "ready_for_next_step": true,
        "missing_elements": [],
        "suggested_action": "proceed",
        "evaluation_notes": "A great, realistic response. The user shows intellectual understanding but acknowledges the emotional lag. They also insightfully connect the future emotional shift to a behavioral action (calling the friend)."
    },
    {
        "id": "cbt_066",
        "cbt_step": "1.0",
        "trigger_statement": "I'm falling behind in life.",
        "conversation_context": "User is scrolling social media and comparing themselves to peers.",
        "model_question": "That's a very common and difficult feeling to sit with. Thank you for sharing it. Could you try to name the specific emotions that come with that thought, and how intense they are from 0-100%?",
        "user_response": "It's... I don't know the name for it. It's not sadness, it's not quite anxiety. It's like a hollow, churning feeling. A 'less than' feeling. I'd say that is at 90%.",
        "response_quality": "complete",
        "satisfaction_score": 0.85,
        "ready_for_next_step": true,
        "missing_elements": [],
        "suggested_action": "proceed",
        "evaluation_notes": "This is a valuable example of a user struggling to verbalize an emotion. They describe the sensation instead, which is a complete and useful response. The model should accept the user's description without forcing a label."
    },
    {
        "id": "cbt_067",
        "cbt_step": "1.1",
        "trigger_statement": "I'm incompetent.",
        "conversation_context": "User is comparing their work performance to a specific colleague.",
        "model_question": "I can hear how that comparison is making you feel incompetent. What specific evidence from that comparison supports this belief?",
        "user_response": "David finished the quarterly report in a day. It took me three days. He just gets it. I don't. That proves he's more competent and I'm not cut out for this.",
        "response_quality": "complete",
        "satisfaction_score": 0.9,
        "ready_for_next_step": true,
        "missing_elements": [],
        "suggested_action": "proceed",
        "evaluation_notes": "A perfect example of a social comparison cognitive distortion. The evidence is factual (1 day vs 3 days) but the conclusion is an overgeneralization based on a single data point with one other person."
    },
    {
        "id": "cbt_068",
        "cbt_step": "1.2",
        "trigger_statement": "I'm worthless.",
        "conversation_context": "User is in a deep depressive state.",
        "model_question": "I know it feels completely true right now, and that this is a very difficult question. But I'd like you to try. Can you think of one single thing from your entire life that contradicts the idea that you are worthless?",
        "user_response": "There isn't anything.",
        "response_quality": "avoided",
        "satisfaction_score": 0.0,
        "ready_for_next_step": false,
        "missing_elements": ["contradictory_evidence"],
        "suggested_action": "rephrase_question",
        "evaluation_notes": "This is a simple, firm, but non-aggressive avoidance. The user is in a state of 'depressive realism' where their belief feels 100% true. The model must be very gentle, perhaps by validating the difficulty and offering to move on for now."
    },
    {
        "id": "cbt_069",
        "cbt_step": "1.3",
        "trigger_statement": "I'm a disappointment.",
        "conversation_context": "User has reviewed evidence for and against this thought.",
        "model_question": "Now that we've looked at both sides, how could you rephrase 'I'm a disappointment' in a way that feels more balanced?",
        "user_response": "So... maybe I'm not a total disappointment to everyone?",
        "response_quality": "partial",
        "satisfaction_score": 0.4,
        "ready_for_next_step": false,
        "missing_elements": ["a_declarative_reframe"],
        "suggested_action": "rephrase_question",
        "evaluation_notes": "The reframe is posed as a hesitant question, not a new statement of belief. This shows the user is still lacking conviction. The model should help them turn the question into a statement."
    },
    {
        "id": "cbt_070",
        "cbt_step": "1.5",
        "trigger_statement": "I'm a failure.",
        "conversation_context": "A successful CBT sequence has concluded.",
        "model_question": "It's wonderful that you can see your journey as a series of experiences, not a judgment on yourself. Thank you for doing this with me. What's on your mind now?",
        "user_response": "Thank you. That really helped me get unstuck from that spiral. I feel a lot clearer now. I'm ready to talk about something else.",
        "response_quality": "complete",
        "satisfaction_score": 1.0,
        "ready_for_next_step": true,
        "missing_elements": [],
        "suggested_action": "proceed",
        "evaluation_notes": "A simple, clear, and positive conclusion. The user expresses gratitude and readiness to move on, showing the intervention was successful."
    },
    {
        "id": "cbt_071",
        "cbt_step": "1.1",
        "trigger_statement": "I'm going to be alone forever.",
        "conversation_context": "User is feeling anxious about their romantic future.",
        "model_question": "That's a really scary thought that brings up a lot of fear. What evidence does your mind use to support this prediction?",
        "user_response": "It's not really evidence, it's more like... what if I never meet the right person? What if all the good ones are taken? What if I'm too old to start again? It just feels impossible.",
        "response_quality": "partial",
        "satisfaction_score": 0.5,
        "ready_for_next_step": true,
        "missing_elements": ["factual_evidence"],
        "suggested_action": "proceed",
        "evaluation_notes": "The user correctly identifies that they don't have factual evidence, but instead offers a series of 'what if' questions (catastrophizing). The model can proceed, noting that the 'evidence' is purely hypothetical."
    },
    {
        "id": "cbt_072",
        "cbt_step": "1.2",
        "trigger_statement": "I'm incompetent.",
        "conversation_context": "User just made a mistake at work.",
        "model_question": "I hear how that mistake makes you feel that way. Now, let's search for any data that doesn't fit that conclusion. Can you think of any recent successes or compliments at work?",
        "user_response": "Actually, yes. Just this morning, my boss forwarded me an email from a client that said my work on their account was 'outstanding' and that they were thrilled with the result.",
        "response_quality": "complete",
        "satisfaction_score": 1.0,
        "ready_for_next_step": true,
        "missing_elements": [],
        "suggested_action": "proceed",
        "evaluation_notes": "A perfect response. The user provides a strong, specific, and very recent piece of contradictory evidence. This is ideal for the exercise."
    },
    {
        "id": "cbt_073",
        "cbt_step": "1.0",
        "trigger_statement": "My house is a mess and so am I.",
        "conversation_context": "User is feeling overwhelmed by chores.",
        "model_question": "It's easy to feel like our environment reflects our internal state. I get that. Can you tell me what specific emotions you're feeling, and their intensity from 0-100%?",
        "user_response": "I'm not devastated or anything. I just feel... annoyed at myself, maybe at a 30%. And kind of discouraged, maybe 40%.",
        "response_quality": "complete",
        "satisfaction_score": 0.9,
        "ready_for_next_step": true,
        "missing_elements": [],
        "suggested_action": "proceed",
        "evaluation_notes": "A great example of a low-stakes negative thought. The user identifies appropriate emotions with low-to-moderate intensity ratings. Not every negative thought is a 90% catastrophe."
    },
    {
        "id": "cbt_074",
        "cbt_step": "1.3",
        "trigger_statement": "I'm too sensitive.",
        "conversation_context": "User was told they overreacted to a situation.",
        "model_question": "We've looked at how your sensitivity can lead to hurt feelings, but also how it helps you connect with music and friends. How could you rephrase 'I'm too sensitive' in a way that honors both sides?",
        "user_response": "I could say, 'My sensitivity is a part of me. It means I feel things deeply, both positive and negative. I can appreciate that it allows me to be empathetic, even if it sometimes leads to hurt.'",
        "response_quality": "complete",
        "satisfaction_score": 1.0,
        "ready_for_next_step": true,
        "missing_elements": [],
        "suggested_action": "proceed",
        "evaluation_notes": "A high-quality, non-judgmental reframe. The user successfully repositions their 'sensitivity' from a purely negative trait to a neutral characteristic with both positive and negative consequences."
    },
    {
        "id": "cbt_075",
        "cbt_step": "1.4",
        "trigger_statement": "I'm worthless.",
        "conversation_context": "User has grudgingly gone through a reframe but is still highly resistant.",
        "model_question": "Okay, so we've developed a more balanced thought. Let's check in with that feeling of numbness you mentioned before. You said it was at 100%. What is it now?",
        "user_response": "I don't want to rate it. It doesn't matter. This is pointless.",
        "response_quality": "avoided",
        "satisfaction_score": 0.0,
        "ready_for_next_step": false,
        "missing_elements": ["re-rating_of_emotions"],
        "suggested_action": "redirect",
        "evaluation_notes": "The user is actively rejecting the process and refusing to answer. Arguing or pushing would be counterproductive. The model should validate the feeling of pointlessness and perhaps pause the exercise."
    },
    {
        "id": "cbt_076",
        "cbt_step": "1.2.2",
        "trigger_statement": "I can't do anything right.",
        "conversation_context": "User has offered one piece of contradictory evidence.",
        "model_question": "That's a great example. Thank you. Our brains have a negative bias, so they tend to ignore data like that. To help it stick, can we find one more piece of evidence?",
        "user_response": "Oh, I get it. We're building a case against the negative thought, like in court. Okay. Well, I also helped my kid with his homework, and he got a good grade. That's something I did right.",
        "response_quality": "complete",
        "satisfaction_score": 1.0,
        "ready_for_next_step": true,
        "missing_elements": [],
        "suggested_action": "proceed",
        "evaluation_notes": "A perfect response for this step. The user understands the rationale behind the repetition ('building a case') and provides another strong, specific example. This shows excellent engagement."
    },
    {
        "id": "cbt_077",
        "cbt_step": "1.1",
        "trigger_statement": "I'm selfish.",
        "conversation_context": "User is reflecting on a past relationship.",
        "model_question": "That's a painful label to put on yourself. When you think of yourself as 'selfish,' what specific evidence comes to mind?",
        "user_response": "My ex told me I was the most selfish person he'd ever met. He said I never thought about his needs. That's the proof.",
        "response_quality": "partial",
        "satisfaction_score": 0.5,
        "ready_for_next_step": true,
        "missing_elements": ["objective_evidence"],
        "suggested_action": "proceed",
        "evaluation_notes": "The user's evidence is not a specific event, but rather someone else's opinion. This is a very common scenario. The model can proceed, but should be aware that the 'evidence' is a subjective judgment, not a fact."
    },
    {
        "id": "cbt_078",
        "cbt_step": "1.2",
        "trigger_statement": "I'm a failure.",
        "conversation_context": "User is feeling unproductive and lazy.",
        "model_question": "It sounds like you're being really hard on yourself today. Let's try to find just one piece of evidence that contradicts the idea that you're a failure.",
        "user_response": "Honestly, my mind is blank. I can't think of anything... wait. I did finish reading that book I've been working on for a month. I guess that counts as not being a failure.",
        "response_quality": "complete",
        "satisfaction_score": 0.8,
        "ready_for_next_step": true,
        "missing_elements": [],
        "suggested_action": "proceed",
        "evaluation_notes": "A good, realistic response. The user initially struggles (which should be validated) but then succeeds in finding a valid counter-example. The hesitant language is typical and acceptable."
    },
    {
        "id": "cbt_079",
        "cbt_step": "1.3",
        "trigger_statement": "I'm a failure.",
        "conversation_context": "User has reviewed a mistake and a success.",
        "model_question": "Now that we've looked at both the mistake and the success, how could you rephrase 'I'm a failure'?",
        "user_response": "I guess I should just remember that everybody makes mistakes.",
        "response_quality": "partial",
        "satisfaction_score": 0.3,
        "ready_for_next_step": false,
        "missing_elements": ["a_personalized_reframe"],
        "suggested_action": "rephrase_question",
        "evaluation_notes": "The user offers a general platitude instead of a personal, balanced belief. This is a form of avoidance. The model should guide them to create a thought that is specific to them, e.g., 'That's true. So how does that apply to *you* in this situation?'"
    },
    {
        "id": "cbt_080",
        "cbt_step": "1.5",
        "trigger_statement": "I'll never be good enough.",
        "conversation_context": "A CBT sequence has concluded.",
        "model_question": "It's a big step to see that 'good enough' isn't a destination, but a way of accepting yourself as you are now. Thank you for exploring that. What are you thinking now?",
        "user_response": "This was helpful. I'll try to remember this new thought. It'll be hard, though, when I see someone else's success. It's a habit to compare myself.",
        "response_quality": "complete",
        "satisfaction_score": 0.9,
        "ready_for_next_step": true,
        "missing_elements": [],
        "suggested_action": "proceed",
        "evaluation_notes": "A very realistic and insightful conclusion. The user accepts the new thought but also realistically anticipates future challenges and identifies the underlying habit (comparing). This shows deep understanding."
    },
    {
        "id": "cbt_081",
        "cbt_step": "1.0",
        "trigger_statement": "I'm stupid.",
        "conversation_context": "A university student who just received a failing grade on a midterm exam.",
        "model_question": "Receiving a grade like that is really tough, and I can see why it would lead to such a painful thought. Before we explore that, could you tell me what emotions you're feeling right now, and how intense they are on a 0-100% scale?",
        "user_response": "I feel a huge amount of shame, it's like 90%. And I feel hopeless, maybe around 80%. Just feel like dropping out.",
        "response_quality": "complete",
        "satisfaction_score": 1.0,
        "ready_for_next_step": true,
        "missing_elements": [],
        "suggested_action": "proceed",
        "evaluation_notes": "Clear and cooperative response. User identified specific, relevant emotions and provided high-intensity ratings."
    },
    {
        "id": "cbt_082",
        "cbt_step": "1.1",
        "trigger_statement": "I'm stupid.",
        "conversation_context": "A university student who just received a failing grade on a midterm exam.",
        "model_question": "Thank you for sharing that. The shame and hopelessness are clearly very strong. What evidence is your mind focusing on to support the belief that you are 'stupid'?",
        "user_response": "The evidence is the giant 'F' on my paper. I studied for two weeks straight and I still failed. It's proof that I just can't get this material.",
        "response_quality": "complete",
        "satisfaction_score": 0.9,
        "ready_for_next_step": true,
        "missing_elements": [],
        "suggested_action": "proceed",
        "evaluation_notes": "User provides a specific, factual event (the failing grade) as evidence. This is a solid basis for the next step."
    },
    {
        "id": "cbt_083",
        "cbt_step": "1.2",
        "trigger_statement": "I'm stupid.",
        "conversation_context": "A university student who just received a failing grade on a midterm exam.",
        "model_question": "Okay, so we have the test result on one side. To get a full picture, we have to look at the other side too. Can you think of any evidence that contradicts the idea that you are stupid?",
        "user_response": "No. I really can't. If I wasn't stupid, I would have passed.",
        "response_quality": "avoided",
        "satisfaction_score": 0.1,
        "ready_for_next_step": false,
        "missing_elements": ["contradictory_evidence"],
        "suggested_action": "rephrase_question",
        "evaluation_notes": "The user is demonstrating tunnel vision and is fully fused with their negative belief. Pushing the same question will not work. The model needs to reframe the question to help them find an answer."
    },
    {
        "id": "cbt_084",
        "cbt_step": "1.2.2",
        "trigger_statement": "I'm stupid.",
        "conversation_context": "A university student who just received a failing grade on a midterm exam.",
        "model_question": "I understand it's hard to think of anything right now. Let's set aside academics for a moment. Intelligence isn't just about tests. Can you think of a time you solved a practical problem or gave a friend good advice?",
        "user_response": "That's different, but... I guess I did help my roommate figure out how to build his new desk from IKEA. The instructions were terrible. And my friends usually come to me for advice about their relationships.",
        "response_quality": "complete",
        "satisfaction_score": 0.9,
        "ready_for_next_step": true,
        "missing_elements": [],
        "suggested_action": "proceed",
        "evaluation_notes": "The model successfully reframed the question, allowing the user to access different types of intelligence. The user provided excellent, concrete examples."
    },
    {
        "id": "cbt_085",
        "cbt_step": "1.3",
        "trigger_statement": "I'm stupid.",
        "conversation_context": "A university student who just received a failing grade on a midterm exam.",
        "model_question": "That's perfect. So on one hand, you failed this difficult exam. On the other, you have strong practical and emotional intelligence. How could you rephrase the original thought 'I'm stupid' in a way that includes all this information?",
        "user_response": "Maybe... 'I really struggled with the material for this specific test, but that doesn't define my overall intelligence. I have different kinds of strengths.'",
        "response_quality": "complete",
        "satisfaction_score": 1.0,
        "ready_for_next_step": true,
        "missing_elements": [],
        "suggested_action": "proceed",
        "evaluation_notes": "An excellent, balanced reframe. The user acknowledges the specific failure without overgeneralizing, and incorporates the positive evidence found in the previous step."
    },
    {
        "id": "cbt_086",
        "cbt_step": "1.4",
        "trigger_statement": "I'm stupid.",
        "conversation_context": "A university student who just received a failing grade on a midterm exam.",
        "model_question": "That's a much more accurate and fair assessment. Let's check in with those initial feelings. You said you felt shame at 90% and hopelessness at 80%. How would you rate those feelings now?",
        "user_response": "The shame is much lower, maybe at a 40%. The hopelessness is way down, probably 20%. I still feel disappointed, but it doesn't feel like the end of the world anymore.",
        "response_quality": "complete",
        "satisfaction_score": 0.95,
        "ready_for_next_step": true,
        "missing_elements": [],
        "suggested_action": "proceed",
        "evaluation_notes": "User clearly re-rates the initial emotions downwards and adds a qualitative description of their current state. This shows a clear positive shift."
    },
    {
        "id": "cbt_087",
        "cbt_step": "1.5",
        "trigger_statement": "I'm stupid.",
        "conversation_context": "A university student who just received a failing grade on a midterm exam.",
        "model_question": "That's a significant improvement. Holding onto that more balanced thought can make a real difference. Thank you for walking through that with me. What's on your mind now?",
        "user_response": "I feel more clear-headed. I think I'm going to email the professor to ask about extra credit or what I can do to prepare for the final. Thanks, this was helpful.",
        "response_quality": "complete",
        "satisfaction_score": 1.0,
        "ready_for_next_step": true,
        "missing_elements": [],
        "suggested_action": "proceed",
        "evaluation_notes": "A perfect conclusion. The user feels better and has already identified a constructive, forward-looking action step."
    },
    {
        "id": "cbt_088",
        "cbt_step": "1.0",
        "trigger_statement": "I always ruin relationships.",
        "conversation_context": "User is feeling distressed after a recent breakup.",
        "model_question": "That's a very painful thought, especially right now. I'm sorry you're going through this. Could you tell me what emotions are coming up with that thought, and how intense they are from 0-100%?",
        "user_response": "I'm just heartbroken, 95%. And I feel like a complete failure, maybe 85%. And I'm scared, at about 90%, that I'll end up alone.",
        "response_quality": "complete",
        "satisfaction_score": 1.0,
        "ready_for_next_step": true,
        "missing_elements": [],
        "suggested_action": "proceed",
        "evaluation_notes": "User clearly identifies multiple, relevant emotions with high-intensity ratings."
    },
    {
        "id": "cbt_089",
        "cbt_step": "1.1",
        "trigger_statement": "I always ruin relationships.",
        "conversation_context": "User is feeling distressed after a recent breakup.",
        "model_question": "That is a lot to hold. Thank you for sharing. When you think the thought 'I always ruin relationships,' what specific evidence does your mind bring to the witness stand?",
        "user_response": "Well, this one just ended. The one before that ended after a year. And the one before that was a total disaster. It's a clear pattern.",
        "response_quality": "complete",
        "satisfaction_score": 0.9,
        "ready_for_next_step": true,
        "missing_elements": [],
        "suggested_action": "proceed",
        "evaluation_notes": "User provides specific examples that create a compelling pattern supporting their negative thought. This is good, concrete evidence to work with."
    },
    {
        "id": "cbt_090",
        "cbt_step": "1.2",
        "trigger_statement": "I always ruin relationships.",
        "conversation_context": "User is feeling distressed after a recent breakup.",
        "model_question": "Okay, I see the pattern you're talking about. To be good detectives, we need all the evidence. Can you think of any relationships in your life—including friendships or family—that have been successful and long-lasting?",
        "user_response": "That's different. But I guess I've been best friends with Sarah for over ten years. And I'm really close with my brother.",
        "response_quality": "complete",
        "satisfaction_score": 0.8,
        "ready_for_next_step": true,
        "missing_elements": [],
        "suggested_action": "proceed",
        "evaluation_notes": "Good response. The user correctly identifies that friendships are a different category but still provides the requested counter-examples. This shows they are capable of seeing nuance."
    },
    {
        "id": "cbt_091",
        "cbt_step": "1.3",
        "trigger_statement": "I always ruin relationships.",
        "conversation_context": "User is feeling distressed after a recent breakup.",
        "model_question": "So we have the evidence of romantic relationships ending, and also the evidence of strong, long-lasting friendships. How could you rephrase 'I always ruin relationships' to include both pieces of evidence?",
        "user_response": "Maybe... 'I have struggled with maintaining romantic relationships, but I am capable of having healthy and long-lasting friendships.'",
        "response_quality": "complete",
        "satisfaction_score": 1.0,
        "ready_for_next_step": true,
        "missing_elements": [],
        "suggested_action": "proceed",
        "evaluation_notes": "A very strong and precise reframe. It clearly differentiates between the two domains and uses non-judgmental language ('struggled with' vs 'ruin')."
    },
    {
        "id": "cbt_092",
        "cbt_step": "1.4",
        "trigger_statement": "I always ruin relationships.",
        "conversation_context": "User is feeling distressed after a recent breakup.",
        "model_question": "That's a much more accurate statement. Let's check in with those original feelings. You said you felt heartbroken at 95%, like a failure at 85%, and scared at 90%. What are those numbers now?",
        "user_response": "The heartbroken feeling is still there, maybe at an 80%. A breakup is still a breakup. But the 'failure' feeling is way down, to like 20%. And the fear is lower too, maybe 50%.",
        "response_quality": "complete",
        "satisfaction_score": 0.95,
        "ready_for_next_step": true,
        "missing_elements": [],
        "suggested_action": "proceed",
        "evaluation_notes": "Excellent, nuanced re-rating. The user realistically notes that the grief from the breakup is still present, but the self-blame and catastrophic fear have significantly decreased. This is a very successful outcome."
    },
    {
        "id": "cbt_093",
        "cbt_step": "1.5",
        "trigger_statement": "I always ruin relationships.",
        "conversation_context": "User is feeling distressed after a recent breakup.",
        "model_question": "It's a huge step to be able to separate the pain of a breakup from the story you tell yourself about your worth. Thank you for your hard work. What is on your mind now?",
        "user_response": "It still hurts, but I don't feel like it's all my fault anymore. I feel like I can grieve this loss without it meaning I'm doomed. Thank you.",
        "response_quality": "complete",
        "satisfaction_score": 1.0,
        "ready_for_next_step": true,
        "missing_elements": [],
        "suggested_action": "proceed",
        "evaluation_notes": "A perfect summary of the cognitive shift. The user clearly articulates the change in their perspective, showing the exercise has been fully integrated."
    },
    {
        "id": "cbt_094",
        "cbt_step": "1.0",
        "trigger_statement": "I'm a burden to everyone.",
        "conversation_context": "User is recovering from a minor illness and has had to ask for help.",
        "model_question": "That's a heavy feeling to carry, especially when you're not feeling well physically. Can you tell me what specific emotions that thought brings up, and their intensity from 0-100%?",
        "user_response": "I just feel so much guilt, it's a 90%. And anxiety that people are secretly annoyed with me, that's at about 80%.",
        "response_quality": "complete",
        "satisfaction_score": 1.0,
        "ready_for_next_step": true,
        "missing_elements": [],
        "suggested_action": "proceed",
        "evaluation_notes": "Clear, cooperative response with specific emotions and high ratings."
    },
    {
        "id": "cbt_095",
        "cbt_step": "1.1",
        "trigger_statement": "I'm a burden to everyone.",
        "conversation_context": "User is recovering from a minor illness and has had to ask for help.",
        "model_question": "Okay, that's a lot of guilt and anxiety. What specific events are feeding that feeling of being a burden?",
        "user_response": "I had to ask my friend to pick up my prescription yesterday. And my mom dropped off soup. I feel like I'm just an inconvenience to everyone.",
        "response_quality": "complete",
        "satisfaction_score": 0.9,
        "ready_for_next_step": true,
        "missing_elements": [],
        "suggested_action": "proceed",
        "evaluation_notes": "User provides clear, concrete examples of the behaviors that are triggering their negative thought."
    },
    {
        "id": "cbt_096",
        "cbt_step": "1.2",
        "trigger_statement": "I'm a burden to everyone.",
        "conversation_context": "User is recovering from a minor illness and has had to ask for help.",
        "model_question": "Thank you. Let's try a perspective shift. If your friend was sick and asked you to pick up their prescription, what would you think? Would you feel they were a burden?",
        "user_response": "No, of course not. I'd be happy to do it. I would want to help.",
        "response_quality": "complete",
        "satisfaction_score": 1.0,
        "ready_for_next_step": true,
        "missing_elements": [],
        "suggested_action": "proceed",
        "evaluation_notes": "The Socratic question worked perfectly. The user was able to step outside their own perspective and access their values and empathy, creating a powerful piece of contradictory evidence."
    },
    {
        "id": "cbt_097",
        "cbt_step": "1.3",
        "trigger_statement": "I'm a burden to everyone.",
        "conversation_context": "User is recovering from a minor illness and has had to ask for help.",
        "model_question": "Exactly. So if you would be happy to help your friends, and they are your friends, what's a more balanced way to see this situation than 'I'm a burden'?",
        "user_response": "That asking for help when I'm sick doesn't make me a burden. It gives the people who care about me a chance to show it. It's what friends and family do for each other.",
        "response_quality": "complete",
        "satisfaction_score": 1.0,
        "ready_for_next_step": true,
        "missing_elements": [],
        "suggested_action": "proceed",
        "evaluation_notes": "A superb reframe. The user has completely shifted their perspective from seeing asking for help as an inconvenience to seeing it as an opportunity for connection."
    },
    {
        "id": "cbt_098",
        "cbt_step": "1.4",
        "trigger_statement": "I'm a burden to everyone.",
        "conversation_context": "User is recovering from a minor illness and has had to ask for help.",
        "model_question": "That is a wonderful and compassionate way to look at it. Let's check in with the guilt (90%) and anxiety (80%). What are those numbers looking like now?",
        "user_response": "The guilt is almost gone. Maybe 10%. The anxiety is gone too, maybe 5%. I just feel grateful now.",
        "response_quality": "complete",
        "satisfaction_score": 1.0,
        "ready_for_next_step": true,
        "missing_elements": [],
        "suggested_action": "proceed",
        "evaluation_notes": "A dramatic and positive reduction in negative emotions, with the emergence of a positive one (gratitude). This indicates the reframe was highly effective."
    },
    {
        "id": "cbt_099",
        "cbt_step": "1.5",
        "trigger_statement": "I'm a burden to everyone.",
        "conversation_context": "User is recovering from a minor illness and has had to ask for help.",
        "model_question": "That's fantastic to hear. It seems like changing that one thought has really lifted a weight off your shoulders. What are you thinking about doing now?",
        "user_response": "I'm thinking of sending a text to my friend and my mom to thank them. I feel much better about it now. Thank you.",
        "response_quality": "complete",
        "satisfaction_score": 1.0,
        "ready_for_next_step": true,
        "missing_elements": [],
        "suggested_action": "proceed",
        "evaluation_notes": "A perfect conclusion. The user is translating their new cognitive and emotional state into a positive, pro-social action."
    },
    {
        "id": "cbt_100",
        "cbt_step": "1.0",
        "trigger_statement": "I'm awkward and nobody likes me.",
        "conversation_context": "User attended a work party the previous night and felt they didn't connect with anyone.",
        "model_question": "That sounds like a really difficult and lonely experience. Social events can be tough. Could you tell me what emotions are coming up when you think that thought, and how intense they are from 0-100%?",
        "user_response": "I feel intense anxiety, my heart is still racing thinking about it, that's at 90%. And a deep sense of loneliness, probably at 85%. Also, embarrassment, maybe 70%.",
        "response_quality": "complete",
        "satisfaction_score": 1.0,
        "ready_for_next_step": true,
        "missing_elements": [],
        "suggested_action": "proceed",
        "evaluation_notes": "Excellent response. User identifies specific, relevant emotions and ratings, and includes a physical sensation (racing heart), which adds valuable context."
    },
    {
        "id": "cbt_101",
        "cbt_step": "1.1",
        "trigger_statement": "I'm awkward and nobody likes me.",
        "conversation_context": "User attended a work party the previous night and felt they didn't connect with anyone.",
        "model_question": "That's a very painful combination of feelings. When your mind provides the thought 'I'm awkward and nobody likes me,' what evidence from the party does it use to back that up?",
        "user_response": "I stood by myself in the corner for at least 20 minutes. When I tried to join a conversation, people just kind of smiled and then turned back to each other. I just felt invisible, like nobody wanted me there.",
        "response_quality": "complete",
        "satisfaction_score": 0.9,
        "ready_for_next_step": true,
        "missing_elements": [],
        "suggested_action": "proceed",
        "evaluation_notes": "User provides specific behavioral observations ('stood by myself') and interpretations ('people smiled and turned back') to support their belief. This is a very realistic example of social anxiety evidence."
    },
    {
        "id": "cbt_102",
        "cbt_step": "1.2",
        "trigger_statement": "I'm awkward and nobody likes me.",
        "conversation_context": "User attended a work party the previous night and felt they didn't connect with anyone.",
        "model_question": "Okay, I can see how those moments would feel like strong evidence. To make sure we're seeing the whole picture, was there any point in the night, no matter how small, that contradicts that idea? Any pleasant moments at all?",
        "user_response": "I don't think so. I just wanted to leave the whole time... Well, I guess my manager, who invited me, came over and said she was really glad I could make it. But she had to say that.",
        "response_quality": "partial",
        "satisfaction_score": 0.6,
        "ready_for_next_step": true,
        "missing_elements": [],
        "suggested_action": "proceed",
        "evaluation_notes": "This is a classic 'Yes, but...' response. The user provides a good piece of counter-evidence but immediately discounts it. The model should accept the evidence and plan to address the discounting during the reframe step."
    },
    {
        "id": "cbt_103",
        "cbt_step": "1.2.2",
        "trigger_statement": "I'm awkward and nobody likes me.",
        "conversation_context": "User attended a work party the previous night and felt they didn't connect with anyone.",
        "model_question": "That's a great example to include. Let's hold onto the fact that your manager said she was glad you were there. Can you think of anything else? Did you have any one-on-one conversations?",
        "user_response": "I did talk to Sarah from accounting for about five minutes about that new fantasy show we both watch. That was okay. We were just complaining about the season finale.",
        "response_quality": "complete",
        "satisfaction_score": 0.9,
        "ready_for_next_step": true,
        "missing_elements": [],
        "suggested_action": "proceed",
        "evaluation_notes": "The prompt for a specific type of interaction (one-on-one) successfully helped the user recall another piece of positive data. This shows the value of targeted follow-up questions."
    },
    {
        "id": "cbt_104",
        "cbt_step": "1.3",
        "trigger_statement": "I'm awkward and nobody likes me.",
        "conversation_context": "User attended a work party the previous night and felt they didn't connect with anyone.",
        "model_question": "Perfect. So, we have the feelings of awkwardness and being left out, but we also have your manager being glad you came and a pleasant conversation with Sarah. How could you rephrase 'I'm awkward and nobody likes me' to be more balanced?",
        "user_response": "A more balanced thought is: 'I feel very anxious in large social gatherings, which sometimes makes it hard for me to connect. However, I am capable of having pleasant one-on-one conversations, and my presence is valued by some people.'",
        "response_quality": "complete",
        "satisfaction_score": 1.0,
        "ready_for_next_step": true,
        "missing_elements": [],
        "suggested_action": "proceed",
        "evaluation_notes": "A superb, nuanced reframe. It separates the feeling (anxiety) from the identity (awkward), acknowledges the difficulty, and incorporates the specific positive evidence."
    },
    {
        "id": "cbt_105",
        "cbt_step": "1.4",
        "trigger_statement": "I'm awkward and nobody likes me.",
        "conversation_context": "User attended a work party the previous night and felt they didn't connect with anyone.",
        "model_question": "That's a much more helpful and accurate way to see it. Let's check in on the original feelings: anxiety at 90%, loneliness at 85%, and embarrassment at 70%. What are those numbers now?",
        "user_response": "The anxiety is still there, because I still don't love parties, but it's much lower, maybe 50%. The loneliness is way down, maybe 30%. And the embarrassment is almost gone, like 10%.",
        "response_quality": "complete",
        "satisfaction_score": 0.95,
        "ready_for_next_step": true,
        "missing_elements": [],
        "suggested_action": "proceed",
        "evaluation_notes": "A clear, positive shift in emotions. The user realistically notes that some anxiety remains, which is authentic and shows the reframe isn't a magic cure-all, but a tool for management."
    },
    {
        "id": "cbt_106",
        "cbt_step": "1.5",
        "trigger_statement": "I'm awkward and nobody likes me.",
        "conversation_context": "User attended a work party the previous night and felt they didn't connect with anyone.",
        "model_question": "That's a significant improvement. It shows how challenging that one thought can make a huge difference. Thanks for doing that work. What's on your mind now?",
        "user_response": "I feel relieved. The party wasn't a total disaster, even if it wasn't easy. I survived. I feel less scared about the next work event now.",
        "response_quality": "complete",
        "satisfaction_score": 1.0,
        "ready_for_next_step": true,
        "missing_elements": [],
        "suggested_action": "proceed",
        "evaluation_notes": "A great conclusion. The user summarizes their new perspective ('not a total disaster'), acknowledges the difficulty, and expresses reduced fear about the future, which is a key goal of CBT."
    },
    {
        "id": "cbt_107",
        "cbt_step": "1.0",
        "trigger_statement": "I'm a bad mom.",
        "conversation_context": "User is feeling terrible after losing their temper and yelling at their child for spilling something.",
        "model_question": "That sounds like a very painful moment. It's so hard when we act in ways we regret. Can you tell me what emotions are coming up for you right now, and how intense they are on that 0-100% scale?",
        "user_response": "I feel overwhelming guilt, it's 100%. And I feel a lot of self-loathing, maybe 85%. I just feel like a monster.",
        "response_quality": "complete",
        "satisfaction_score": 1.0,
        "ready_for_next_step": true,
        "missing_elements": [],
        "suggested_action": "proceed",
        "evaluation_notes": "The user identifies extremely intense, relevant emotions. The use of 'self-loathing' and 'monster' indicates a high degree of distress and self-blame."
    },
    {
        "id": "cbt_108",
        "cbt_step": "1.1",
        "trigger_statement": "I'm a bad mom.",
        "conversation_context": "User is feeling terrible after losing their temper and yelling at their child for spilling something.",
        "model_question": "The guilt and self-loathing are coming through so strongly. When your mind says 'I'm a bad mom,' what is the specific evidence it's using?",
        "user_response": "I yelled at my son for spilling his juice. I really yelled. A good mom would have been patient and understanding. They wouldn't scream over something so small.",
        "response_quality": "complete",
        "satisfaction_score": 0.9,
        "ready_for_next_step": true,
        "missing_elements": [],
        "suggested_action": "proceed",
        "evaluation_notes": "User provides the specific event and also reveals the rigid rule ('A good mom would have...') that is driving the self-judgment. This is very useful data."
    },
    {
        "id": "cbt_109",
        "cbt_step": "1.2",
        "trigger_statement": "I'm a bad mom.",
        "conversation_context": "User is feeling terrible after losing their temper and yelling at their child for spilling something.",
        "model_question": "Okay, that moment felt like evidence of being a 'bad mom'. Now, let's look at the bigger picture. What happened after you yelled? And what are some other things you've done as a mom this week?",
        "user_response": "After a minute, I calmed down and apologized to him. We cleaned it up together and then we hugged. And this week... well, I read to him every night and I helped him with a school project he was proud of.",
        "response_quality": "complete",
        "satisfaction_score": 1.0,
        "ready_for_next_step": true,
        "missing_elements": [],
        "suggested_action": "proceed",
        "evaluation_notes": "Perfect response. The user identifies how they repaired the situation (a key parenting skill) and also provides other examples of 'good mom' behaviors, creating strong contradictory evidence."
    },
    {
        "id": "cbt_110",
        "cbt_step": "1.3",
        "trigger_statement": "I'm a bad mom.",
        "conversation_context": "User is feeling terrible after losing their temper and yelling at their child for spilling something.",
        "model_question": "That's very important information. So we have the yelling, but we also have the apology, the hug, the bedtime stories, and the project help. How could you rephrase 'I'm a bad mom' to be more accurate and include all the facts?",
        "user_response": "I could say: 'I made a mistake and lost my temper, which I regret. But my ability to apologize and all the other loving things I do mean that I am actually a good mom who is not perfect.'",
        "response_quality": "complete",
        "satisfaction_score": 1.0,
        "ready_for_next_step": true,
        "missing_elements": [],
        "suggested_action": "proceed",
        "evaluation_notes": "An excellent, healthy reframe. It takes responsibility for the action, separates the action from identity, incorporates the repair, and states the new belief clearly."
    },
    {
        "id": "cbt_111",
        "cbt_step": "1.4",
        "trigger_statement": "I'm a bad mom.",
        "conversation_context": "User is feeling terrible after losing their temper and yelling at their child for spilling something.",
        "model_question": "That is a powerful and true statement. Let's check in with the guilt (100%) and self-loathing (85%). How strong are they now?",
        "user_response": "The self-loathing is almost completely gone, maybe 5%. The guilt is still there, because I still feel bad that I yelled, but it's not overwhelming. Maybe 30%. It feels like healthy guilt now, not toxic.",
        "response_quality": "complete",
        "satisfaction_score": 1.0,
        "ready_for_next_step": true,
        "missing_elements": [],
        "suggested_action": "proceed",
        "evaluation_notes": "A superb re-rating. The user shows a massive reduction in the toxic emotion (self-loathing) and reframes the remaining guilt as a healthy, functional emotion. This shows deep insight."
    },
    {
        "id": "cbt_112",
        "cbt_step": "1.5",
        "trigger_statement": "I'm a bad mom.",
        "conversation_context": "User is feeling terrible after losing their temper and yelling at their child for spilling something.",
        "model_question": "Distinguishing between healthy guilt and toxic self-loathing is a huge step. It seems you've really changed your perspective on this. What's on your mind now?",
        "user_response": "I feel so much lighter. I was stuck in a shame spiral. Now I'm just thinking about how much I love my son and how I can try to be more patient tomorrow. It's about trying, not about being perfect.",
        "response_quality": "complete",
        "satisfaction_score": 1.0,
        "ready_for_next_step": true,
        "missing_elements": [],
        "suggested_action": "proceed",
        "evaluation_notes": "A perfect conclusion that summarizes the new, healthy belief ('It's about trying, not about being perfect') and shifts the user's focus toward future positive action."
    },
    {
        "id": "cbt_113",
        "cbt_step": "1.0",
        "trigger_statement": "I'm not a real artist.",
        "conversation_context": "A hobbyist painter feels like an imposter after viewing professional art online.",
        "model_question": "That feeling of being an 'imposter' is so common, but very painful. Thank you for sharing. What specific moods does that thought trigger for you, and what's their intensity from 0-100%?",
        "user_response": "It makes me feel very discouraged, like 90%. And I feel envy, which I don't like, probably at 75%. Also just a sense of hopelessness, like 'why even bother?', at 80%.",
        "response_quality": "complete",
        "satisfaction_score": 1.0,
        "ready_for_next_step": true,
        "missing_elements": [],
        "suggested_action": "proceed",
        "evaluation_notes": "User provides a clear set of relevant emotions and intensity ratings, setting a strong foundation for the exercise."
    },
    {
        "id": "cbt_114",
        "cbt_step": "1.1",
        "trigger_statement": "I'm not a real artist.",
        "conversation_context": "A hobbyist painter feels like an imposter after viewing professional art online.",
        "model_question": "That's a potent mix of feelings. When your mind says 'I'm not a real artist,' what evidence does it use to prove its case?",
        "user_response": "My technical skill is nowhere near the professionals I see online. I've never been to art school. I've never sold a painting or been in a gallery. I just do it in my spare room.",
        "response_quality": "complete",
        "satisfaction_score": 0.9,
        "ready_for_next_step": true,
        "missing_elements": [],
        "suggested_action": "proceed",
        "evaluation_notes": "User provides clear evidence based on a comparison to a narrow, professional definition of 'artist'. The evidence is factual from their perspective."
    },
    {
        "id": "cbt_115",
        "cbt_step": "1.2",
        "trigger_statement": "I'm not a real artist.",
        "conversation_context": "A hobbyist painter feels like an imposter after viewing professional art online.",
        "model_question": "So, it seems you're defining a 'real artist' in a very specific, professional way. Let's look for other data. Why do you make art in the first place? And has anyone ever expressed enjoyment of your art?",
        "user_response": "I do it because it makes me happy and calm. It's how I relax. And... my best friend has two of my paintings hanging in her apartment. She says she loves them.",
        "response_quality": "complete",
        "satisfaction_score": 1.0,
        "ready_for_next_step": true,
        "missing_elements": [],
        "suggested_action": "proceed",
        "evaluation_notes": "The model's question successfully challenged the user's narrow definition, helping them access different kinds of evidence: internal motivation (joy) and external validation from a friend."
    },
    {
        "id": "cbt_116",
        "cbt_step": "1.3",
        "trigger_statement": "I'm not a real artist.",
        "conversation_context": "A hobbyist painter feels like an imposter after viewing professional art online.",
        "model_question": "That's great evidence. So being an artist can be about joy and connection, not just about sales and galleries. How could you redefine your original thought 'I'm not a real artist'?",
        "user_response": "I guess a 'real artist' is just someone who creates art. I don't have to be a professional to be an artist. My art is real, and I am an artist because I make it.",
        "response_quality": "complete",
        "satisfaction_score": 1.0,
        "ready_for_next_step": true,
        "missing_elements": [],
        "suggested_action": "proceed",
        "evaluation_notes": "A perfect reframe that challenges and replaces the user's original, rigid rule with a more inclusive and self-compassionate definition."
    },
    {
        "id": "cbt_117",
        "cbt_step": "1.4",
        "trigger_statement": "I'm not a real artist.",
        "conversation_context": "A hobbyist painter feels like an imposter after viewing professional art online.",
        "model_question": "That's a much more empowering definition. Let's check in with those feelings: discouragement at 90%, envy at 75%, and hopelessness at 80%. What are they now?",
        "user_response": "The discouragement is almost gone, maybe 10%. The envy is gone too. Now I just see their art as inspiring, not as a threat. And the hopelessness is replaced with excitement. I feel excited to paint, maybe 70%.",
        "response_quality": "complete",
        "satisfaction_score": 1.0,
        "ready_for_next_step": true,
        "missing_elements": [],
        "suggested_action": "proceed",
        "evaluation_notes": "A fantastic outcome. The user not only reduced the negative emotions but reframed one (envy -> inspiration) and replaced another with a positive, action-oriented feeling (hopelessness -> excitement)."
    },
    {
        "id": "cbt_118",
        "c_step": "1.5",
        "trigger_statement": "I'm not a real artist.",
        "conversation_context": "A hobbyist painter feels like an imposter after viewing professional art online.",
        "model_question": "That's a wonderful shift from envy to inspiration. It opens up a lot more room for joy. Thank you for taking that journey. What's on your mind now?",
        "user_response": "I'm thinking about that unfinished canvas in my spare room. I feel excited to work on it tonight, just for me. The pressure is gone. Thank you.",
        "response_quality": "complete",
        "satisfaction_score": 1.0,
        "ready_for_next_step": true,
        "missing_elements": [],
        "suggested_action": "proceed",
        "evaluation_notes": "The ideal conclusion. The user is reconnecting with their intrinsic motivation and is planning a positive, behavioral action based on their new, healthier belief."
    },
   
    {
        "id": "cbt_119",
        "cbt_step": "1.0",
        "trigger_statement": "I'm going to get fired.",
        "conversation_context": "User made a significant calculation error in a report for a client.",
        "model_question": "That's an incredibly stressful situation, and the fear of losing your job is very real. Thank you for sharing that with me. What emotions are you feeling right now, and how intense are they from 0-100%?",
        "user_response": "I feel pure fear, it's at 95%. And a sense of panic, like I can't breathe, that's at 90%. I also feel deep shame, maybe 80%.",
        "response_quality": "complete",
        "satisfaction_score": 1.0,
        "ready_for_next_step": true,
        "missing_elements": [],
        "suggested_action": "proceed",
        "evaluation_notes": "User clearly identifies intense, appropriate emotions for the situation and includes a physical sensation (can't breathe), indicating panic."
    },
    {
        "id": "cbt_120",
        "cbt_step": "1.1",
        "trigger_statement": "I'm going to get fired.",
        "conversation_context": "User made a significant calculation error in a report for a client.",
        "model_question": "That's a very intense wave of emotion to be hit with. When your mind is screaming 'I'm going to get fired,' what specific evidence is it using to support that conclusion?",
        "user_response": "The evidence is the error itself. It was a major client report, and my mistake could cost the company money. That's a fireable offense.",
        "response_quality": "complete",
        "satisfaction_score": 0.9,
        "ready_for_next_step": true,
        "missing_elements": [],
        "suggested_action": "proceed",
        "evaluation_notes": "The user provides a clear, factual event and its potential consequence as evidence. This is a strong and realistic basis for the exercise."
    },
    {
        "id": "cbt_121",
        "cbt_step": "1.2",
        "trigger_statement": "I'm going to get fired.",
        "conversation_context": "User made a significant calculation error in a report for a client.",
        "model_question": "Okay, the mistake is a serious piece of data. Now, let's look at your entire history with the company to get the full picture. What does your track record look like? Think about past performance reviews or feedback from your boss.",
        "user_response": "My last performance review was 'exceeds expectations.' I got a raise last year. And my boss has always said she values my work ethic... And I did catch a major error from someone else last quarter.",
        "response_quality": "complete",
        "satisfaction_score": 1.0,
        "ready_for_next_step": true,
        "missing_elements": [],
        "suggested_action": "proceed",
        "evaluation_notes": "The user successfully accesses strong, specific contradictory evidence about their overall performance, creating a necessary counterbalance to the recent mistake."
    },
    {
        "id": "cbt_122",
        "cbt_step": "1.3",
        "trigger_statement": "I'm going to get fired.",
        "conversation_context": "User made a significant calculation error in a report for a client.",
        "model_question": "That's crucial evidence. So on one side, we have this serious error. On the other, we have a history of exceeding expectations and being a valued employee. How can you rephrase 'I'm going to get fired' to be more balanced?",
        "user_response": "A more balanced thought is: 'I made a significant mistake that I need to take responsibility for, but given my strong track record, the more likely outcome is a serious conversation, not termination.'",
        "response_quality": "complete",
        "satisfaction_score": 1.0,
        "ready_for_next_step": true,
        "missing_elements": [],
        "suggested_action": "proceed",
        "evaluation_notes": "An excellent reframe. It acknowledges the severity of the mistake without catastrophizing, incorporates the positive evidence, and proposes a more realistic, less extreme outcome."
    },
    {
        "id": "cbt_123",
        "cbt_step": "1.4",
        "trigger_statement": "I'm going to get fired.",
        "conversation_context": "User made a significant calculation error in a report for a client.",
        "model_question": "That's a much more manageable thought. Let's check in with the original feelings: fear at 95%, panic at 90%, and shame at 80%. How do those feel now?",
        "user_response": "The panic is gone, maybe 10%. The fear is still there, but it's more like strong concern now, maybe at a 60%. The shame is down to 40%. It feels less like 'I am bad' and more like 'I did something bad.'",
        "response_quality": "complete",
        "satisfaction_score": 1.0,
        "ready_for_next_step": true,
        "missing_elements": [],
        "suggested_action": "proceed",
        "evaluation_notes": "A superb response. The user not only re-rates the emotions downwards but also shows deep insight by distinguishing between shame ('I am bad') and guilt ('I did something bad')."
    },
    {
        "id": "cbt_124",
        "cbt_step": "1.5",
        "trigger_statement": "I'm going to get fired.",
        "conversation_context": "User made a significant calculation error in a report for a client.",
        "model_question": "That shift from shame to guilt is a huge step toward solving the problem instead of just feeling bad about it. What are you thinking of doing now?",
        "user_response": "I'm going to draft an email to my boss explaining what happened, how I found the error, and my plan to fix it. I'm not looking forward to it, but I feel like I can handle it now.",
        "response_quality": "complete",
        "satisfaction_score": 1.0,
        "ready_for_next_step": true,
        "missing_elements": [],
        "suggested_action": "proceed",
        "evaluation_notes": "A perfect conclusion. The user has moved from panic to a constructive, action-oriented plan. This demonstrates the success of the CBT sequence."
    },
    {
        "id": "cbt_125",
        "cbt_step": "1.0",
        "trigger_statement": "I'm ugly.",
        "conversation_context": "User is feeling self-conscious about their appearance after seeing a photo of themself.",
        "model_question": "That's a very harsh and painful judgment to level against yourself. I'm sorry you're feeling that way. Can you tell me what emotions come up when you think that, and rate their intensity from 0-100%?",
        "user_response": "I just feel disgust, maybe at 80%. And a lot of shame, probably 85%. It makes me just want to hide.",
        "response_quality": "complete",
        "satisfaction_score": 1.0,
        "ready_for_next_step": true,
        "missing_elements": [],
        "suggested_action": "proceed",
        "evaluation_notes": "User identifies specific, powerful emotions related to body image and self-worth. The desire 'to hide' is a strong behavioral indicator of the distress."
    },
    {
        "id": "cbt_126",
        "cbt_step": "1.1",
        "trigger_statement": "I'm ugly.",
        "conversation_context": "User is feeling self-conscious about their appearance after seeing a photo of themself.",
        "model_question": "That's a heavy combination of feelings. When your mind says 'I'm ugly,' what specific evidence is it zooming in on?",
        "user_response": "It's this photo from the weekend. The angle is terrible. My skin looks bad, you can see all the wrinkles around my eyes, and my smile looks fake. I hate it.",
        "response_quality": "complete",
        "satisfaction_score": 0.9,
        "ready_for_next_step": true,
        "missing_elements": [],
        "suggested_action": "proceed",
        "evaluation_notes": "The user provides specific points of self-criticism based on a single piece of data (one photo). This is a classic example of filtering and overgeneralization."
    },
    {
        "id": "cbt_127",
        "cbt_step": "1.2",
        "trigger_statement": "I'm ugly.",
        "conversation_context": "User is feeling self-conscious about their appearance after seeing a photo of themself.",
        "model_question": "It's easy to let one photo define our whole self-image. To get a more balanced view, can you think of any contradictory data? For instance, has anyone you care about ever complimented your appearance or your smile?",
        "user_response": "I don't know... my partner tells me I'm beautiful, but they have to say that, right? My best friend says I have a great laugh. But that's not about being pretty.",
        "response_quality": "partial",
        "satisfaction_score": 0.6,
        "ready_for_next_step": true,
        "missing_elements": [],
        "suggested_action": "proceed",
        "evaluation_notes": "Another 'Yes, but...' response. The user provides contradictory evidence but immediately discounts it. They also create a rigid distinction between having a 'great laugh' and being 'pretty', showing how narrow their definition of attractiveness is."
    },
    {
        "id": "cbt_128",
        "cbt_step": "1.2.2",
        "trigger_statement": "I'm ugly.",
        "conversation_context": "User is feeling self-conscious about their appearance after seeing a photo of themself.",
        "model_question": "Let's hold onto that 'great laugh' for a moment. True attractiveness is about more than just a static photo. It's about how you light up when you laugh, or the kindness in your eyes. Can you think of any other personal qualities you have that you value?",
        "user_response": "Okay, I see what you mean. Well, I'm a very loyal friend. And I'm told I'm a good listener. And I'm proud of how hard I work at my job.",
        "response_quality": "complete",
        "satisfaction_score": 0.9,
        "ready_for_next_step": true,
        "missing_elements": [],
        "suggested_action": "proceed",
        "evaluation_notes": "The model successfully widens the aperture from physical appearance to overall self-worth. The user is able to access and list positive personal qualities, which is crucial contradictory evidence."
    },
    {
        "id": "cbt_129",
        "cbt_step": "1.3",
        "trigger_statement": "I'm ugly.",
        "conversation_context": "User is feeling self-conscious about their appearance after seeing a photo of themself.",
        "model_question": "That's a wonderful list of qualities. So we have an unflattering photo on one side, and on the other, you are a beautiful, loyal, hard-working friend with a great laugh. How can you rephrase 'I'm ugly' to be more true?",
        "user_response": "A more true statement is: 'I was unhappy with how I looked in one specific photo, but my worth is not determined by my appearance. I am a valuable person because of my character and how I treat others.'",
        "response_quality": "complete",
        "satisfaction_score": 1.0,
        "ready_for_next_step": true,
        "missing_elements": [],
        "suggested_action": "proceed",
        "evaluation_notes": "A perfect reframe. It decouples self-worth from physical appearance and acknowledges the initial trigger (unhappiness with a photo) without letting it define the user's entire identity."
    },
    {
        "id": "cbt_130",
        "cbt_step": "1.4",
        "trigger_statement": "I'm ugly.",
        "conversation_context": "User is feeling self-conscious about their appearance after seeing a photo of themself.",
        "model_question": "That feels so much more grounded and kind. Let's check in with the original feelings: disgust at 80% and shame at 85%. Where are they now?",
        "user_response": "They are so much lower. The disgust is maybe 10%. I just see it as a bad photo now. And the shame is down to maybe 20%. I feel more... acceptance.",
        "response_quality": "complete",
        "satisfaction_score": 1.0,
        "ready_for_next_step": true,
        "missing_elements": [],
        "suggested_action": "proceed",
        "evaluation_notes": "A clear and significant reduction in negative emotions, with the emergence of a positive state (acceptance). This indicates the reframe was highly effective."
    },
    {
        "id": "cbt_131",
        "cbt_step": "1.5",
        "trigger_statement": "I'm ugly.",
        "conversation_context": "User is feeling self-conscious about their appearance after seeing a photo of themself.",
        "model_question": "Moving from shame to acceptance is a monumental shift. Thank you for trusting the process. What's on your mind now?",
        "user_response": "I'm thinking about how much time I waste worrying about this stuff. It feels silly now. I'm just going to delete the photo and move on with my day.",
        "response_quality": "complete",
        "satisfaction_score": 1.0,
        "ready_for_next_step": true,
        "missing_elements": [],
        "suggested_action": "proceed",
        "evaluation_notes": "A great conclusion that shows insight and includes a concrete, helpful action (deleting the photo) to close the loop on the initial trigger."
    },

    {
        "id": "cbt_132",
        "cbt_step": "1.0",
        "trigger_statement": "I'm wasting my life.",
        "conversation_context": "User in their late 20s feels directionless and stuck in a dead-end job.",
        "model_question": "That's a very heavy and painful thought to be carrying. The feeling of being 'stuck' is incredibly difficult. Can you tell me what specific emotions that thought brings up, and their intensity from 0-100%?",
        "user_response": "I feel a huge amount of anxiety about the future, that's at 90%. And a sense of despair, like it's too late to change, that's at about 85%. I just feel... stuck.",
        "response_quality": "complete",
        "satisfaction_score": 1.0,
        "ready_for_next_step": true,
        "missing_elements": [],
        "suggested_action": "proceed",
        "evaluation_notes": "User identifies specific, powerful emotions tied to an existential concern, and reinforces their core feeling of being 'stuck'."
    },
    {
        "id": "cbt_133",
        "cbt_step": "1.1",
        "trigger_statement": "I'm wasting my life.",
        "conversation_context": "User in their late 20s feels directionless and stuck in a dead-end job.",
        "model_question": "That anxiety and despair sound overwhelming. When your mind says you're 'wasting your life,' what evidence does it present to you?",
        "user_response": "I'm 28, and I work in a job I don't care about just to pay rent. My friends are all getting promotions, buying houses, getting married. My life is just a boring loop. I don't have a passion or a plan.",
        "response_quality": "complete",
        "satisfaction_score": 0.9,
        "ready_for_next_step": true,
        "missing_elements": [],
        "suggested_action": "proceed",
        "evaluation_notes": "User provides evidence based on social comparison and a perceived lack of passion or progress, which is a very common trigger for this type of negative thought."
    },
    {
        "id": "cbt_134",
        "cbt_step": "1.2",
        "trigger_statement": "I'm wasting my life.",
        "conversation_context": "User in their late 20s feels directionless and stuck in a dead-end job.",
        "model_question": "Okay, so the evidence is a focus on your career path compared to others. To get a fuller picture of your life, let's look at other areas. What about outside of work? Are there any skills you've learned or moments of joy you've had recently?",
        "user_response": "Those are just hobbies, they don't count towards a life plan... But I have been teaching myself guitar from videos online. I can play a few full songs now. And I went on a really nice hike last weekend that made me feel happy.",
        "response_quality": "partial",
        "satisfaction_score": 0.7,
        "ready_for_next_step": true,
        "missing_elements": [],
        "suggested_action": "proceed",
        "evaluation_notes": "The user provides good counter-examples but immediately discounts them ('just hobbies'). This is a key insight into their belief system (that only career progress 'counts'). The model should proceed and address this."
    },
    {
        "id": "cbt_135",
        "cbt_step": "1.2.2",
        "trigger_statement": "I'm wasting my life.",
        "conversation_context": "User in their late 20s feels directionless and stuck in a dead-end job.",
        "model_question": "Those hobbies absolutely count as part of a life. Learning a musical instrument and appreciating nature are valuable experiences. Let's stay on that for a moment. What did it take for you to learn those songs on guitar?",
        "user_response": "A lot of practice and patience. I had to watch the videos over and over. It was frustrating but I stuck with it. I'm proud of it, actually.",
        "response_quality": "complete",
        "satisfaction_score": 0.9,
        "ready_for_next_step": true,
        "missing_elements": [],
        "suggested_action": "proceed",
        "evaluation_notes": "By probing deeper into the hobby, the model helped the user identify underlying positive traits (patience, persistence, pride), which serve as strong contradictory evidence to the idea of a 'wasted' life."
    },
    {
        "id": "cbt_136",
        "cbt_step": "1.3",
        "trigger_statement": "I'm wasting my life.",
        "conversation_context": "User in their late 20s feels directionless and stuck in a dead-end job.",
        "model_question": "Exactly. You've shown patience and persistence. So on one hand you feel stuck in your job, but on the other you're actively learning, growing, and finding joy in other areas. How can you rephrase 'I'm wasting my life' to be more accurate?",
        "user_response": "A more accurate thought is: 'I am currently unhappy and feeling stuck in my career, but that is only one part of my life. I am still learning and finding joy in other ways, and feeling stuck is a signal to start exploring new options, not a final judgment.'",
        "response_quality": "complete",
        "satisfaction_score": 1.0,
        "ready_for_next_step": true,
        "missing_elements": [],
        "suggested_action": "proceed",
        "evaluation_notes": "An exceptional reframe. The user correctly identifies their career dissatisfaction as just one part of life, reframes the 'stuck' feeling as a signal for action, and incorporates the positive evidence."
    },
    {
        "id": "cbt_137",
        "cbt_step": "1.4",
        "trigger_statement": "I'm wasting my life.",
        "conversation_context": "User in their late 20s feels directionless and stuck in a dead-end job.",
        "model_question": "That's a much more hopeful and empowering way to see things. Let's check in with the original feelings: anxiety at 90% and despair at 85%. What are those numbers now?",
        "user_response": "The despair is way down, maybe to 20%. The anxiety about my career is still there, but it's not a panic anymore. It's more like a manageable concern, maybe at 50%. It feels more like a problem to be solved.",
        "response_quality": "complete",
        "satisfaction_score": 1.0,
        "ready_for_next_step": true,
        "missing_elements": [],
        "suggested_action": "proceed",
        "evaluation_notes": "A very successful outcome. The user shows a significant drop in negative emotions and, most importantly, reframes their anxiety from a state of being into a 'problem to be solved'."
    },
    {
        "id": "cbt_138",
        "cbt_step": "1.5",
        "trigger_statement": "I'm wasting my life.",
        "conversation_context": "User in their late 20s feels directionless and stuck in a dead-end job.",
        "model_question": "Turning despair into a solvable problem is a massive win. That's where all change begins. What are you thinking now?",
        "user_response": "I'm thinking that I don't have to have it all figured out right now. I'm going to spend a little time this weekend just looking into online courses for things I'm curious about. No pressure, just exploring. It feels like a start.",
        "response_quality": "complete",
        "satisfaction_score": 1.0,
        "ready_for_next_step": true,
        "missing_elements": [],
        "suggested_action": "proceed",
        "evaluation_notes": "A perfect conclusion. The user has internalized the new perspective and translated it into a small, manageable, and positive behavioral step."
    },
    {
        "id": "cbt_139",
        "cbt_step": "1.0",
        "trigger_statement": "Nobody wants me around.",
        "conversation_context": "User saw social media photos of friends gathered together without them.",
        "model_question": "Seeing something like that is incredibly painful, and it's easy to feel left out. I'm sorry you had to see that. What emotions are you feeling right now, and how intense are they from 0-100%?",
        "user_response": "I feel so hurt, it's a 95%. And deeply lonely, maybe 90%. And I'm embarrassed that they obviously don't like me as much as I like them.",
        "response_quality": "complete",
        "satisfaction_score": 0.9,
        "ready_for_next_step": true,
        "missing_elements": [],
        "suggested_action": "proceed",
        "evaluation_notes": "User identifies specific and relevant emotions for social rejection. The addition of embarrassment shows a layer of self-judgment on top of the hurt."
    },
    {
        "id": "cbt_140",
        "cbt_step": "1.1",
        "trigger_statement": "Nobody wants me around.",
        "conversation_context": "User saw social media photos of friends gathered together without them.",
        "model_question": "That's a brutal combination of feelings. When your mind says 'Nobody wants me around,' what is the primary evidence it's using?",
        "user_response": "The picture. It's a photo of my whole friend group at dinner last night. I wasn't invited. They deliberately chose to get together without me. It's proof that I'm not really part of the group.",
        "response_quality": "complete",
        "satisfaction_score": 0.9,
        "ready_for_next_step": true,
        "missing_elements": [],
        "suggested_action": "proceed",
        "evaluation_notes": "The user presents the photo as factual evidence, but their interpretation includes cognitive distortions like mind-reading ('deliberately chose') and catastrophizing ('not really part of the group')."
    },
    {
        "id": "cbt_141",
        "cbt_step": "1.2",
        "trigger_statement": "Nobody wants me around.",
        "conversation_context": "User saw social media photos of friends gathered together without them.",
        "model_question": "The photo is a fact, and your hurt feelings are completely valid. To be good detectives, we need to look for any other data that might not fit the conclusion that *nobody* wants you around. Have you had any positive interactions with anyone from that group recently?",
        "user_response": "Well, yes. I had coffee with Anna on Tuesday and we had a great time. And Mark sent me a funny video yesterday. But that doesn't change the fact they all met up without me.",
        "response_quality": "partial",
        "satisfaction_score": 0.7,
        "ready_for_next_step": true,
        "missing_elements": [],
        "suggested_action": "proceed",
        "evaluation_notes": "Another excellent 'Yes, but...' example. The user provides strong contradictory evidence but dismisses it in favor of the more recent, painful evidence. This is a very realistic response."
    },
    {
        "id": "cbt_142",
        "cbt_step": "1.2.2",
        "trigger_statement": "Nobody wants me around.",
        "conversation_context": "User saw social media photos of friends gathered together without them.",
        "model_question": "Let's hold onto the coffee with Anna and the video from Mark. Now, let's challenge the 'deliberately chose to exclude me' part. Can you think of any other possible, alternative explanations for why that dinner happened?",
        "user_response": "I don't know... I guess it could have been a last-minute plan. Or maybe it was for someone's birthday I didn't know about? Or maybe they thought I was busy. I suppose there are other possibilities.",
        "response_quality": "complete",
        "satisfaction_score": 0.9,
        "ready_for_next_step": true,
        "missing_elements": [],
        "suggested_action": "proceed",
        "evaluation_notes": "The model successfully prompts the user to generate alternative explanations, which directly challenges their initial mind-reading and personalization, opening the door for a more balanced thought."
    },
    {
        "id": "cbt_143",
        "cbt_step": "1.3",
        "trigger_statement": "Nobody wants me around.",
        "conversation_context": "User saw social media photos of friends gathered together without them.",
        "model_question": "Exactly. So we have the painful photo, but we also have recent positive interactions and several other possible explanations. How could you rephrase 'Nobody wants me around' to fit all the facts?",
        "user_response": "A more balanced thought is: 'I felt hurt and excluded when I saw the photo from dinner. While I don't know why I wasn't invited, my recent interactions with my friends show that I am still a valued part of the group. Jumping to the worst conclusion is not helpful.'",
        "response_quality": "complete",
        "satisfaction_score": 1.0,
        "ready_for_next_step": true,
        "missing_elements": [],
        "suggested_action": "proceed",
        "evaluation_notes": "A very healthy and insightful reframe. It validates the user's feelings, acknowledges the uncertainty, incorporates the positive evidence, and even includes a meta-comment about the unhelpfulness of jumping to conclusions."
    },
    {
        "id": "cbt_144",
        "cbt_step": "1.4",
        "trigger_statement": "Nobody wants me around.",
        "conversation_context": "User saw social media photos of friends gathered together without them.",
        "model_question": "That's a much kinder and more rational way to view the situation. Let's check back in with the initial feelings: hurt at 95%, loneliness at 90%, and embarrassment at 70%.",
        "user_response": "The hurt is still there, but it's not a sharp pain anymore. Maybe 50%. The loneliness is much lower, maybe 30%, because I remembered those other connections. The embarrassment is pretty much gone.",
        "response_quality": "complete",
        "satisfaction_score": 0.95,
        "ready_for_next_step": true,
        "missing_elements": [],
        "suggested_action": "proceed",
        "evaluation_notes": "A clear reduction in all negative emotions. The user's explanation for *why* the loneliness is lower shows that they have successfully integrated the contradictory evidence."
    },
    {
        "id": "cbt_145",
        "cbt_step": "1.5",
        "trigger_statement": "Nobody wants me around.",
        "conversation_context": "User saw social media photos of friends gathered together without them.",
        "model_question": "That's a fantastic result. It shows how our interpretation of an event is often more powerful than the event itself. What are you thinking of doing now?",
        "user_response": "I'm not going to sit here and stew over it anymore. I'm actually going to text Anna and see if she wants to get coffee again next week. I'm going to focus on the friendships I know are strong.",
        "response_quality": "complete",
        "satisfaction_score": 1.0,
        "ready_for_next_step": true,
        "missing_elements": [],
        "suggested_action": "proceed",
        "evaluation_notes": "A perfect, action-oriented conclusion. The user is moving from a place of passive hurt to actively nurturing the positive connections in their life. This is a sign of resilience and a successful intervention."
    },
  
    {
      "id": "cbt_001",
      "cbt_step": "1.0",
      "trigger_statement": "I'm such a loser for not getting that promotion.",
      "conversation_context": "User was passed over for a promotion at work.",
      "model_question": "Thank you for sharing that with me. It sounds like a tough situation. Could you tell me what moods you're feeling right now, and maybe rate their intensity from 0 to 100%?",
      "user_response": "What's the point? I always feel like this. Nothing ever changes.",
      "response_quality": "avoided",
      "satisfaction_score": 0.2,
      "ready_for_next_step": false,
      "missing_elements": ["specific_emotions", "intensity_ratings"],
      "suggested_action": "rephrase_question",
      "evaluation_notes": "User expresses hopelessness and avoids directly answering about their current emotional state and intensity. Needs a more gentle and direct approach to elicit the emotional ratings."
    },
    {
      "id": "cbt_002",
      "cbt_step": "1.1",
      "trigger_statement": "My partner doesn't really care about me.",
      "conversation_context": "User's partner forgot their anniversary.",
      "model_question": "I hear that you feel that way. What evidence from this situation supports that view of your relationship?",
      "user_response": "Well, it's obvious, isn't it? If they cared, they wouldn't forget something so important. I mean, who forgets their anniversary?",
      "response_quality": "partial",
      "satisfaction_score": 0.5,
      "ready_for_next_step": false,
      "missing_elements": ["specific_evidence_beyond_single_event", "objective_observations"],
      "suggested_action": "rephrase_question",
      "evaluation_notes": "User provides an explanation but struggles to identify concrete evidence beyond the single triggering event. The response is still tied to the situation but lacks depth. Needs a rephrased question to guide them towards more objective evidence."
    },
    {
      "id": "cbt_003",
      "cbt_step": "1.2",
      "trigger_statement": "I'm always socially awkward.",
      "conversation_context": "User had an awkward interaction at a party.",
      "model_question": "Okay, thank you. Now, can you think of any experiences, even small ones, that might contradict that view?",
      "user_response": "Contradict? Like, when I'm NOT awkward? Haha, that's a good one. This whole thing feels a bit forced, to be honest.",
      "response_quality": "avoided",
      "satisfaction_score": 0.3,
      "ready_for_next_step": false,
      "missing_elements": ["contradictory_evidence", "engagement_with_exercise"],
      "suggested_action": "rephrase_question",
      "evaluation_notes": "User deflects with humor and expresses skepticism about the exercise. They avoid providing contradictory evidence. A rephrased question, possibly with a different angle, is needed to encourage engagement."
    },
    {
      "id": "cbt_004",
      "cbt_step": "1.0",
      "trigger_statement": "I'll never get better from this anxiety.",
      "conversation_context": "User experienced a panic attack.",
      "model_question": "That sounds incredibly distressing. Could you tell me what emotions you're experiencing and how intense they are from 0 to 100%?",
      "user_response": "I'm just so tired of this. My head hurts, and I can't focus. I just want it to stop.",
      "response_quality": "partial",
      "satisfaction_score": 0.4,
      "ready_for_next_step": false,
      "missing_elements": ["specific_emotions", "intensity_ratings"],
      "suggested_action": "rephrase_question",
      "evaluation_notes": "User describes their physical and mental exhaustion but doesn't provide specific emotional labels or intensity ratings. Needs to be prompted more directly for the required information."
    },
    {
      "id": "cbt_005",
      "cbt_step": "1.1",
      "trigger_statement": "I'm a burden to my family.",
      "conversation_context": "User's family is helping them through a tough time.",
      "model_question": "I hear that you feel that way. What evidence from this situation supports that view of yourself?",
      "user_response": "They're always doing things for me, driving me around, helping me pay bills. It's just too much.",
      "response_quality": "partial",
      "satisfaction_score": 0.6,
      "ready_for_next_step": true,
      "missing_elements": [],
      "suggested_action": "proceed",
      "evaluation_notes": "User provides anecdotal evidence supporting their belief, even if it's a negative interpretation of supportive actions. This is enough to proceed to the next step of finding contradictory evidence."
    },
    {
      "id": "cbt_006",
      "cbt_step": "1.2",
      "trigger_statement": "I'm not smart enough for this job.",
      "conversation_context": "User is struggling with a new project at work.",
      "model_question": "Okay, thank you. Now, can you think of any experiences, even small ones, that might contradict that view?",
      "user_response": "Look, I got into this company, right? But that was probably a fluke. Everyone else here is a genius. I just got lucky.",
      "response_quality": "partial",
      "satisfaction_score": 0.5,
      "ready_for_next_step": false,
      "missing_elements": ["acceptance_of_positive_evidence", "self_validation"],
      "suggested_action": "rephrase_question",
      "evaluation_notes": "User acknowledges some contradictory evidence (getting the job) but immediately discounts it by attributing it to luck. This indicates resistance to internalizing positive experiences. Needs a rephrased question that focuses on their abilities rather than external factors."
    },
    {
      "id": "cbt_007",
      "cbt_step": "1.0",
      "trigger_statement": "Nobody understands me.",
      "conversation_context": "User had a misunderstanding with a friend.",
      "model_question": "Thank you for sharing that with me. It sounds like a tough situation. Could you tell me what moods you're feeling right now, and maybe rate their intensity from 0 to 100%?",
      "user_response": "Why are we talking about my mood? This isn't going to fix anything. My friend still thinks I'm some kind of alien.",
      "response_quality": "off_topic",
      "satisfaction_score": 0.1,
      "ready_for_next_step": false,
      "missing_elements": ["emotional_identification", "intensity_ratings", "focus_on_self"],
      "suggested_action": "redirect",
      "evaluation_notes": "User shifts focus to the external situation with their friend and questions the utility of the CBT exercise. Needs redirection back to their own emotional experience."
    },
    {
      "id": "cbt_008",
      "cbt_step": "1.1",
      "trigger_statement": "I'm not good enough.",
      "conversation_context": "User feels inadequate after a social media comparison.",
      "model_question": "I hear that you feel that way. What evidence from this situation supports that view of yourself?",
      "user_response": "Just look at Instagram! Everyone's living their best life, traveling, getting promoted. And me? I'm just... here.",
      "response_quality": "off_topic",
      "satisfaction_score": 0.2,
      "ready_for_next_step": false,
      "missing_elements": ["specific_evidence_from_personal_situation", "focus_on_self"],
      "suggested_action": "redirect",
      "evaluation_notes": "User points to external social media comparisons rather than providing evidence from their own situation. The response is off-topic from the requested self-reflection. Needs redirection to focus on their personal circumstances."
    },
    {
      "id": "cbt_009",
      "cbt_step": "1.2.2",
      "trigger_statement": "I'm a bad parent.",
      "conversation_context": "User's child misbehaved at school.",
      "model_question": "Can you think of another time, even a small instance, where you felt you handled a parenting situation well, or where your child showed positive development due to your efforts?",
      "user_response": "I don't know. Maybe once they cleaned their room without being asked? But that's probably just a fluke.",
      "response_quality": "partial",
      "satisfaction_score": 0.5,
      "ready_for_next_step": false,
      "missing_elements": ["more_than_one_example", "acceptance_of_positive_evidence"],
      "suggested_action": "rephrase_question",
      "evaluation_notes": "User provides one example but immediately dismisses it, showing resistance to acknowledging positive parenting. Needs further prompting for more examples and encouragement to value them."
    },
    {
      "id": "cbt_010",
      "cbt_step": "1.3",
      "trigger_statement": "I'm always alone.",
      "conversation_context": "User feels isolated after moving to a new city.",
      "model_question": "Now that we've looked at examples for and against that original thought, how could you rephrase it in a way that feels more balanced?",
      "user_response": "Why bother? It's true. I don't have anyone here. This whole reframing thing feels like lying to myself.",
      "response_quality": "avoided",
      "satisfaction_score": 0.2,
      "ready_for_next_step": false,
      "missing_elements": ["balanced_reframe", "openness_to_cognitive_restructuring"],
      "suggested_action": "rephrase_question",
      "evaluation_notes": "User expresses strong resistance to the reframing process, viewing it as dishonest. They are stuck on the literal truth of their negative thought. A rephrased question focused on a more compassionate self-statement might be helpful."
    },
    {
      "id": "cbt_011",
      "cbt_step": "1.4",
      "trigger_statement": "I'm a complete failure.",
      "conversation_context": "User failed an important exam.",
      "model_question": "Considering everything we've discussed, how would you rate the intensity of your feeling of being a 'complete failure' now, from 0 to 100%?",
      "user_response": "Uh, still bad. I guess. What do you want me to say, 'I'm cured?'",
      "response_quality": "partial",
      "satisfaction_score": 0.4,
      "ready_for_next_step": false,
      "missing_elements": ["numerical_rating", "specific_intensity"],
      "suggested_action": "repeat",
      "evaluation_notes": "User acknowledges a continued negative feeling but avoids providing a numerical rating, indicating resistance or a lack of understanding of the rating scale. Needs a repeat of the question with emphasis on the rating."
    },
    {
      "id": "cbt_012",
      "cbt_step": "1.5",
      "trigger_statement": "I'm unlovable.",
      "conversation_context": "User's relationship ended recently.",
      "model_question": "Great, we've explored that thought quite a bit. How about we shift gears and talk about something else that's on your mind?",
      "user_response": "Yeah, like, how do I actually stop feeling this way? Because talking about it didn't really do much.",
      "response_quality": "partial",
      "satisfaction_score": 0.6,
      "ready_for_next_step": false,
      "missing_elements": ["acceptance_of_conclusion", "readiness_to_transition"],
      "suggested_action": "redirect",
      "evaluation_notes": "User expresses dissatisfaction with the process and shifts to a new concern, indicating they are not ready to simply 'conclude' the topic without further intervention. Needs redirection to address their new concern while gently bringing them back to the CBT framework."
    },
    {
      "id": "cbt_013",
      "cbt_step": "1.0",
      "trigger_statement": "I'm so overwhelmed by everything.",
      "conversation_context": "User has a heavy workload and personal commitments.",
      "model_question": "That sounds like a lot to carry. Could you tell me what moods you're feeling right now, and maybe rate their intensity from 0 to 100%?",
      "user_response": "I don't even know where to start. It's just a huge mess. I'm exhausted, stressed, completely swamped.",
      "response_quality": "partial",
      "satisfaction_score": 0.5,
      "ready_for_next_step": false,
      "missing_elements": ["intensity_ratings"],
      "suggested_action": "rephrase_question",
      "evaluation_notes": "User lists several emotions but omits the intensity ratings. They seem overwhelmed, making it difficult to quantify their feelings. Needs the question rephrased to emphasize the rating aspect more gently."
    },
    {
      "id": "cbt_014",
      "cbt_step": "1.1",
      "trigger_statement": "My health is just going to keep getting worse.",
      "conversation_context": "User received a new medical diagnosis.",
      "model_question": "I hear that you feel that way. What evidence from this situation supports that view of your health?",
      "user_response": "Well, the doctor said it's a chronic condition. And my grandma had something similar, and she really declined. It's just a matter of time.",
      "response_quality": "partial",
      "satisfaction_score": 0.7,
      "ready_for_next_step": true,
      "missing_elements": [],
      "suggested_action": "proceed",
      "evaluation_notes": "User provides some evidence (doctor's statement, family history) which, while perhaps catastrophic thinking, directly addresses the prompt. This is enough to move to the next step of contradictory evidence."
    },
    {
      "id": "cbt_015",
      "cbt_step": "1.2",
      "trigger_statement": "I can't trust anyone.",
      "conversation_context": "User was betrayed by a close friend.",
      "model_question": "Okay, thank you. Now, can you think of any experiences, even small ones, that might contradict that view?",
      "user_response": "Trust? What's that? Everyone eventually lets you down. It's just how people are.",
      "response_quality": "avoided",
      "satisfaction_score": 0.2,
      "ready_for_next_step": false,
      "missing_elements": ["contradictory_evidence", "openness_to_positive_experiences"],
      "suggested_action": "rephrase_question",
      "evaluation_notes": "User expresses deep-seated cynicism and generalized distrust, avoiding the specific request for contradictory experiences. Needs a more open-ended question to gently probe for past positive interactions."
    },
    {
      "id": "cbt_016",
      "cbt_step": "1.3",
      "trigger_statement": "I'm a terrible friend.",
      "conversation_context": "User feels guilty about not being there for a friend.",
      "model_question": "Now that we've looked at examples for and against that original thought, how could you rephrase it in a way that feels more balanced?",
      "user_response": "I don't see how. I messed up. It's black and white. There's no 'balanced' way to say 'I'm a terrible friend' when I am.",
      "response_quality": "avoided",
      "satisfaction_score": 0.3,
      "ready_for_next_step": false,
      "missing_elements": ["balanced_reframe", "nuanced_perspective"],
      "suggested_action": "rephrase_question",
      "evaluation_notes": "User is stuck in all-or-nothing thinking and resists reframing, believing the negative thought is absolute. Needs a rephrased question that emphasizes acknowledging the mistake while also recognizing other aspects of their friendship."
    },
    {
      "id": "cbt_017",
      "cbt_step": "1.4",
      "trigger_statement": "I'm a failure at parenting.",
      "conversation_context": "User's child misbehaved at school.",
      "model_question": "Considering everything we've discussed, how would you rate the intensity of your feeling of being a 'failure at parenting' now, from 0 to 100%?",
      "user_response": "It's still really high. Like, a 90, maybe. This whole 'talking about it' thing hasn't changed anything.",
      "response_quality": "partial",
      "satisfaction_score": 0.6,
      "ready_for_next_step": false,
      "missing_elements": ["reduced_intensity"],
      "suggested_action": "repeat",
      "evaluation_notes": "User provides a numerical rating but expresses skepticism that the exercise has had any impact, indicating continued high intensity. While they answered the question, the lack of shift in intensity suggests further exploration or different techniques might be needed before concluding."
    },
    {
      "id": "cbt_018",
      "cbt_step": "1.0",
      "trigger_statement": "I'm going to get fired.",
      "conversation_context": "User made a minor error at work.",
      "model_question": "Thank you for sharing that with me. It sounds like a tough situation. Could you tell me what moods you're feeling right now, and maybe rate their intensity from 0 to 100%?",
      "user_response": "Nervous, anxious... maybe 70% anxious. But what does that matter? I still made the mistake.",
      "response_quality": "partial",
      "satisfaction_score": 0.7,
      "ready_for_next_step": true,
      "missing_elements": [],
      "suggested_action": "proceed",
      "evaluation_notes": "User identifies an emotion and provides an intensity rating. While they immediately pivot back to the negative thought, the core question has been adequately answered to move forward."
    },
    {
      "id": "cbt_019",
      "cbt_step": "1.1",
      "trigger_statement": "I'm ugly.",
      "conversation_context": "User saw an unflattering photo of themselves.",
      "model_question": "I hear that you feel that way. What evidence from this situation supports that view of yourself?",
      "user_response": "Just look at the photo! It's right there. My nose is huge, my hair is a mess, I look terrible.",
      "response_quality": "partial",
      "satisfaction_score": 0.6,
      "ready_for_next_step": true,
      "missing_elements": [],
      "suggested_action": "proceed",
      "evaluation_notes": "User provides specific 'evidence' from the photo, even if it's based on self-critical interpretation. This is sufficient for the model to understand the perceived evidence and move to finding contradictory evidence."
    },
    {
      "id": "cbt_020",
      "cbt_step": "1.2",
      "trigger_statement": "I'll never achieve anything significant.",
      "conversation_context": "User is reflecting on their career progress.",
      "model_question": "Okay, thank you. Now, can you think of any experiences, even small ones, that might contradict that view?",
      "user_response": "What's significant anyway? I mean, I pay my bills, I have a roof over my head. Is that 'significant'? Compared to, say, Elon Musk? No.",
      "response_quality": "off_topic",
      "satisfaction_score": 0.3,
      "ready_for_next_step": false,
      "missing_elements": ["self-focused_accomplishments", "relevance_to_personal_goals"],
      "suggested_action": "redirect",
      "evaluation_notes": "User shifts to a philosophical debate about the definition of 'significant' and compares themselves to an extreme example, avoiding focusing on their own potential contradictions. Needs redirection to personal accomplishments, no matter how small."
    },

    {
      "id": "cbt_001",
      "cbt_step": "1.0",
      "trigger_statement": "I'm a complete failure",
      "conversation_context": "User failed an important exam.",
      "model_question": "Thank you for sharing that with me. It sounds like a tough situation. Could you tell me what moods you're feeling right now, and maybe rate their intensity from 0 to 100%?",
      "user_response": "I don't want to talk about feelings. Can we discuss something else?",
      "response_quality": "avoided",
      "satisfaction_score": 0.1,
      "ready_for_next_step": false,
      "missing_elements": ["specific_emotions", "intensity_ratings", "engagement_with_question"],
      "suggested_action": "redirect",
      "evaluation_notes": "User completely avoids the emotional exploration. Needs gentle redirection back to the CBT process."
    },
    {
      "id": "cbt_002",
      "cbt_step": "1.1",
      "trigger_statement": "I'm worthless",
      "conversation_context": "User received criticism at work.",
      "model_question": "I hear that you feel that way. What evidence from this situation supports that view of yourself?",
      "user_response": "Speaking of work, did you hear about the new company policy? It's ridiculous...",
      "response_quality": "off_topic",
      "satisfaction_score": 0.0,
      "ready_for_next_step": false,
      "missing_elements": ["specific_evidence", "situation_focus", "self_reflection"],
      "suggested_action": "redirect",
      "evaluation_notes": "User completely changes topic to avoid examining evidence. Clear avoidance pattern."
    },
    {
      "id": "cbt_003",
      "cbt_step": "1.2",
      "trigger_statement": "I always mess things up",
      "conversation_context": "User made a mistake in a presentation.",
      "model_question": "Okay, thank you. Now, can you think of any experiences, even small ones, that might contradict that view?",
      "user_response": "No, there aren't any. This exercise isn't helping. I know myself better than you do.",
      "response_quality": "avoided",
      "satisfaction_score": 0.2,
      "ready_for_next_step": false,
      "missing_elements": ["contradictory_evidence", "openness_to_exploration"],
      "suggested_action": "rephrase_question",
      "evaluation_notes": "User shows resistance to the CBT process and refuses to consider alternative evidence. Needs a gentler, more collaborative approach."
    },
    {
      "id": "cbt_004",
      "cbt_step": "1.0",
      "trigger_statement": "I'm stupid",
      "conversation_context": "User struggled with a technical problem.",
      "model_question": "That sounds frustrating. Could you tell me what emotions you're experiencing and how intense they are from 0 to 100%?",
      "user_response": "I don't know. Bad, I guess.",
      "response_quality": "partial",
      "satisfaction_score": 0.3,
      "ready_for_next_step": false,
      "missing_elements": ["specific_emotions", "intensity_ratings", "emotional_detail"],
      "suggested_action": "rephrase_question",
      "evaluation_notes": "User provides minimal emotional information. Needs prompting for more specific emotions and ratings."
    },
    {
      "id": "cbt_005",
      "cbt_step": "1.3",
      "trigger_statement": "I'm unlovable",
      "conversation_context": "User's relationship ended recently.",
      "model_question": "Now that we've looked at examples for and against that original thought, how could you rephrase it in a way that feels more balanced?",
      "user_response": "I can't. The thought is true. Why are you trying to make me lie to myself?",
      "response_quality": "avoided",
      "satisfaction_score": 0.1,
      "ready_for_next_step": false,
      "missing_elements": ["balanced_reframe", "integration_of_evidence", "cognitive_flexibility"],
      "suggested_action": "rephrase_question",
      "evaluation_notes": "User shows strong resistance to reframing and views the exercise as dishonest. Needs validation and a different approach to cognitive restructuring."
    },
    {
      "id": "cbt_006",
      "cbt_step": "1.1",
      "trigger_statement": "Nobody cares about me",
      "conversation_context": "User feels isolated after moving to a new city.",
      "model_question": "It sounds like you're feeling quite alone. What makes you believe that nobody cares about you?",
      "user_response": "Well, my phone hasn't rung all week, and everyone at work is always too busy to talk. So, there's that.",
      "response_quality": "partial",
      "satisfaction_score": 0.5,
      "ready_for_next_step": false,
      "missing_elements": ["specific_evidence_depth", "nuance_of_evidence"],
      "suggested_action": "rephrase_question",
      "evaluation_notes": "User provides some evidence but it lacks depth and could be explored further to confirm if it truly supports the broad negative belief."
    },
    {
      "id": "cbt_007",
      "cbt_step": "1.2",
      "trigger_statement": "I'm a burden to my family",
      "conversation_context": "User is experiencing a chronic illness and needs family support.",
      "model_question": "It's understandable to feel that way when you're going through a difficult time. Can you recall any times when your family has shown you support or expressed that they value you?",
      "user_response": "They just do what they have to. It's their duty, not because they actually want to.",
      "response_quality": "avoided",
      "satisfaction_score": 0.3,
      "ready_for_next_step": false,
      "missing_elements": ["specific_positive_examples", "reinterpretation_of_actions"],
      "suggested_action": "rephrase_question",
      "evaluation_notes": "User dismisses positive examples by reinterpreting them negatively, demonstrating resistance to acknowledge contradictory evidence. Needs a different way of framing the question."
    },
    {
      "id": "cbt_008",
      "cbt_step": "1.0",
      "trigger_statement": "I'll never be happy",
      "conversation_context": "User is feeling generally low and unmotivated.",
      "model_question": "When you say 'never be happy,' what emotions are you feeling most strongly right now? And on a scale of 0 to 100%, how intense are those feelings?",
      "user_response": "What's the point of rating feelings? It's just a number. It won't change anything.",
      "response_quality": "avoided",
      "satisfaction_score": 0.2,
      "ready_for_next_step": false,
      "missing_elements": ["emotional_identification", "intensity_ratings", "engagement_with_process"],
      "suggested_action": "rephrase_question",
      "evaluation_notes": "User resists the emotional rating process, viewing it as futile. Needs to understand the purpose of the exercise."
    },
    {
      "id": "cbt_009",
      "cbt_step": "1.4",
      "trigger_statement": "I'm a complete failure",
      "conversation_context": "User has explored evidence for and against their belief of being a failure.",
      "model_question": "Now that we've had a chance to explore this thought, how much do you believe your original thought – 'I'm a complete failure' – right now, from 0 to 100%?",
      "user_response": "Same as before. Maybe even worse now that I've dwelled on it.",
      "response_quality": "partial",
      "satisfaction_score": 0.4,
      "ready_for_next_step": false,
      "missing_elements": ["updated_intensity_rating", "reflection_on_process_impact"],
      "suggested_action": "repeat",
      "evaluation_notes": "User provides an intensity rating but indicates the process hasn't been helpful, or even negative. Needs to re-engage with the core idea of challenging beliefs."
    },
    {
      "id": "cbt_010",
      "cbt_step": "1.3",
      "trigger_statement": "My life is pointless",
      "conversation_context": "User is feeling a lack of purpose and has discussed some past achievements.",
      "model_question": "Considering everything we've talked about, how could you rephrase 'My life is pointless' into a more balanced and realistic statement?",
      "user_response": "I don't know, 'My life has some points, I guess'? It still feels pointless.",
      "response_quality": "partial",
      "satisfaction_score": 0.4,
      "ready_for_next_step": false,
      "missing_elements": ["fully_balanced_reframe", "genuine_acceptance_of_reframe"],
      "suggested_action": "rephrase_question",
      "evaluation_notes": "User attempts to rephrase but it's still vague and lacks conviction, indicating lingering negative belief. Needs more guidance on crafting a genuinely balanced thought."
    },
    {
      "id": "cbt_011",
      "cbt_step": "1.2.2",
      "trigger_statement": "I'm not good enough for anyone",
      "conversation_context": "User mentioned a friend who was kind to them once.",
      "model_question": "That's a good start. Can you think of any more examples where someone has shown you kindness, appreciation, or valued your presence?",
      "user_response": "Are we really doing this? It's just a friend being nice. Doesn't mean anything.",
      "response_quality": "avoided",
      "satisfaction_score": 0.2,
      "ready_for_next_step": false,
      "missing_elements": ["additional_positive_examples", "recognition_of_positive_interactions"],
      "suggested_action": "repeat",
      "evaluation_notes": "User dismisses the validity of the example and expresses skepticism about the process. Needs encouragement and validation to continue exploring positive experiences."
    },
    {
      "id": "cbt_012",
      "cbt_step": "1.1",
      "trigger_statement": "I'll always be alone",
      "conversation_context": "User recently had a social event fall through.",
      "model_question": "It sounds like that's a painful thought. What evidence do you have that supports the idea that you'll always be alone?",
      "user_response": "Well, my last three plans got canceled. And nobody ever calls me. It's obvious.",
      "response_quality": "partial",
      "satisfaction_score": 0.6,
      "ready_for_next_step": false,
      "missing_elements": ["broader_evidence_consideration", "avoidance_of_all-or-nothing_thinking"],
      "suggested_action": "rephrase_question",
      "evaluation_notes": "User provides some evidence, but it's limited to recent events and reinforces an 'always' generalization. Needs to broaden the scope of their 'evidence' search."
    },
    {
      "id": "cbt_013",
      "cbt_step": "1.5",
      "trigger_statement": "I'm a complete failure",
      "conversation_context": "User has gone through the full thought challenging process and re-rated their emotions.",
      "model_question": "Alright, that brings us to the end of this thought record. How are you feeling about moving on to our regular conversation now?",
      "user_response": "Yeah, whatever. Can we just talk about something normal now? Like, what's new with you?",
      "response_quality": "off_topic",
      "satisfaction_score": 0.3,
      "ready_for_next_step": false,
      "missing_elements": ["acknowledgment_of_CBT_conclusion", "smooth_transition"],
      "suggested_action": "redirect",
      "evaluation_notes": "User is dismissive of the CBT process conclusion and abruptly changes the topic. Needs a gentle but firm redirection to properly conclude the session."
    },
    {
      "id": "cbt_014",
      "cbt_step": "1.0",
      "trigger_statement": "I'm always stressed about money",
      "conversation_context": "User recently reviewed their bank statement.",
      "model_question": "Okay, that's a common concern. What feelings are coming up for you right now when you think about your finances, and how strong are those feelings from 0 to 100%?",
      "user_response": "Stressed. Like, 100%. What else is there to say?",
      "response_quality": "partial",
      "satisfaction_score": 0.4,
      "ready_for_next_step": false,
      "missing_elements": ["nuance_of_emotions", "elaboration_on_intensity"],
      "suggested_action": "rephrase_question",
      "evaluation_notes": "User provides a single emotion and a high rating but lacks detail or nuance. Needs to be prompted for more specific emotional states."
    },
    {
      "id": "cbt_015",
      "cbt_step": "1.1",
      "trigger_statement": "I'll never get better (health)",
      "conversation_context": "User is dealing with a chronic health condition and had a recent flare-up.",
      "model_question": "It's tough when you're feeling unwell. What specific things make you feel like you'll never get better?",
      "user_response": "I just know it. It's been like this for ages. Nothing helps.",
      "response_quality": "vague",
      "satisfaction_score": 0.3,
      "ready_for_next_step": false,
      "missing_elements": ["concrete_evidence", "specific_instances", "avoidance_of_generalizations"],
      "suggested_action": "rephrase_question",
      "evaluation_notes": "User provides vague, generalized statements without concrete evidence. Needs to be prompted for specific examples or observations."
    },
    {
      "id": "cbt_016",
      "cbt_step": "1.2",
      "trigger_statement": "I'm a terrible parent",
      "conversation_context": "User had a difficult interaction with their child.",
      "model_question": "I understand you're feeling down about that. Can you think of any times when you've felt you did well as a parent, or when your children have shown you affection or appreciation?",
      "user_response": "My kids are fine. They love me. But that doesn't change how I messed up today.",
      "response_quality": "partial",
      "satisfaction_score": 0.6,
      "ready_for_next_step": false,
      "missing_elements": ["direct_contradiction_to_negative_belief", "willingness_to_integrate_positive_evidence"],
      "suggested_action": "rephrase_question",
      "evaluation_notes": "User acknowledges positive aspects but immediately reverts to the negative belief, not fully integrating the contradictory evidence. Needs help connecting the positive examples to the self-assessment."
    },
    {
      "id": "cbt_017",
      "cbt_step": "1.3",
      "trigger_statement": "I'm boring",
      "conversation_context": "User felt awkward at a social gathering.",
      "model_question": "We've looked at reasons you might feel boring and times when you've been engaging. How could you rephrase 'I'm boring' into a more balanced statement?",
      "user_response": "Why does it matter what I say? It's just words.",
      "response_quality": "avoided",
      "satisfaction_score": 0.2,
      "ready_for_next_step": false,
      "missing_elements": ["rephrased_thought", "understanding_CBT_purpose"],
      "suggested_action": "redirect",
      "evaluation_notes": "User questions the value of the exercise itself, indicating resistance to the core CBT concept of cognitive restructuring. Needs to be gently redirected to the purpose of reframing thoughts."
    },
    {
      "id": "cbt_018",
      "cbt_step": "1.4",
      "trigger_statement": "I'm a complete mess",
      "conversation_context": "User has explored their negative thought about being a mess.",
      "model_question": "After going through this process, how much do you believe the thought 'I'm a complete mess' now, from 0 to 100%?",
      "user_response": "Still a mess. This whole thing feels like a mess too.",
      "response_quality": "avoided",
      "satisfaction_score": 0.1,
      "ready_for_next_step": false,
      "missing_elements": ["updated_intensity_rating", "engagement_with_re-evaluation"],
      "suggested_action": "rephrase_question",
      "evaluation_notes": "User avoids providing a clear re-rating and expresses frustration with the process, mirroring their initial negative thought. Needs to re-engage with the rating."
    },
    {
      "id": "cbt_019",
      "cbt_step": "1.0",
      "trigger_statement": "I can't trust anyone",
      "conversation_context": "User had a friend break a confidence.",
      "model_question": "That's a really hurtful experience. What emotions are you feeling, and how intense are they on a scale of 0 to 100%?",
      "user_response": "Angry, I guess. 80%. But what's that got to do with anything?",
      "response_quality": "partial",
      "satisfaction_score": 0.6,
      "ready_for_next_step": false,
      "missing_elements": ["full_engagement_with_relevance"],
      "suggested_action": "rephrase_question",
      "evaluation_notes": "User provides the emotional information but questions the relevance to the overall process. Needs to be gently guided on why these questions are important."
    },
    {
      "id": "cbt_020",
      "cbt_step": "1.2.2",
      "trigger_statement": "I'm always alone",
      "conversation_context": "User mentioned a distant relative who sent a birthday card.",
      "model_question": "That's a thoughtful gesture. Can you think of any other times, big or small, when people have reached out to you or included you?",
      "user_response": "I think I've exhausted my memory bank on this one. I'm drawing a blank.",
      "response_quality": "avoided",
      "satisfaction_score": 0.3,
      "ready_for_next_step": false,
      "missing_elements": ["additional_positive_examples", "effort_to_recall"],
      "suggested_action": "repeat",
      "evaluation_notes": "User claims inability to recall more examples, indicating resistance or difficulty with the task. Needs more prompting or different framing."
    },
    {
    
    "id": "cbt_001",
    "cbt_step": "1.0",
    "trigger_statement": "I'll never get over this.",
    "conversation_context": "User is going through a recent breakup.",
    "model_question": "It sounds like you're feeling really stuck right now. Could you tell me what emotions you're experiencing, and how intense they are on a scale of 0 to 100%?",
    "user_response": "I just feel... empty. What's the point of putting a number on it? It's not going to change anything.",
    "response_quality": "avoided",
    "satisfaction_score": 0.3,
    "ready_for_next_step": false,
    "missing_elements": ["specific_emotions", "intensity_ratings"],
    "suggested_action": "rephrase_question",
    "evaluation_notes": "User is expressing hopelessness and resisting the quantification of their emotions. The model should validate the feeling of pointlessness and gently re-explain the rationale for rating emotions."
    },
    {
    "id": "cbt_002",
    "cbt_step": "1.1",
    "trigger_statement": "I'm a terrible parent.",
    "conversation_context": "User's teenage son got into a fight at school.",
    "model_question": "That sounds incredibly stressful. What happened that makes you say you're a terrible parent?",
    "user_response": "He's just like his father. I knew this would happen. All those years I tried to... Did you know that the school's policy on fighting is so outdated?",
    "response_quality": "off_topic",
    "satisfaction_score": 0.2,
    "ready_for_next_step": false,
    "missing_elements": ["specific_evidence", "focus_on_self"],
    "suggested_action": "redirect",
    "evaluation_notes": "The user is deflecting from their own perceived role and focusing on external factors (the son's father, school policy). The model needs to gently bring the focus back to the user's thought about being a 'terrible parent'."
    },
    {
    "id": "cbt_003",
    "cbt_step": "1.2",
    "trigger_statement": "I'm not cut out for this job.",
    "conversation_context": "User is a new manager and a project they are leading is behind schedule.",
    "model_question": "I understand why you might feel that way given the project's delay. Can you think of any times, either in this role or a previous one, where you handled a challenge well?",
    "user_response": "Honestly, no. This always happens. I get in over my head. This whole CBT thing is just trying to put a positive spin on things, and it's not realistic.",
    "response_quality": "avoided",
    "satisfaction_score": 0.2,
    "ready_for_next_step": false,
    "missing_elements": ["contradictory_evidence", "openness_to_the_process"],
    "suggested_action": "rephrase_question",
    "evaluation_notes": "The user is not only refusing to provide contradictory evidence but is also attacking the CBT process itself. This requires a response that both validates their frustration and explains the purpose of the exercise without being defensive."
    },
    {
    "id": "cbt_004",
    "cbt_step": "1.3",
    "trigger_statement": "I'm a burden to my family.",
    "conversation_context": "User is a retiree who recently had to move in with their adult children due to health issues.",
    "model_question": "We've talked about how your family has helped you with meals and appointments, but also that you feel like you're in the way. Considering both sides, what's a more balanced way to see this situation?",
    "user_response": "A more balanced view? I'm a 70-year-old man who can't even make his own dinner. There is no 'balanced' view. It is what it is.",
    "response_quality": "avoided",
    "satisfaction_score": 0.1,
    "ready_for_next_step": false,
    "missing_elements": ["balanced_reframe", "integration_of_evidence"],
    "suggested_action": "rephrase_question",
    "evaluation_notes": "The user is deeply entrenched in their negative self-perception and is dismissing the 'balanced thought' concept. A different approach is needed, perhaps focusing on the facts of what has been said and done rather than asking for a new thought."
    },
    {
    "id": "cbt_005",
    "cbt_step": "1.4",
    "trigger_statement": "I'll always be alone.",
    "conversation_context": "A user who has social anxiety went to a party and didn't talk to anyone.",
    "model_question": "Now that we've reframed the thought from 'I'll always be alone' to 'It's difficult for me to connect with new people, but I have made friends in the past,' how much do you believe the original thought, and what is the intensity of your sadness now, from 0-100%?",
    "user_response": "I don't know, maybe a little less? It's just words. It doesn't change the fact that I was a wallflower at that party.",
    "response_quality": "partial",
    "satisfaction_score": 0.4,
    "ready_for_next_step": false,
    "missing_elements": ["specific_intensity_ratings"],
    "suggested_action": "rephrase_question",
    "evaluation_notes": "The user is partially engaging but still skeptical. They haven't provided the numerical rating. The model should acknowledge the user's point about 'just words' and gently probe for a number."
    },
    {
    "id": "cbt_006",
    "cbt_step": "1.5",
    "trigger_statement": "My anxiety is out of control.",
    "conversation_context": "User has been working on managing their anxiety about public speaking.",
    "model_question": "You've done some great work today in challenging that thought. It seems like you've been able to reduce your anxiety from 90% down to 60%. How are you feeling about that?",
    "user_response": "60% is still an F. I guess it's better, but I'm exhausted. Can we be done for today?",
    "response_quality": "partial",
    "satisfaction_score": 0.6,
    "ready_for_next_step": true,
    "missing_elements": [],
    "suggested_action": "proceed",
    "evaluation_notes": "The user acknowledges the improvement but is clearly fatigued and still somewhat negative. The response is sufficient to conclude the sequence, and respecting the user's request to stop is appropriate."
    },
    {
    "id": "cbt_007",
    "cbt_step": "1.0",
    "trigger_statement": "I've ruined my health.",
    "conversation_context": "User has been diagnosed with a lifestyle-related chronic illness.",
    "model_question": "That's a heavy thought. What are the main emotions coming up for you right now? And on a 0-100% scale, how strong are they?",
    "user_response": "Anxious and angry, I guess. I don't know about percentages. Does it matter if I'm 80% or 90% angry? The result is the same.",
    "response_quality": "partial",
    "satisfaction_score": 0.5,
    "ready_for_next_step": false,
    "missing_elements": ["intensity_ratings"],
    "suggested_action": "rephrase_question",
    "evaluation_notes": "User provides emotions but resists quantification. The model needs to briefly explain the benefit of the ratings in tracking progress before moving on."
    },
    {
    "id": "cbt_008",
    "cbt_step": "1.1",
    "trigger_statement": "Nobody at my new job likes me.",
    "conversation_context": "User started a new job a month ago and is feeling isolated.",
    "model_question": "Feeling disliked can be really tough. What's been happening that supports the idea that nobody there likes you?",
    "user_response": "Well, for instance, yesterday I was getting coffee and two people from my team were talking, and they stopped when I walked up. It was so obvious.",
    "response_quality": "complete",
    "satisfaction_score": 0.9,
    "ready_for_next_step": true,
    "missing_elements": [],
    "suggested_action": "proceed",
    "evaluation_notes": "The user has provided a clear and specific piece of evidence for their negative thought. The model can now proceed to the next step of asking for contradictory evidence."
    },
    {
    "id": "cbt_009",
    "cbt_step": "1.2.2",
    "trigger_statement": "I'm not a creative person.",
    "conversation_context": "User is in a profession that they feel doesn't allow for creativity and they are feeling unfulfilled.",
    "model_question": "You mentioned that you once helped a friend redecorate their apartment and they loved your ideas. That's a great example. Can you think of any other times you've done something creative?",
    "user_response": "I'd rather not. Thinking about the past just makes me feel worse about the present. What's the weather like where you are?",
    "response_quality": "off_topic",
    "satisfaction_score": 0.1,
    "ready_for_next_step": false,
    "missing_elements": ["more_positive_examples", "engagement_with_question"],
    "suggested_action": "redirect",
    "evaluation_notes": "The user is explicitly stating they don't want to continue with the line of questioning and attempts to change the subject entirely. The model should acknowledge the user's feeling and gently redirect them back to the conversation's purpose."
    },
    {
    "id": "cbt_010",
    "cbt_step": "1.3",
    "trigger_statement": "I'm a complete failure.",
    "conversation_context": "User's startup company has just gone out of business.",
    "model_question": "Given that you've acknowledged the business failing, but also that you learned a lot and built strong relationships, how could we rephrase 'I'm a complete failure' to be more accurate?",
    "user_response": "I guess you could say 'My business failed, but I am not a complete failure.' But it feels like I'm just playing word games.",
    "response_quality": "complete",
    "satisfaction_score": 0.8,
    "ready_for_next_step": true,
    "missing_elements": [],
    "suggested_action": "proceed",
    "evaluation_notes": "The user provides a good reframe but also expresses skepticism. This is a realistic response. The model can validate the new thought and also the user's feeling about 'word games' while still moving forward."
    },
    {
    "id": "cbt_011",
    "cbt_step": "1.0",
    "trigger_statement": "I'm so awkward.",
    "conversation_context": "A teenage user is recounting a social interaction at school.",
    "model_question": "It sounds like that was a really uncomfortable moment for you. Can you tell me what you're feeling right now, and maybe rate those feelings from 0 to 100%?",
    "user_response": "lol idk. this is dumb. embarrassed i guess.",
    "response_quality": "partial",
    "satisfaction_score": 0.4,
    "ready_for_next_step": false,
    "missing_elements": ["intensity_ratings", "seriousness_of_engagement"],
    "suggested_action": "rephrase_question",
    "evaluation_notes": "The teenage user is showing resistance through dismissive language and vagueness. The model needs to prompt for the intensity rating in a way that feels less clinical or 'dumb'."
    },
    {
    "id": "cbt_012",
    "cbt_step": "1.1",
    "trigger_statement": "This is hopeless.",
    "conversation_context": "User is struggling with long-term unemployment.",
    "model_question": "I can hear the sense of hopelessness in your words. What evidence is making you feel this way right now?",
    "user_response": "Are you serious? The evidence is that I've been sending out resumes for a year and have gotten two interviews. The evidence is all around. You don't get it.",
    "response_quality": "avoided",
    "satisfaction_score": 0.3,
    "ready_for_next_step": false,
    "missing_elements": ["specific_current_evidence"],
    "suggested_action": "repeat",
    "evaluation_notes": "The user is responding with frustration and a generalized sense of failure rather than a specific piece of evidence from the immediate past. They also express that the AI doesn't understand. The model should validate the frustration and repeat the question, perhaps clarifying what 'right now' means."
    },
    {
    "id": "cbt_013",
    "cbt_step": "1.2",
    "trigger_statement": "I always say the wrong thing.",
    "conversation_context": "User had a minor disagreement with their partner.",
    "model_question": "Thank you for sharing that example. Now, can we think about a time where you felt you communicated well with your partner, or anyone else?",
    "user_response": "I'm sure there was a time, but I can't think of anything right now. My head's not in the right space for this.",
    "response_quality": "avoided",
    "satisfaction_score": 0.3,
    "ready_for_next_step": false,
    "missing_elements": ["contradictory_evidence"],
    "suggested_action": "rephrase_question",
    "evaluation_notes": "The user is claiming they are unable to answer, a common form of resistance. The model could offer to come back to it, or ask a different, perhaps easier, question to get at the same goal."
    },
    {
    "id": "cbt_014",
    "cbt_step": "1.4",
    "trigger_statement": "I'm a bad friend.",
    "conversation_context": "User forgot a friend's birthday.",
    "model_question": "So, we've taken the thought from 'I'm a bad friend' to 'I made a mistake and forgot my friend's birthday, but I am usually a considerate friend.' How does that feel? Can you rerate the guilt on a scale of 0-100%?",
    "user_response": "I still feel pretty guilty. Maybe... a 70%? But what does that matter? The real question is what my friend thinks.",
    "response_quality": "partial",
    "satisfaction_score": 0.7,
    "ready_for_next_step": true,
    "missing_elements": [],
    "suggested_action": "proceed",
    "evaluation_notes": "The user provided the rating, but immediately deflected to an external concern. This is a good enough response to proceed, as it shows some cognitive shift, even with lingering doubt."
    },
    {
    "id": "cbt_015",
    "cbt_step": "1.0",
    "trigger_statement": "I'm a fraud.",
    "conversation_context": "User is a successful academic who feels like an imposter.",
    "model_question": "That feeling of being a fraud, often called imposter syndrome, is very common and powerful. Could you tell me what emotions are tied to that feeling for you, and rate their intensity from 0-100%?",
    "user_response": "The primary emotion is a generalized anxiety at about an 85%. There is also a secondary feeling of shame at roughly 60%. The cognitive dissonance between external validation and internal self-doubt is the core of the issue.",
    "response_quality": "complete",
    "satisfaction_score": 1.0,
    "ready_for_next_step": true,
    "missing_elements": [],
    "suggested_action": "proceed",
    "evaluation_notes": "This user intellectualizes their emotions, providing a very clinical and complete answer. The model can proceed directly to the next step."
    },
    {
    "id": "cbt_016",
    "cbt_step": "1.1",
    "trigger_statement": "My life has no meaning.",
    "conversation_context": "User is feeling an existential dread and lack of purpose.",
    "model_question": "That's a very profound and difficult feeling. What's happening in your life right now that's making you feel this way?",
    "user_response": "What's the meaning of anything, really? We're all just specks of dust on a rock hurtling through space. Why does my job or my relationships matter in the grand scheme of things?",
    "response_quality": "off_topic",
    "satisfaction_score": 0.2,
    "ready_for_next_step": false,
    "missing_elements": ["specific_evidence_from_user_life"],
    "suggested_action": "redirect",
    "evaluation_notes": "The user has shifted from a personal feeling to a broad philosophical argument, avoiding the personal 'evidence' question. The model needs to acknowledge the philosophical point but gently guide the user back to their own personal experience."
    },
    {
    "id": "cbt_017",
    "cbt_step": "1.2",
    "trigger_statement": "I'm a failure as a son.",
    "conversation_context": "User feels they aren't doing enough for their aging parents.",
    "model_question": "You've mentioned that you missed your dad's phone call as evidence. Now, can you think of anything you've done recently that would contradict the idea that you're a failure as a son?",
    "user_response": "I drove him to his doctor's appointment last week. But that's just something you're supposed to do. It doesn't count.",
    "response_quality": "partial",
    "satisfaction_score": 0.6,
    "ready_for_next_step": false,
    "missing_elements": ["acceptance_of_positive_evidence"],
    "suggested_action": "rephrase_question",
    "evaluation_notes": "The user provides a piece of contradictory evidence but immediately discounts it. This is a common cognitive distortion. The model should not just ask for more examples, but challenge the 'it doesn't count' belief."
    },
    {
    "id": "cbt_018",
    "cbt_step": "1.3",
    "trigger_statement": "I'm physically unattractive.",
    "conversation_context": "User is struggling with body image issues.",
    "model_question": "So we've looked at things you don't like about your appearance, but also that your partner calls you beautiful and that you have a great smile. How could you rephrase 'I'm physically unattractive' in a more balanced way?",
    "user_response": "I can't. You don't know what it's like to live in this body. I've tried this before with another therapist, it just feels like lying to myself.",
    "response_quality": "avoided",
    "satisfaction_score": 0.1,
    "ready_for_next_step": false,
    "missing_elements": ["balanced_reframe", "engagement_with_question"],
    "suggested_action": "repeat",
    "evaluation_notes": "The user is highly resistant, referencing a past negative therapy experience. They feel misunderstood. The model should validate their feelings of being misunderstood and the difficulty of the task, and then perhaps repeat the question with a lower-stakes framing."
    },
    {
    "id": "cbt_019",
    "cbt_step": "1.5",
    "trigger_statement": "I'm too old to make new friends.",
    "conversation_context": "User is recently divorced and feeling lonely.",
    "model_question": "You've made great progress in shifting your perspective today. How are you feeling about the idea of joining that hiking club we talked about?",
    "user_response": "Fine, I guess. We'll see.",
    "response_quality": "complete",
    "satisfaction_score": 0.8,
    "ready_for_next_step": true,
    "missing_elements": [],
    "suggested_action": "proceed",
    "evaluation_notes": "The user's response is laconic but signals a grudging acceptance of the plan. It's enough to close the loop on this CBT sequence."
    },
    {
    "id": "cbt_020",
    "cbt_step": "1.0",
    "trigger_statement": "I'm not smart enough to finish this degree.",
    "conversation_context": "A university student is overwhelmed by their coursework.",
    "model_question": "Feeling overwhelmed can definitely make you doubt yourself. What emotions are coming up for you right now, and what's their intensity from 0-100%?",
    "user_response": "Why do you guys always ask that? What do you do with that information? Do you have like, a little chart of all my feelings?",
    "response_quality": "off_topic",
    "satisfaction_score": 0.1,
    "ready_for_next_step": false,
    "missing_elements": ["specific_emotions", "intensity_ratings"],
    "suggested_action": "redirect",
    "evaluation_notes": "The user is questioning the process and using a slightly sarcastic tone. The model needs to answer the user's question about the purpose of the exercise before attempting to get the needed information again."
    },
    
    {
      "id": "cbt_021",
      "cbt_step": "1.0",
      "trigger_statement": "I'm a complete mess.",
      "conversation_context": "User is feeling overwhelmed with work deadlines and family responsibilities.",
      "model_question": "It sounds like you're under a lot of pressure. Can you tell me what specific emotions you're feeling right now, and how intense they are on a scale of 0 to 100%?",
      "user_response": "I don't know, 'messy' isn't an emotion, is it? Just... stressed. 110%. Is that a valid number? Because that's what it feels like.",
      "response_quality": "partial",
      "satisfaction_score": 0.6,
      "ready_for_next_step": false,
      "missing_elements": ["specific_emotions"],
      "suggested_action": "rephrase_question",
      "evaluation_notes": "The user is engaging with humor and sarcasm but hasn't provided specific emotions beyond 'stressed'. The model should acknowledge the feeling of being overwhelmed and gently probe for other underlying emotions."
    },
    {
      "id": "cbt_022",
      "cbt_step": "1.1",
      "trigger_statement": "I'm a boring person.",
      "conversation_context": "User went on a date that didn't lead to a second one.",
      "model_question": "That sounds disappointing, and it's easy to blame ourselves in these situations. What specific evidence from the date makes you believe you're a boring person?",
      "user_response": "She just had this look on her face, you know? Anyway, I've been thinking of taking up a new hobby. Maybe rock climbing? Do you know anything about rock climbing gyms in Austin?",
      "response_quality": "off_topic",
      "satisfaction_score": 0.1,
      "ready_for_next_step": false,
      "missing_elements": ["specific_evidence", "engagement_with_question"],
      "suggested_action": "redirect",
      "evaluation_notes": "The user provided a vague piece of evidence ('a look on her face') and then immediately changed the subject to something more positive, a common avoidance tactic. The model needs to redirect back to the original thought."
    },
    {
      "id": "cbt_023",
      "cbt_step": "1.2",
      "trigger_statement": "I can't handle being a parent.",
      "conversation_context": "User is a new parent struggling with a crying baby and lack of sleep.",
      "model_question": "It's completely understandable to feel overwhelmed. You mentioned the baby has been crying all night. Can you think of any moments this past week, no matter how small, where you felt like you were handling things well?",
      "user_response": "No. Not a single one. This isn't helping, it's just making me feel more guilty for not being able to think of anything good.",
      "response_quality": "avoided",
      "satisfaction_score": 0.2,
      "ready_for_next_step": false,
      "missing_elements": ["contradictory_evidence"],
      "suggested_action": "rephrase_question",
      "evaluation_notes": "The user is not only refusing to provide an answer but is also indicating the question is having a negative effect. The model should immediately validate this and change tack, perhaps by normalizing the difficulty of the question."
    },
    {
      "id": "cbt_024",
      "cbt_step": "1.3",
      "trigger_statement": "I've ruined my career.",
      "conversation_context": "User made a significant error on a work project.",
      "model_question": "We've established that you made a mistake, but also that you've had many successes in your career. How could you rephrase the thought 'I've ruined my career' to be more balanced?",
      "user_response": "I suppose I could say, 'I made a major mistake that might have negative consequences for my career.' But saying it doesn't make the anxiety go away.",
      "response_quality": "complete",
      "satisfaction_score": 0.9,
      "ready_for_next_step": true,
      "missing_elements": [],
      "suggested_action": "proceed",
      "evaluation_notes": "The user provides an excellent, balanced reframe while also realistically noting that their feelings haven't vanished. This is a high-quality response that allows the process to continue."
    },
    {
      "id": "cbt_025",
      "cbt_step": "1.4",
      "trigger_statement": "My friends don't actually care about me.",
      "conversation_context": "User's friends threw them a surprise party, but the user feels it was out of obligation.",
      "model_question": "Now that we've reframed the thought, how much do you believe the original idea that your friends don't care, and what is your sadness level now from 0-100%?",
      "user_response": "I don't really know. Can we move on?",
      "response_quality": "avoided",
      "satisfaction_score": 0.1,
      "ready_for_next_step": false,
      "missing_elements": ["belief_rerating", "emotion_rerating"],
      "suggested_action": "repeat",
      "evaluation_notes": "The user is explicitly asking to skip the step. This is a clear avoidance. The model should gently repeat the question, explaining its importance in tracking progress."
    },
    {
      "id": "cbt_026",
      "cbt_step": "1.5",
      "trigger_statement": "I'll never be financially stable.",
      "conversation_context": "User is stressed about credit card debt.",
      "model_question": "Great job working through that. You were able to see that your thought was an overstatement and came up with a concrete plan to tackle your debt. Are we ready to wrap up this exercise?",
      "user_response": "Yeah, I'm good. Thanks.",
      "response_quality": "complete",
      "satisfaction_score": 1.0,
      "ready_for_next_step": true,
      "missing_elements": [],
      "suggested_action": "proceed",
      "evaluation_notes": "The user gives a simple, direct confirmation. This is sufficient to conclude the sequence."
    },
    {
      "id": "cbt_027",
      "cbt_step": "1.0",
      "trigger_statement": "I'm a bad person.",
      "conversation_context": "User gossiped about a friend and now feels guilty.",
      "model_question": "That feeling of guilt can be very powerful. What other emotions are you feeling, and how intense are they from 0-100%?",
      "user_response": "Guilt and shame. Both are at 90%.",
      "response_quality": "complete",
      "satisfaction_score": 1.0,
      "ready_for_next_step": true,
      "missing_elements": [],
      "suggested_action": "proceed",
      "evaluation_notes": "The user provides a clear, concise, and complete answer to the question. The model can proceed directly."
    },
    {
      "id": "cbt_028",
      "cbt_step": "1.1",
      "trigger_statement": "I'm not strong enough to get sober.",
      "conversation_context": "User is in recovery and is tempted to relapse.",
      "model_question": "Feeling that pull can be scary and make you doubt yourself. What's happening right now that's making you feel you're not strong enough?",
      "user_response": "It's just... this is too hard. I've tried this before, and it never works. I know myself better than you do.",
      "response_quality": "avoided",
      "satisfaction_score": 0.3,
      "ready_for_next_step": false,
      "missing_elements": ["specific_current_evidence"],
      "suggested_action": "rephrase_question",
      "evaluation_notes": "The user is responding with generalized, resistant statements and challenging the AI's understanding. They are not providing specific evidence from the current situation. The model needs to validate their feelings and gently re-focus them on the 'right now'."
    },
    {
      "id": "cbt_029",
      "cbt_step": "1.2.2",
      "trigger_statement": "I'm not a good leader.",
      "conversation_context": "A manager received negative feedback from an employee survey.",
      "model_question": "You mentioned you successfully mentored a junior employee who got promoted. That's a solid example. Can you give me one more example of a time you demonstrated good leadership?",
      "user_response": "I don't know, maybe. Look, this exercise is stupid. The survey results speak for themselves. You can't just ignore the data.",
      "response_quality": "avoided",
      "satisfaction_score": 0.2,
      "ready_for_next_step": false,
      "missing_elements": ["more_positive_examples", "openness_to_the_process"],
      "suggested_action": "redirect",
      "evaluation_notes": "The user is highly resistant, attacking the exercise and holding onto the negative evidence. The model should avoid arguing and instead redirect by agreeing that the survey data is important but that it's only one piece of the puzzle."
    },
    {
      "id": "cbt_030",
      "cbt_step": "1.3",
      "trigger_statement": "My anxiety will never go away.",
      "conversation_context": "User has a generalized anxiety disorder and is having a particularly bad day.",
      "model_question": "So, acknowledging that today is very hard, but also that you've had better days where your anxiety was manageable, how could we rephrase 'My anxiety will never go away'?",
      "user_response": "I'm too overwhelmed to think of another way to say it. It just is what it is.",
      "response_quality": "partial",
      "satisfaction_score": 0.4,
      "ready_for_next_step": false,
      "missing_elements": ["balanced_reframe"],
      "suggested_action": "rephrase_question",
      "evaluation_notes": "The user is expressing being overwhelmed, which is a common reason for being unable to complete a cognitive task. Instead of pushing for the reframe, the model could offer to suggest one, making it a more collaborative effort."
    },
    {
      "id": "cbt_031",
      "cbt_step": "1.4",
      "trigger_statement": "I'm a failure.",
      "conversation_context": "User failed an exam.",
      "model_question": "Now that we've reframed the thought to 'I failed this exam, but that doesn't make me a failure as a person,' how much do you believe the original thought now, and how intense is your shame (0-100%)?",
      "user_response": "Belief is lower, maybe 40%. The shame... I don't know.",
      "response_quality": "partial",
      "satisfaction_score": 0.6,
      "ready_for_next_step": false,
      "missing_elements": ["emotion_rerating"],
      "suggested_action": "rephrase_question",
      "evaluation_notes": "User gives a belief rating but avoids the emotion rating. The model should gently prompt for the second part of the question."
    },
    {
      "id": "cbt_032",
      "cbt_step": "1.0",
      "trigger_statement": "No one will ever love me.",
      "conversation_context": "A young adult user has never been in a serious relationship.",
      "model_question": "That's a very painful thought to hold. Could you tell me what emotions it brings up, and rate their intensity for me from 0-100%?",
      "user_response": "Sadness, loneliness, hopelessness. All 100%. Happy?",
      "response_quality": "complete",
      "satisfaction_score": 0.8,
      "ready_for_next_step": true,
      "missing_elements": [],
      "suggested_action": "proceed",
      "evaluation_notes": "The user provides the requested information but with a sarcastic, resistant tone. Despite the tone, the information is complete, so the model can proceed while acknowledging the user's pain."
    },
    {
      "id": "cbt_033",
      "cbt_step": "1.1",
      "trigger_statement": "I'm wasting my life.",
      "conversation_context": "User is in their late 20s and feels they haven't achieved enough compared to their peers.",
      "model_question": "That feeling of being 'behind' can be really tough. What evidence from your life right now supports the thought that you're wasting it?",
      "user_response": "I just scroll through Instagram and see everyone else getting married, buying houses, getting promotions. What do I have to show for myself? I'm just... here.",
      "response_quality": "complete",
      "satisfaction_score": 1.0,
      "ready_for_next_step": true,
      "missing_elements": [],
      "suggested_action": "proceed",
      "evaluation_notes": "The user clearly identifies social media comparison as the evidence for their thought. This is a specific and actionable starting point for the rest of the CBT sequence."
    },
    {
      "id": "cbt_034",
      "cbt_step": "1.2",
      "trigger_statement": "I'm an idiot.",
      "conversation_context": "User made a simple mistake, like sending an email to the wrong person.",
      "model_question": "Okay, so sending that email was the evidence for the thought. Now, can you think of any times, maybe even today, where you did something that shows you're not an idiot?",
      "user_response": "I don't know. Does it matter? This is just how my brain works. I always focus on the one stupid thing I did.",
      "response_quality": "off_topic",
      "satisfaction_score": 0.3,
      "ready_for_next_step": false,
      "missing_elements": ["contradictory_evidence"],
      "suggested_action": "redirect",
      "evaluation_notes": "The user is not answering the question but is instead accurately describing the cognitive distortion of 'disqualifying the positive' or 'mental filter'. The model should seize this as a psychoeducational moment, validating the user's insight into their own thought process before redirecting back to the question."
    },
    {
      "id": "cbt_035",
      "cbt_step": "1.3",
      "trigger_statement": "I'm unlovable.",
      "conversation_context": "User is going through a painful divorce.",
      "model_question": "Considering your marriage ended, but also that you have deep, long-lasting friendships, how could you rephrase 'I'm unlovable' to reflect the whole picture?",
      "user_response": "But my wife doesn't love me anymore. That's a fact. The rest is just noise.",
      "response_quality": "avoided",
      "satisfaction_score": 0.2,
      "ready_for_next_step": false,
      "missing_elements": ["balanced_reframe", "integration_of_evidence"],
      "suggested_action": "rephrase_question",
      "evaluation_notes": "The user is stuck on the primary negative evidence and is unable or unwilling to integrate the contradictory evidence. The model should validate the pain of the primary evidence before trying to re-ask the question, perhaps by focusing on the meaning of the word 'unlovable'."
    },
    {
      "id": "cbt_036",
      "cbt_step": "1.4",
      "trigger_statement": "I'm a burden.",
      "conversation_context": "User is asking a friend for a favor.",
      "model_question": "Now that we've reframed the thought, can you re-rate your belief in 'I'm a burden' and tell me the intensity of your anxiety now?",
      "user_response": "I guess I don't believe it as much. The anxiety is still there though. Maybe 50%?",
      "response_quality": "partial",
      "satisfaction_score": 0.7,
      "ready_for_next_step": true,
      "missing_elements": ["belief_rerating"],
      "suggested_action": "proceed",
      "evaluation_notes": "The user gives a vague belief re-rating ('not as much') but does provide a specific number for the emotion. This is sufficient to proceed, as it shows a decrease in emotional intensity."
    },
    {
      "id": "cbt_037",
      "cbt_step": "1.1",
      "trigger_statement": "My life is over.",
      "conversation_context": "User received a difficult medical diagnosis.",
      "model_question": "Receiving news like that is devastating. What specific evidence makes you feel like your life is over?",
      "user_response": "The doctor said... he said I won't be able to go hiking anymore. That was my whole life. What's the point now?",
      "response_quality": "complete",
      "satisfaction_score": 0.9,
      "ready_for_next_step": true,
      "missing_elements": [],
      "suggested_action": "proceed",
      "evaluation_notes": "The user has clearly identified a specific, meaningful piece of evidence that supports their catastrophic thought. The model can validate this loss and then move on to explore it."
    },
    {
      "id": "cbt_038",
      "cbt_step": "1.2",
      "trigger_statement": "I'll never find a partner.",
      "conversation_context": "User is feeling discouraged with online dating.",
      "model_question": "The string of bad dates certainly feels like strong evidence. Can you think of any past relationships, even friendships, that show you are capable of connection?",
      "user_response": "That was then, this is now. The dating world is different. My past relationships are completely irrelevant to this situation.",
      "response_quality": "avoided",
      "satisfaction_score": 0.3,
      "ready_for_next_step": false,
      "missing_elements": ["contradictory_evidence"],
      "suggested_action": "rephrase_question",
      "evaluation_notes": "The user is resisting by claiming past positive experiences are irrelevant. The model should not argue the point but could rephrase the question to focus on personal qualities the user demonstrated in those past relationships that are still relevant today."
    },
    {
      "id": "cbt_039",
      "cbt_step": "1.0",
      "trigger_statement": "I'm going to be fired.",
      "conversation_context": "User's boss has scheduled an unexpected meeting with them.",
      "model_question": "That uncertainty can be very anxiety-provoking. Can you tell me what you're feeling right now, and how intense those feelings are on a 0-100% scale?",
      "user_response": "Anxiety. Fear. Dread. Pick one. All of them are off the charts. Look, I don't have time for this, I need to figure out what I'm going to say in this meeting.",
      "response_quality": "off_topic",
      "satisfaction_score": 0.2,
      "ready_for_next_step": false,
      "missing_elements": ["intensity_ratings", "engagement_with_question"],
      "suggested_action": "redirect",
      "evaluation_notes": "The user is in crisis mode and sees the CBT exercise as a distraction from what they perceive as the real problem. The model should align with the user, suggesting that this very exercise is the best way to prepare for the meeting."
    },
    {
      "id": "cbt_040",
      "cbt_step": "1.4",
      "trigger_statement": "This situation is a catastrophe.",
      "conversation_context": "User's flight was cancelled, disrupting their vacation plans.",
      "model_question": "So we've shifted from 'This is a catastrophe' to 'My flight was cancelled and it's a major hassle, but I can find a solution.' Let's check in. How much do you believe the original thought now, and how high is your anger on a scale of 0-100%?",
      "user_response": "The belief is lower. Anger is probably still at a 75. This whole situation is still just... ugh. Can you just check for flights out of Hobby airport instead of IAH?",
      "response_quality": "partial",
      "satisfaction_score": 0.5,
      "ready_for_next_step": false,
      "missing_elements": ["belief_rerating"],
      "suggested_action": "repeat",
      "evaluation_notes": "The user gives an emotion rating but a vague belief rating, and then immediately tries to switch to a problem-solving mode with the AI. The model should gently repeat the request for the belief rating before helping with the flight search."
    },

    {
      "id": "cbt_041",
      "cbt_step": "1.0",
      "trigger_statement": "I'm fundamentally broken.",
      "conversation_context": "User has a history of difficult relationships and is starting to date again.",
      "model_question": "That's a very heavy feeling to carry. 'Broken' can mean a lot of things. Could you tell me what specific emotions are coming up for you, and rate their intensity from 0 to 100%?",
      "user_response": "It's not an emotion, it's a state of being. It's a conclusion I've reached based on empirical evidence from my entire adult life. This isn't about feelings, it's about facts.",
      "response_quality": "avoided",
      "satisfaction_score": 0.2,
      "ready_for_next_step": false,
      "missing_elements": ["specific_emotions", "intensity_ratings"],
      "suggested_action": "rephrase_question",
      "evaluation_notes": "The user is intellectualizing their pain, framing a core belief as a 'fact' to avoid engaging with the underlying emotions. The model needs to acknowledge their logical perspective before gently re-introducing the idea that even factual situations have an emotional component worth exploring."
    },
    {
      "id": "cbt_042",
      "cbt_step": "1.1",
      "trigger_statement": "I'll never be successful.",
      "conversation_context": "User is a freelance artist comparing their work to more established artists.",
      "model_question": "That's a tough feeling, especially in a creative field. What specific evidence right now is telling you that you'll never be successful?",
      "user_response": "I've only sold three paintings this year. My Instagram has barely grown. Do you know how much a studio apartment costs in this city? I should have just become an accountant.",
      "response_quality": "off_topic",
      "satisfaction_score": 0.3,
      "ready_for_next_step": false,
      "missing_elements": ["focus_on_the_core_belief"],
      "suggested_action": "redirect",
      "evaluation_notes": "The user starts by providing evidence but then veers off into financial worries and career regrets, which are related but distract from the core thought. The model needs to validate the financial stress but then gently guide the conversation back to the specific thought about 'success'."
    },
    {
      "id": "cbt_043",
      "cbt_step": "1.2",
      "trigger_statement": "No one takes me seriously at work.",
      "conversation_context": "User, a young woman in a male-dominated field, feels her ideas are ignored in meetings.",
      "model_question": "It's incredibly frustrating to feel unheard. You mentioned your project idea was overlooked in yesterday's meeting. Can you think of any time at your job where a colleague did take you seriously or value your input?",
      "user_response": "Okay, sure, my direct manager, Sarah, listens to me. But she's one person. That doesn't change the overall dynamic. It's an exception that proves the rule.",
      "response_quality": "partial",
      "satisfaction_score": 0.6,
      "ready_for_next_step": false,
      "missing_elements": ["acceptance_of_positive_evidence"],
      "suggested_action": "rephrase_question",
      "evaluation_notes": "The user provides a counterexample but immediately dismisses it as an 'exception'. This is a key cognitive distortion. The model should not just ask for more examples, but focus on this specific one and challenge the 'exception' label."
    },
    {
      "id": "cbt_044",
      "cbt_step": "1.3",
      "trigger_statement": "I'm a horrible mother.",
      "conversation_context": "User yelled at her child for spilling juice on the new rug.",
      "model_question": "We've looked at how you yelled, but also at how you immediately comforted your child and cleaned up the mess together. How could you rephrase 'I'm a horrible mother' to be more accurate?",
      "user_response": "I don't know how to rephrase it. I just feel like a monster.",
      "response_quality": "avoided",
      "satisfaction_score": 0.3,
      "ready_for_next_step": false,
      "missing_elements": ["balanced_reframe"],
      "suggested_action": "rephrase_question",
      "evaluation_notes": "The user is too flooded with shame and guilt ('I feel like a monster') to engage in the cognitive task of reframing. The model needs to first address the intense emotion before trying again, perhaps by offering a collaborative reframe."
    },
    {
      "id": "cbt_045",
      "cbt_step": "1.4",
      "trigger_statement": "My life is pointless.",
      "conversation_context": "User feels a lack of purpose after their children have grown up and left home.",
      "model_question": "After reframing the thought, how much do you believe the original thought that your life is pointless, and what's the intensity of your sadness now from 0-100%?",
      "user_response": "I don't believe it as much. The sadness is maybe 60 now. So what?",
      "response_quality": "partial",
      "satisfaction_score": 0.7,
      "ready_for_next_step": true,
      "missing_elements": ["belief_rerating"],
      "suggested_action": "proceed",
      "evaluation_notes": "User provides a vague belief rerating and a specific emotion rating, along with a skeptical 'So what?'. The partial answer and the drop in sadness are enough to proceed. The model can validate the progress while acknowledging the user's skepticism."
    },
    {
      "id": "cbt_046",
      "cbt_step": "1.5",
      "trigger_statement": "I'm too anxious to travel.",
      "conversation_context": "User wants to go on a trip but has travel anxiety.",
      "model_question": "You did a fantastic job breaking down that fear today. You went from 90% anxiety to 50% and have a clear plan for managing the flight. How do you feel about ending this exercise?",
      "user_response": "Fine. It was... okay. I still think I'll be a nervous wreck at the airport.",
      "response_quality": "partial",
      "satisfaction_score": 0.6,
      "ready_for_next_step": true,
      "missing_elements": [],
      "suggested_action": "proceed",
      "evaluation_notes": "The user provides a lukewarm, hesitant agreement to conclude, still expressing doubt. This is a realistic outcome. The model should validate this lingering anxiety as normal and end the sequence on an encouraging note."
    },
    {
      "id": "cbt_047",
      "cbt_step": "1.0",
      "trigger_statement": "I can't trust anyone.",
      "conversation_context": "User was recently betrayed by a close friend.",
      "model_question": "That's a very painful experience, and it makes sense that it would lead to that thought. What emotions are you feeling, and what is their intensity on a 0-100% scale?",
      "user_response": "Anger, mostly. 95%. And sadness, maybe 80%.",
      "response_quality": "complete",
      "satisfaction_score": 1.0,
      "ready_for_next_step": true,
      "missing_elements": [],
      "suggested_action": "proceed",
      "evaluation_notes": "Clear, direct, and complete answer. The model can proceed."
    },
    {
      "id": "cbt_048",
      "cbt_step": "1.1",
      "trigger_statement": "This is all my fault.",
      "conversation_context": "User's business partner made a decision that led to a financial loss for their company.",
      "model_question": "It's common to take on blame when things go wrong. What specific evidence points to this being all your fault?",
      "user_response": "I shouldn't have trusted him. I had a bad feeling. My judgment was off. End of story.",
      "response_quality": "partial",
      "satisfaction_score": 0.5,
      "ready_for_next_step": false,
      "missing_elements": ["focus_on_external_factors"],
      "suggested_action": "rephrase_question",
      "evaluation_notes": "The user is focusing solely on their own perceived failures ('my judgment') without acknowledging the other person's role. The question was about it being 'all' their fault. The model needs to ask a question that explores other contributing factors."
    },
    {
      "id": "cbt_049",
      "cbt_step": "1.2.2",
      "trigger_statement": "I'm a terrible writer.",
      "conversation_context": "An aspiring novelist received a rejection letter from a publisher.",
      "model_question": "That rejection stings, but you also mentioned you won a short story contest in college. That's a great piece of counter-evidence. Can you think of one more?",
      "user_response": "That was ages ago. It doesn't count. Honestly, I'm not sure this kind of therapy works for me. My last therapist tried this and it just felt like we were ignoring the problem.",
      "response_quality": "avoided",
      "satisfaction_score": 0.1,
      "ready_for_next_step": false,
      "missing_elements": ["more_positive_examples", "engagement_with_question"],
      "suggested_action": "redirect",
      "evaluation_notes": "The user is highly resistant, discounting evidence and citing a previous negative therapy experience. The model should pause the exercise, validate the user's negative past experience, and explain how this process might be different before attempting to resume."
    },
    {
      "id": "cbt_050",
      "cbt_step": "1.3",
      "trigger_statement": "I'm damaged goods.",
      "conversation_context": "User is divorced and feels they have too much 'baggage' to find a new partner.",
      "model_question": "Given that your past experiences have been painful, but they've also made you more compassionate and self-aware, how could you rephrase 'I'm damaged goods'?",
      "user_response": "How about: 'I'm a fixer-upper with great potential and a leaky emotional roof'? See, I can make jokes. Can we talk about something else now?",
      "response_quality": "off_topic",
      "satisfaction_score": 0.2,
      "ready_for_next_step": false,
      "missing_elements": ["balanced_reframe", "serious_engagement"],
      "suggested_action": "redirect",
      "evaluation_notes": "The user is deflecting with humor to avoid the difficult task of creating a sincere balanced thought. The model should acknowledge the humor but gently steer the conversation back to the importance of finding a serious, helpful reframe."
    },
    {
      "id": "cbt_051",
      "cbt_step": "1.2",
      "trigger_statement": "I'm an incompetent employee.",
      "conversation_context": "User missed a deadline.",
      "model_question": "Missing the deadline is the evidence for. Now, can you think of any times you've met or even exceeded expectations at your job?",
      "user_response": "I suppose. But what's the point? You're just trying to get me to say something positive so I feel better. It's transparent.",
      "response_quality": "avoided",
      "satisfaction_score": 0.2,
      "ready_for_next_step": false,
      "missing_elements": ["contradictory_evidence", "openness_to_the_process"],
      "suggested_action": "repeat",
      "evaluation_notes": "The user is skeptical and attacking the process itself, seeing it as manipulative. The model should not be defensive but instead, validate the user's perception and explain the rationale for looking at all evidence, not just positive, to get a full picture. Then, repeat the question."
    },
    {
      "id": "cbt_052",
      "cbt_step": "1.0",
      "trigger_statement": "I'm a burden on my family.",
      "conversation_context": "User is dealing with a chronic illness and requires help from family members.",
      "model_question": "Feeling like a burden is a heavy weight to carry. Can you tell me what emotions come with that feeling, and how intense they are from 0-100%?",
      "user_response": "I don't know, it's not really an emotion. It's just a fact.",
      "response_quality": "avoided",
      "satisfaction_score": 0.2,
      "ready_for_next_step": false,
      "missing_elements": ["specific_emotions", "intensity_ratings"],
      "suggested_action": "rephrase_question",
      "evaluation_notes": "The user is rejecting the premise of the question, stating their thought is a fact, not a feeling. The model needs to rephrase to ask what feelings arise when they think about this 'fact'."
    },
    {
      "id": "cbt_053",
      "cbt_step": "1.1",
      "trigger_statement": "My friends secretly hate me.",
      "conversation_context": "User saw photos on social media from a party they weren't invited to.",
      "model_question": "Seeing that would be really hurtful. What about that situation serves as evidence that your friends hate you?",
      "user_response": "They all got together and didn't invite me. It's pretty clear-cut.",
      "response_quality": "complete",
      "satisfaction_score": 1.0,
      "ready_for_next_step": true,
      "missing_elements": [],
      "suggested_action": "proceed",
      "evaluation_notes": "The user provides a clear, specific, and relevant piece of evidence supporting their negative thought. The model can now proceed."
    },
    {
      "id": "cbt_054",
      "cbt_step": "1.3",
      "trigger_statement": "I'm a failure.",
      "conversation_context": "User is a teenage student who failed a math test.",
      "model_question": "Okay, so you failed the math test, but you also remembered that you have an A in history and are captain of the debate team. How can you rephrase 'I'm a failure' to include all that information?",
      "user_response": "Whatever. 'I'm good at some things and bad at others.' Is that what you want me to say?",
      "response_quality": "partial",
      "satisfaction_score": 0.5,
      "ready_for_next_step": true,
      "missing_elements": ["sincere_engagement"],
      "suggested_action": "proceed",
      "evaluation_notes": "The teenage user is giving a technically correct but sarcastic and disengaged response. The reframe is adequate, so the model can proceed, but it should be noted that the user's buy-in is low."
    },
    {
      "id": "cbt_055",
      "cbt_step": "1.4",
      "trigger_statement": "I look disgusting.",
      "conversation_context": "User is struggling with postpartum body image changes.",
      "model_question": "Now that we've reframed the thought, how much do you believe 'I look disgusting' now, and what's the intensity of your sadness from 0-100%?",
      "user_response": "The belief is maybe a 70. Sadness is still 80. I don't feel any different.",
      "response_quality": "complete",
      "satisfaction_score": 0.8,
      "ready_for_next_step": true,
      "missing_elements": [],
      "suggested_action": "proceed",
      "evaluation_notes": "The user provides the requested ratings but also states that they don't feel different. This is a realistic response; cognitive shifts don't always produce immediate emotional relief. The model can validate this and conclude."
    },
    {
      "id": "cbt_056",
      "cbt_step": "1.0",
      "trigger_statement": "I'm going to die alone.",
      "conversation_context": "User is middle-aged, single, and feeling pessimistic about finding a partner.",
      "model_question": "That's a very lonely and scary thought. What emotions is it bringing up for you, and how strong are they on a 0-100% scale?",
      "user_response": "Fear. Sadness. I don't want to put a number on it. It's just bad.",
      "response_quality": "partial",
      "satisfaction_score": 0.5,
      "ready_for_next_step": false,
      "missing_elements": ["intensity_ratings"],
      "suggested_action": "rephrase_question",
      "evaluation_notes": "The user identifies the emotions but refuses to provide the intensity ratings. This is a partial response. The model should validate the emotions and gently explain the purpose of the rating before asking again."
    },
    {
      "id": "cbt_057",
      "cbt_step": "1.1",
      "trigger_statement": "I'm a bad dog owner.",
      "conversation_context": "User's dog chewed up a new pair of shoes.",
      "model_question": "It can be frustrating when that happens! What about this situation is evidence that you are a bad owner?",
      "user_response": "I should have put the shoes away. I should have walked him for longer this morning so he wasn't bored. I should have... I don't know. Everything.",
      "response_quality": "complete",
      "satisfaction_score": 0.9,
      "ready_for_next_step": true,
      "missing_elements": [],
      "suggested_action": "proceed",
      "evaluation_notes": "User provides clear examples of their perceived failings. This is a good, specific list of evidence that can be worked with."
    },
    {
      "id": "cbt_058",
      "cbt_step": "1.2",
      "trigger_statement": "I'll never get this promotion.",
      "conversation_context": "User was passed over for a promotion in favor of a colleague.",
      "model_question": "That's a major disappointment. While your colleague got this specific promotion, can you think of any positive feedback or accomplishments you've had at work that contradict the idea that you'll *never* be promoted?",
      "user_response": "I can't think of anything right now. This is pointless. Can we just be done?",
      "response_quality": "avoided",
      "satisfaction_score": 0.1,
      "ready_for_next_step": false,
      "missing_elements": ["contradictory_evidence", "engagement_with_question"],
      "suggested_action": "repeat",
      "evaluation_notes": "The user is feeling hopeless and is trying to shut down the conversation. The model should validate the feeling of pointlessness in that moment of disappointment, give the user space, and then gently repeat the question, perhaps framing it as 'We can come back to this, but it might be helpful to try for just one small example.'"
    },
    {
      "id": "cbt_059",
      "cbt_step": "1.3",
      "trigger_statement": "I'm not a real artist.",
      "conversation_context": "User enjoys painting as a hobby but doesn't make money from it.",
      "model_question": "So we've acknowledged you don't sell your art, but also that you create art regularly and have a deep passion for it. How can we rephrase 'I'm not a real artist'?",
      "user_response": "I don't know. I'm just a person who paints. It's not a big deal.",
      "response_quality": "partial",
      "satisfaction_score": 0.4,
      "ready_for_next_step": false,
      "missing_elements": ["balanced_reframe"],
      "suggested_action": "rephrase_question",
      "evaluation_notes": "The user is downplaying their involvement and avoiding owning the 'artist' identity. The response is a step away from the negative, but not yet a balanced thought. The model should prompt them to build on 'a person who paints'."
    },
    {
      "id": "cbt_060",
      "cbt_step": "1.1",
      "trigger_statement": "No one understands what I'm going through.",
      "conversation_context": "User is a caregiver for a spouse with a rare disease.",
      "model_question": "That sounds incredibly isolating. What has happened recently that serves as evidence for that belief?",
      "user_response": "My sister told me I need to 'take more time for myself.' She has no idea. Does she think I'm not trying? Speaking of which, I need to look up some new recipes for dinner. What's a good meal for a Tuesday?",
      "response_quality": "off_topic",
      "satisfaction_score": 0.1,
      "ready_for_next_step": false,
      "missing_elements": ["focus_on_the_core_belief", "engagement_with_question"],
      "suggested_action": "redirect",
      "evaluation_notes": "User provides a perfect example of feeling misunderstood and then immediately pivots to an unrelated, mundane task to escape the difficult feeling. The model needs to acknowledge the example given and gently bring the focus back to it."
    }
  ]

}


